{
    "canAnalysis": true,
    "chapters": [
        {
            "id": 1,
            "title": "封面",
            "number": 1,
            "fullNumber": "1",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_000.html"
        },
        {
            "id": 2,
            "title": "扉页",
            "number": 2,
            "fullNumber": "2",
            "content": "THE ART OF PHOTOGRAPHY & IMAGE ALGORITHMS 手机影像学：摄影艺术与现代影像算法 陈曦　Stanley　著 人民邮电出版社 北京",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_001.html"
        },
        {
            "id": 3,
            "title": "版权信息",
            "number": 3,
            "fullNumber": "3",
            "content": "图书在版编目（CIP）数据 手机影像学：摄影艺术与现代影像算法/陈曦Stanley著.--北京：人民邮电出版社，2022.10 ISBN　978-7-115-59762-5 Ⅰ.①手…　Ⅱ.①陈…　Ⅲ.①移动电话机—摄影技术　Ⅳ.①J41②TN929.53 中国版本图书馆CIP数据核字（2022）第136890号 ◆著　陈曦　Stanley 责任编辑　胡岩 责任印制　陈犇 ◆人民邮电出版社出版发行　　北京市丰台区成寿寺路11号 邮编　100164　　电子邮件　315@ptpress.com.cn 网址　https://www.ptpress.com.cn 中国电影出版社印刷厂印刷 ◆开本：690×970　1/16 印张：19　　2022年10月第1版 字数：458千字　　2022年10月北京第1次印刷 定价：158.00元 读者服务热线：(010)81055296　印装质量热线：(010)81055316 反盗版热线：(010)81055315 广告经营许可证：京东市监广登字20170147号",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_002.html"
        },
        {
            "id": 4,
            "title": "目录",
            "number": 4,
            "fullNumber": "4",
            "content": "目录",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_003.html"
        },
        {
            "id": 5,
            "title": "内容提要",
            "number": 5,
            "fullNumber": "5",
            "content": "内容提要 本书从技术与艺术两个方面对手机摄影进行了全面、系统的解读，主要内容包括手机计算摄影简介、拍照手机的选择思路、利用手机进行艺术性构图创作、颜色理论的理解与应用、手机拍摄镜头的光学设计与算法、手机风光摄影解析、手机摄影的抓拍与连拍技术、拍出唯美人像的技巧、手机拍摄高质量视频的技术与技巧，等等。全书旨在帮助读者全方位掌握手机摄影的相关理论与实用技法，尽享手机摄影的乐趣，创作出令人艳羡的手机摄影作品。 本书适合广大摄影爱好者，特别是喜欢风光摄影、旅行摄影的、街头摄影的手机用户参考阅读。",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_004.html"
        },
        {
            "id": 6,
            "title": "彩插",
            "number": 6,
            "fullNumber": "6",
            "content": "彩插   Stanley",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_005.html"
        },
        {
            "id": 7,
            "title": "前言",
            "number": 7,
            "fullNumber": "7",
            "content": "前言 如何用手机拍出称心如意的照片？我相信这是很多人心中的疑惑。不同手机的相机很不一样，加上手机的相机没有操作说明书，功能复杂，所以拍出来的照片我们经常不满意。 如果说2010年以后是数码单反和微单普及的时期，那么手机计算摄影的转折点则是在2016年。2016年，iPhone 7 Plus配置了双摄，能够生成虚化效果。安卓阵营的各个手机厂商于是开始注重手机摄影：谷歌发布第一代Pixel手机，在手机拍照上第一次强调HDR的作用；国内各个手机厂商则开始大幅度地投入手机拍照技术研发。那一年，我接到了多家手机公司的拍摄和创作项目，可以说是第一次全程专注地用手机进行创作。 随后的几年是手机计算摄影爆发式发展的几年。相机的画质要有跨代升级一般需要三四年，而在2016年以后，手机计算摄影的跨代升级几乎每半年就要发生一次。厂商在自己的手机发布会上，都会重点介绍手机在影像功能上的配置和创新。其进步离不开庞大的手机拍照市场带来的利润和巨大的研发投入。直播和各类手机社交平台的兴起，更是让影像功能成为用户在选购手机时一个重点考虑的因素。 现在的手机在拍照操作上十分便捷，什么都无须调节，只用按下拍照按键。打开手机拍照应用，手机背后的“超级电脑”就开始运算，这个看不见的复杂过程就是“计算摄影”。手机拍照的大部分参数，用户无法自己调节，大部分参数和效果由系统自动完成设置。这限制了一些我们创作的可能性。但如果我们能了解手机的功能和拍照效果，了解设备的潜能和不足，就能在拍照时做出正确的选择，达到想要的效果。 当然，这个过程离不开必备的摄影知识。阅读本书，就是一个学习摄影的过程。希望你读完本书以后，不管使用什么手机进行创作，都能更加得心应手，也会对未来摄影的发展趋势有更清晰的认识。   在我与大家分享摄影理念的时候，很多人的问题还是：手机/相机要怎么设置，调色思路是什么，我应不应该买某某设备。解决这些问题虽然也很重要，但并不是拍出一张好作品的关键。拍出好的作品，从技术上讲，就是溯本逐源地从技术原理上明白影像技术对于视觉效果和拍摄过程的影响，利用好手上设备的特性，让其符合自己的创作要求和习惯。从艺术上讲，就是内化视觉表达的美学道理，学会规则之后打破规则，让规则内化的同时形成只属于你的个人风格。如若能做到上述两点，我相信你也会从一个拍照的人变成一位真正的摄影师。上述所说的也正是这本书想要教给你的。 学习摄影的过程是一个幻想不断破灭的过程。刚开始我们以为摄影的创作十分方便快捷，毕竟按下快门就能成像，图像来得如此简单。但是后来我们慢慢发现其实影像创作和任何一种其他艺术形式一样，都需要漫长的积累和时间的沉淀，摄影师的作品集很多是其一生创作的缩影。刚开始我们以为，好器材等于好照片，毕竟厂商的宣传总是让人心动。但是升级了拍照设备才发现，没有创作理念的提升和时间上的付出，再好的设备拍出来的照片也都乏善可陈。刚开始我们以为学调色就是在色彩搭配上加加减减，套个设置、预设或者滤镜就能拍出好的效果，后来发现其实调色是我们对光线、场景、美术、器材、后期调色的综合复杂理解。要拍出具有感染力的色彩，其实就是拍出具有感染力的作品。如果一张照片只是颜色悦目，那站在作品的角度，这张照片可能不值一谈。 别慌，我并不是说这本书讲的都是晦涩的艺术理论和充满数学公式的技术原理。书里的所有内容都是基于我自己的创作和用手机拍照的经历。本书在艺术上结合摄影百年以来的艺术和美学经验，在技术上结合公开的论文和行业通识，用最通俗易懂的方式和大家进行分享。文字部分是对相机技术原理和发展的分析，加粗的文字内容往往是和操作相关的技巧；图片部分除了示例图之外，都是我用手机认真拍摄的摄影作品。这些作品尽可能贴近所写的模块，同时也向大家展示手机摄影的可行性，传达手机摄影的美学知识。   本书除了前言部分，内容几乎都是干货。不过我还是想说说我和手机拍照这件事的渊源，以及我对于摄影创作的态度。 从高中开始我就不间断地进行摄影创作，在漫长的73国的留学、工作、摄影、旅行中，我用所有可能的时间和机会去摄影。在这期间，我经历过各种各样的生死考验：袭击抢劫，高原发烧，高山失温，被困无人区，在冰川和冰洞里面滑倒险些坠崖。但与此同时，我对摄影的理解也在日益精进。例如风光摄影，在艺术层面上，风光摄影不是简单地去到一个好看的地方按下快门，而是把你对自然的向往、追随及热忱浓缩在按快门的一瞬间；在技术层面上，风光摄影和我们更能感同身受的人像摄影其实是类似的，需要细化区分纹理和颜色来对画面细节进行表达。而街头摄影则是在平凡的时间流淌当中去捕捉奇迹发生的瞬间，用镜头语言将未经编辑、没有构筑过的生活画面提炼成一种视觉上可以沟通的素材。在技术上，因为街头摄影大多数需要快速拍摄，所以其对器材设置的要求和风光摄影相比有着很大的不同，且后期更偏重人物表达的处理。其他类型的摄影也都是这样，细细研究下去都有其专精之处和共通之处。 硕士阶段我学习的是环境信息和遥感，简单来说就是一个和图像相关的应用科学，比如大家经常看的天气预报就是环境信息应用的一种。在高中的时候，我无法预见未来的摄影领域会有计算摄影的诞生，也从来没想过有一天会成为该行业从业者。但是我相信把自己热爱的事情做到最好就能接入潮流。17年以后，因为专业背景和在摄影方面长时间的积累，我在两家公司担任手机的拍照技术工程师，把自己对摄影的理解放入手机拍照当中，把摄影上的认知和技术融合到手机的技术和图像的风格当中。从研发到样张拍摄，从观察别人如何用手机拍照，到参与手机拍照调研，这让我有机会在行业里深入学习手机拍照的原理，以及了解用户在拍照时的一些习惯和误区。计算摄影的领域大多联系着重要的产品，比如手机或者拥有辅助驾驶功能的汽车，存在很高的信息墙，墙外的观念往往是片面和不全面的。 全职从事相机开发工作的那段时间对我来说是一个深层次的积累过程，这一过程让我有机会和世界上研究前沿的相机和拍照技术的人进行交流，这是一件很幸福的事。现在以顾问身份在行业里打拼的我在了解了学习的方法之后，每一天都在汲取计算摄影世界的知识和养分。行业当中不乏资深人士，这本书能写出来离不开和他们共事时的思维交流和碰撞。 摄影前沿的科技和摄影的未来，都包含在计算摄影这个话题当中。在一百多年来人们不断总结的基础上，摄影观念也在不断改变。 这本书里面的所有内容，大家都可以通过实践来分析验证，不涉及任何相机厂商的原理性内容和商业秘密，即使有也仅限于领域常识，或者官方和媒体公开过的部分。 对了，我在B站、微博、小红书都有摄影相关话题的更新，欢迎大家在全平台搜索“陈曦Stanley”。 好的，接下来我们可以开始拍了！ May the light be with you.",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_006.html"
        },
        {
            "id": 8,
            "title": "第一章 手机摄影时代，技术创新与相机之争",
            "number": 8,
            "fullNumber": "8",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_007.html"
        },
        {
            "id": 9,
            "title": "01 手机摄影的流行与便利",
            "number": 1,
            "fullNumber": "8.1",
            "content": "01 手机摄影的流行与便利   iPhone拍摄。手机拍照的便利让我们可以随时随地创作 手机摄影的流行比我们想象的要来得早。根据2015年的统计数据， iPhone在那年成为人们使用最广泛的拍摄设备，超过了传统的厂商佳能，尼康。在数码单反和微单相机开始逐步占领专业市场之前，手机已经占据了消费级市场。 手机摄影的时代正好赶上4G浪潮正盛的时候，社交平台的兴起使得图片从生产到传播的时间大大缩短。如今，新闻的第一现场素材很多都是使用手机拍摄的。从前的新闻记者用胶片拍下照片，将胶卷寄回给编辑选图，再经过冲洗和排版发布图像。这样的流程在如今无法想象。 手机的高智能化程度降低了拍摄的操作门槛，解放了人们的创作力。拍不到想拍的东西，反而要操心相机的各种设置，这是2010年到2014年数码单反流行时，绝大部分用户的烦恼。基于此，手机将传统的相机设置成全部根据场景和用户习惯自动判断，从而解决了这个问题。 而雨后春笋般的手机第三方App，则解决了人们在后期图片处理方面的烦恼。这些App除了引入胶片时代的色彩风格和老相机的操作体验，还开放了丰富的修片选项、融合了流行审美的效果并配合现实增强的特效，使得人们更容易创作出优秀的摄影作品。有些App甚至还赢得得了专业摄影师的喜爱。 另外，使用手机拍摄的侵略性和压迫感都不强，小小的手机镜头相比于相机上的“长枪短炮”更容易让人接受。大家都熟悉了使用手机拍照，因此大部分人不会对这件事过度反感。总的来说，手机让我们能更融洽地和身边的环境进行互动和拍摄。",
            "level": 2,
            "parentId": 8,
            "valid": 0,
            "href": "index_split_008.html"
        },
        {
            "id": 10,
            "title": "02 流行后的风格缺失与摄影的“艺术沉沦”",
            "number": 2,
            "fullNumber": "8.2",
            "content": "02 流行后的风格缺失与摄影的“艺术沉沦”   华为手机拍摄。在影像风格逐渐趋同的今天，我们要在摄影的艺术化表达中找到自己创作的特性，从而真正进行独具特色的风格化表达 所有手机无论其交互界面和功能设置如何改变，本质上都在追求一个共同的终极目标：让用户按下拍照或者摄录按钮就能拍出满意的内容，而完全不用操心别的事情。手机的第三方App为了赢得更多用户的青睐，都希望拍出的效果能够更多地和大众审美接轨。手机的调试也在做着一样的事情：各个厂家根据大部分用户的喜好，调出让更多人喜欢的拍照产品和图像风格。你在图片里看到的蓝天可能和你个人希望看到的有点出入，但相关技术绝对在往大多数人更喜欢的方向靠近。 人们的表达欲因创作的便捷而更强烈，但是个性化的表达却没有得到发展，甚至被主流的浪潮淹没。 手机摄影让我们的视觉创作拥有了很强的即时性，“人人都是创作者”这句话在拍照工具的便携条件下成为现实。即使是一个声称自己只用手机摄像头来扫二维码的人，也会在发生突发事件和其他值得纪念的时刻打开手机进行记录。手机的拍照功能离我们实在太近了，几乎每部手机都在锁屏界面配置了快捷打开相机的方式。 如果说摄影是创作而拍照是记录的话，那么手机的出现让二者的界限变得更加模糊。曾经大部分的摄影作品是放在艺术馆里面的，和其他艺术品有着类似的性质：在当时当地接受着人们的“朝拜”，以唯一或者少量存在的形式体现稀缺性，因此富有价值。手机拍的照片和其他数码图像一样，可以被无限复刻和显示。手机本身还是一个可以浏览图像的终端——我们在小小的屏幕上，以不适合展示作品的尺寸，快速、浮躁地浏览图像。 这些因素加在一起，让摄影艺术的特性再一次受到质疑。 手机虽然缩短了大众与创作的距离，但是从摄影批判的角度来说，这不见得是一件好事。还记得我们曾经习惯性地拿出手机进行拍摄，却忘记了眼前的美景，忘记了和眼前的人进行互动吗？我们用手机收集着景色，景色却在回忆里褪色了。以为用手机拍下PPT能让我们更好地记住老师的讲课内容，而在我们的脑海中，记忆却因为拍了照而更加模糊，更快地忘记了课堂所学。 手机拍照使得人们距离苏珊·桑塔格在《论摄影》当中提到的拍照概念更近：“拍照行为的本质，是通过占有被摄物和世界建立联系；拍照行为本身，是自我慰藉的一种方式；拍照因相机的谎言性而受到欢迎，同时也因照片的泛滥性而消耗美景。”",
            "level": 2,
            "parentId": 8,
            "valid": 0,
            "href": "index_split_009.html"
        },
        {
            "id": 11,
            "title": "03 计算摄影那么好，为什么相机不用",
            "number": 3,
            "fullNumber": "8.3",
            "content": "03 计算摄影那么好，为什么相机不用 随着手机摄影的兴起，计算摄影的技术和概念在2016年后也逐渐流行。不光是在消费级相机的成像领域，在计算视觉、监控安防、辅助驾驶等领域，计算摄影都发挥着至关重要的作用。 计算摄影有诸多好处，为什么相机不采用如此先进的技术呢？ 算力是大部分人能想到的第一个方面，但不是最主要的原因。要知道手机上计算摄影的大部分工作都需要由手机图像处理芯片、CPU甚至是AI （Artificial Intelligence，人工智能）计算芯片来完成。这些器件在相机上都不存在，就算能在相机上安装，要让相同的算法发挥一样的效果，就必须处理比手机大得多的数据量。目前的大部分计算摄影都不是为相机数据设计的，行业中还不具有这种习惯，所以我们目前还没看到相机上使用太多的计算摄影技术。在相机上使用得最广泛的是基于AI的人眼、动物的追焦技术，在PC端使用得最广泛的是针对相机的RAW图像进一步增强细节或者消除噪点的去噪和超分辨率算法。除此之外，相机应用计算摄影的例子还比较少，但相信这个情况很快就会改变。 另外我认为更重要的一点是，计算摄影在这几年的飞速发展过程中，是用效果牺牲了稳定性的。持有相机的专业用户对于拍摄的稳定性是有着很高的要求的，长时间录制、高速连拍时的一致性和相机的反应能力，以及图片不会出现奇奇怪怪的问题等都是专业用户在进行创作和商业制作时的必然要求。但是计算摄影充满了不确定性：拍摄的多张画面不一致，画面有可能出现这样或那样奇怪的部分。计算摄影目前的发展结果和专业用户的需求是背道而驰的。 这个背道而驰不单单是说计算摄影追求效果高于稳定性，还包括诸多算法本身会对图像的风格产生的巨大影响，随着你阅读本书，你会越来越了解这一点。专业用户都想在底层控制相机的拍摄内容和画面风格，就像获得最好的食材自己煮大餐，而计算摄影大部分是为了用户使用方便，跳过烹饪阶段直接上菜。 所以，很多计算摄影技术目前并不为专业相机所采用。   iPhone拍摄。街头的节日氛围，计算摄影使得用手机拍摄这样的复杂场景成为可能",
            "level": 2,
            "parentId": 8,
            "valid": 0,
            "href": "index_split_010.html"
        },
        {
            "id": 12,
            "title": "04 手机的画质真的超越相机了吗",
            "number": 4,
            "fullNumber": "8.4",
            "content": "04 手机的画质真的超越相机了吗 虽然全面超越还不至于，但是手机厂商在逐步地单点突破。 这个话题已经被讨论很多年了。常常有厂商在发布会上宣称手机的画质已经超过相机。很多人还是无法接受小小的手机可以和动辄好几万元的相机镜头相比。有些人则认为两者的目标用户完全不同，没有可比性。 个人认为，它们同样是数字图像的生产工具，当然可以比。 手机拍照的技术进步幅度要远超相机。这并不是因为相机厂商的研发人员不如手机厂商的研发人员努力，而是逐年萎缩的相机市场难以支撑高昂的研发经费，而拍照作为手机的主要卖点之一，是各个手机厂商的必争之地。虽然竞争激烈使得手机行业之内的信息不流通，但因市场实在太大，所以大家都愿意花大精力和财力做研发。 一项技术的发展需要先在学术上被提出再论证，然后从科学论文变成真正的产品，这中间需要经过很多产品化实践和试错。这个周期的长短决定了拍照技术进步的快慢。在手机计算摄影领域，你可以看到刚发表一两年的论文就已经变成手机发布会上相机功能和特性的宣传点，而计算机上的图像处理软件和相机的相关技术，可能还源自5年甚至10年之前发表的论文。二者技术的发展速度并不在同一层级。 降噪技术是一个比较容易进行客观评价，我们也容易感知的技术。大家感兴趣的话可以对比一下5年前的iPhone和现在的iPhone在拍摄夜景时的噪点差距。可以说前者是马赛克图像，而后者已经比现在许多的无反相机处理得还要干净了。拿现在的相机和10年前的旗舰相机来对比，这样的差距就不是很大，只有仔细看才能看出来。 手机的相机技术在无声无息地发展，某些技术超过相机以后，会使手机拍照效果产生质的变化。在昏暗的路灯环境下拍摄一张夜景人像，拿相机拍，我们需要用一个较快的快门速度来保证人物不模糊。在这个弱光场景中，相机感光度已经高达6400，需要相机在弱光情况下仍然准确判断光源计算白平衡，同时使人物的肤色尽量正常，又要在高感的情况下降噪，同时保留细节。这时候用手机和相机分别拍摄一张照片，手机在这样的场景下有优势，是很多人不愿意承认的现实。 手机拍照进步快，还要归功于AI的大量应用，尤其是人们对于AI-ISP（基于人工智能的图像处理流程芯片和技术）的运用。自从AI被广泛应用后，我们就得承认，看不见摸不着的算法在很多时候能够让手机超过硬件的限制，发挥更大的潜能。“底大一级压死人”是一句老话了，它用来描述传感器因为尺寸差异而在成像能力方面存在不可逾越的鸿沟。但是在工作期间，我也看到过在不考虑算法计算时间的情况下，手机传感器可以借由AI“生成”一张在主观和客观测试上都和全画幅相机拍摄结果不分伯仲的照片。 人们从工业时代以来，已经习惯把物件产生的附加价值归功于其实体的增加和进步。如今无论是计算摄影还是其他领域，看不见摸不着的算法都在发挥着超乎我们想象的作用。   一加手机超广角拍摄。画质已经相当清晰   在同一场景下，相机在创作自由度和底层控制风格上相较于手机还是有着巨大的优势   iPhone手持夜景模式拍摄，于新疆月落之前。手机的限制比较多，难以实现所有创作想法   数码相机+天文改造相机拍摄的冬季星空。在特殊用途的创作上，目前手机仍然不能胜任",
            "level": 2,
            "parentId": 8,
            "valid": 1,
            "href": "index_split_011.html"
        },
        {
            "id": 13,
            "title": "第二章 常常忽略的基础——新手不知，老手不解",
            "number": 9,
            "fullNumber": "9",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_012.html"
        },
        {
            "id": 14,
            "title": "01 选购一台好的拍照手机",
            "number": 1,
            "fullNumber": "9.1",
            "content": "01 选购一台好的拍照手机 手机几乎每个月都有新品发布，下面告诉大家选购拍照手机的思路。 首先是一句大家耳熟能详的话：“随身的那台相机就是最好的相机。”这句话放在手机上也适合。我见过许多朋友专门买一台手机来拍照、一台手机来实现日常功能，其实这样做会降低大家的拍照兴趣。 所以大家要优先选择自己喜欢的手机品牌，然后再根据不同的拍照功能来选择该品牌的手机。那么我们怎么在不了解手机拍照技术的情况之下，选择合适的拍照手机呢？ 那些在发布会和宣传界面上主打拍照的机型，就是各厂商花大精力投入相机研发的机型。营销词汇可能会让我们迷惑，但是厂商都不会在宣传上否定自己的努力。对应到具体的系列，华为是Mate和P系列，小米是数字系列，vivo是X系列，三星是S系列，荣耀是Magic系列。这些系列的定位可能随着各家的产品定位在未来会有所改动。 具体到机型还有很多型号，那么什么型号拍照是最好的呢？当然是镜头配置最高的版本，它往往也是最贵的。但是要注意，厂商一般都会推出Pro、Ultra等和同一代机型其他版本不同时间发布的少量高端旗舰款。大部分时候，你要为那些额外的拍照功能付出更高的价格，所以不太推荐。 总的来说，最好选择各个厂商主打拍照的机型。   vivo手机拍摄于西藏 另外，如果预算有限的话，选择前代和前两代的机型也是可以的，并且非常划算。计算摄影从2016年诞生开始，几乎是每半年到一年都有大幅度的升级和迭代，这个技术进步直观地反映在拍照画质和功能之上。但是在2021年以后，技术进步的节奏明显放缓了。我们也确实在一些品牌的机型当中看到了当代旗舰机型在拍照上和上代旗舰机型相比持平甚至是有所倒退的情况。加上手机的保值属性没那么强，所以在平台上能买到，好的上代或者上两代拍照旗舰机型肯定是较好的选择。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_013.html"
        },
        {
            "id": 15,
            "title": "02 请用原生相机",
            "number": 2,
            "fullNumber": "9.2",
            "content": "02 请用原生相机 无论是什么手机，在手机的原生相机当中，各个厂商都对其摄影功能进行了最深度的优化。我们应该尽量使用原生相机进行拍照或者进行视频录制，如果喜欢第三方应用的某些效果，一定要先用原生相机拍摄，再导入第三方应用进行处理。 所有第三方应用的相机，例如微信、抖音、轻颜相机、Lightroom等，都没办法针对每个厂商的不同手机进行深度优化。绝大部分第三方应用只能通过系统本身提供的接口，简单调用相机的基础功能。所以大部分时候使用第三方应用拍照，其效果会比使用原生相机要差。 除非我们很想直接预览特殊拍摄的效果，比如自拍美颜，以及一些特殊的滤镜效果。这时可以使用第三方应用拍照，其他时候还是推荐大家使用原生相机。   华为手机超广角拍摄，于厦门。使用原生相机能获得最好的画质",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_014.html"
        },
        {
            "id": 16,
            "title": "03 及时更新手机的系统就是更新相机",
            "number": 3,
            "fullNumber": "9.3",
            "content": "03 及时更新手机的系统就是更新相机   vivo手机拍摄。及时升级系统有助于获得更好的拍照效果 手机的系统升级除了对系统部分的优化，也经常包含对相机的优化。手机因为其越来越明显的快消品属性，更新迭代速度特别快，刚买到的新手机一般在开机时就会提示要进行系统升级。 另外，按照各个厂商的节奏，一般新手机发布的三个月或半年内都会有较大的系统更新，其中包括相机算法和拍照效果的更新。这可能导致用户有“更新了系统之后怎么我的相机变差了”的感觉。 这在很多时候是因为个人喜好，比如新版系统所提供的拍照效果在一些风格取向上不符合大家的口味。但是总体来说，系统更新都会优化相机拍摄的稳定性，减少功能异常及大家使用上的一些不舒适感，几乎不会出现有些人问过我的“负优化”的情况。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_015.html"
        },
        {
            "id": 17,
            "title": "04 检查相机的默认设置",
            "number": 4,
            "fullNumber": "9.4",
            "content": "04 检查相机的默认设置   华为手机拍摄于新疆 我们在进入原生相机之后，手机会记忆我们的一些设置，就算关闭原生相机，重启手机之后，一些设置仍然会被保存。比如苹果的动态照片（Live Photo）开关。 有些设置，会在你关闭原生相机或者重启手机之后复位。这是因为厂商觉得恢复这些设置能让用户更好地发挥相机的性能，但是这样的设计却给用户的使用造成了困扰。比如绝大部分手机的视频格式设置默认为1080p、60fps，发布会上宣传的4K拍摄效果需要自己在设置当中打开。 所以每次进入相机的时候，最好都检查一下相机设置。 相机设置在逻辑上面的复杂之处还远不止如此，尤其是在视频功能上。我们调的设置很多时候并不是手机真正使用的设置。很多手机后置多个镜头，无法在一些参数规格上做到统一。所以当你在设置菜单里面设置手机的视频格式为4K、60fps的时候，你可能会发现相机的超广角镜头此刻不能拍视频，或者是长焦的拍摄清晰度明显下降（因为长焦不支持这个规格，相机通过主摄缩放实现长焦的拍摄）。这些都是因为手机的相机内部存在复杂的隐藏逻辑，而我们又无法改变它。 在我们拿到手机的时候，要先了解这些设置是否会因为一段时间后重启相机而复位。 很多安卓手机拥有非常多的复杂拍照效果和功能，我们得经常在拍摄前检查设置。以华为手机为例，很多时候我们觉得拍照效果有些奇怪，可能就是因为忘记关闭了鲜艳模式（相机会记忆用户设置，开关相机之后设置得以保存），造成颜色看起来过于饱和。或者是忘了关闭AI选项，让颜色看起来更风格化但不太真实。 这些相机设置和记忆的逻辑没办法汇总，因为不同的手机之间差异很大，我们只能在使用的时候多注意，然后习惯相机的一些选项。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_016.html"
        },
        {
            "id": 18,
            "title": "05 你的镜头真的脏了",
            "number": 5,
            "fullNumber": "9.5",
            "content": "05 你的镜头真的脏了 镜头脏污时常会影响拍照效果。很多专业的摄影师在用手机拍照时也往往会将其忽略。镜头脏污，轻则造成画面对比度下降、雾化，重则画面出现一些奇奇怪怪的眩光。尤其是拍摄一些路灯、太阳等点光源的时候，会出现条纹状的眩光。这些眩光在形态上不同于镜头光学缺陷导致的眩光。 不同的手机在拍摄的时候，因为镜头位于手机背面的位置不一样，镜头最外层镜头的材质不同，所以脏污的概率也不相同。 在每次拍摄前，我们应该用干净的衣服或者其他布料仔细擦拭镜头。我甚至已经养成了习惯，在拿起任何一台手机拍照的时候，都会让镜头对着光，检查镜头是否干净。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_017.html"
        },
        {
            "id": 19,
            "title": "06 理解手机拍照的所见非所得",
            "number": 6,
            "fullNumber": "9.6",
            "content": "06 理解手机拍照的所见非所得 手机拍照的预览画面和最终在相册里面看到的成片并不一致。这是因为手机预览画面的处理通路和拍照的通路不同，拍照所需的处理会更加复杂，需要额外的处理时间，没办法流畅地形成预览画面。目前画面较为一致的是iPhone系列，这是因为其在拍照和视频方案上相对统一，但是也不能使预览画面和拍出的照片完全一样。所见即所得是所有厂商努力的方向，未来会逐步实现。 使用安卓手机拍照应注意这个问题。我们在使用安卓手机拍照时，在还不熟悉预览画面和成片的差距的时候，应该减少点触对焦、上下拖动画面改变曝光等操作。这时要相信相机不太好的预览画面对应着比较好的成片，特别是在曝光、对比颜色方面相机会进行较大幅度的调整。 很多手机因为存在着复杂的后期处理算法，我们在拍照结束之后点进相册，还会看到照片变化的过程，造成预览画面、刚点进相册看到图像的画面及等一会之后相册里图像的画面效果相差较大。对于手机来说，就算我们更喜欢的是预览画面或者是相机中间处理的结果画面，我们也没有办法让最后成片的效果停留在那个阶段。 如果追求个性化的拍照结果，或者对拍照结果要求有较大的自定义空间，你可以参考后续内容关于各个功能模式及专业模式的讲解。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_018.html"
        },
        {
            "id": 20,
            "title": "07 理解手机拍照在不同设备和应用当中的显示差异",
            "number": 7,
            "fullNumber": "9.7",
            "content": "07 理解手机拍照在不同设备和应用当中的显示差异 手机作为一个拍照产品，从拍摄到成像是一个很重要的过程。相册对于图像的处理和显示，以及图像在不同的社交平台和应用之间显示的效果是一个很大的问题。 “我手机拍的照片在你的手机上看起来不一样”是经常出现的情况。 一般来说，各厂商自家的屏幕和官方的相册都会对用原生相机拍摄的图像做一定的适配和优化。 比如在iPhone系列的手机上，为了发挥其屏幕的优秀观感以及让HDR拍摄的内容能够被更好地显示，iPhone的官方相册在处理HDR内容时会把屏幕当中应用的白色亮度适当降低，然后将画面中光源和亮部的亮度适当调高。这样在视觉效果上就会让你有一种画面比较亮的感觉。 但是如果把图像传输到非iPhone的设备上查看，这样的效果就不太明显了。 我们要知道在相同品牌的设备当中，以非压缩的方式传输图像（微信发送非原图就是一个以压缩方式传输图像的例子），能够让图像以最原汁原味的方式呈现。 另外，还有图像色彩空间的问题，比如iPhone、华为、vivo的手机用的是P3色域的色彩空间定义图像的颜色。这样的图像在转到别的一些应用时，如果没有准确地读取色彩空间或者对色彩空间转换后进行显示，都会造成显示效果的较大差异。   华为手机拍摄于重庆   一加手机拍摄于象山。图中的人造灯光在不同手机的显示屏上会有不小的显示差异 很多手机拍照用户对颜色的准确性有比较高的要求，比如拍摄一些产品的时候，他们对于小小的偏色也会很敏感。我们要理解图像在传输和显示当中的复杂性，图像问题不一定是相机拍摄的问题，很多时候是显示的问题。如果大家遇到了因为上述这些“色彩管理”问题和显示、传输问题造成的偏色，在收集好图片和截图之后，可以和各个厂商的官方售后进行沟通，他们会给出可能的解决方案。显示差异要做到标准化还有一段路要走，我们作为手机拍照用户也可以更快地促成这一改变。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_019.html"
        },
        {
            "id": 21,
            "title": "08 稳持手机——永恒的真理",
            "number": 8,
            "fullNumber": "9.8",
            "content": "08 稳持手机——永恒的真理 “正在改善拍摄画质，请稳持设备”应该是所有华为手机用户在拍照的时候看到最多的一句话了。这背后是由计算摄影的共性——多帧合成决定的。不光是华为手机，其他所有手机都遵循稳持手机能拍得更好的原理。 目前主流手机所拍每张照片几乎都是基于多次曝光、多帧叠加获得的。这些来自同一镜头不同时间拍摄，或者不同镜头同一时间拍摄的多帧信息，被用于降噪（时域去噪）、增加清晰度（超分辨率）、画面融合（大小FOV<视角>融合）、HDR合成（不同曝光的照片）及各种其他处理。画面当中的运动物体和手抖动造成的画面模糊，是多帧叠加的天敌，尤其是对于同一镜头在不同时间拍摄的画面再进行合成的情况（HDR算法）。虽然手机当中有成熟的算法可以判断和剔除抖动的帧，然后将这些手持拍摄过程当中不同位置的图像进行精细的全局和局部对齐，但是手持不稳带来的晃动仍然可能给手机成像造成影响，如效果上的不稳定。有一个小的测试方法：手持手机连续拍摄多张照片，你会发现其中几张出现一些局部不清晰，或是其中几张的高光还原没有另外几张好。这些照片本来都应该差不多，但却出现了效果上的差异，这可能就和拍摄时的抖动有关。 不论是横持还是竖持手机，在没有其他稳定设备的情况下，使用下图所示的方式稳持手机，就能大幅度提高拍到高画质照片的概率。   横向握持手机，左手以“比手枪”姿势握持。纵向握持手机，双手叠加握持",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_020.html"
        },
        {
            "id": 22,
            "title": "09 手机常用的设置菜单和相关选项",
            "number": 9,
            "fullNumber": "9.9",
            "content": "09 手机常用的设置菜单和相关选项 本节会快速地介绍大部分手机的设置菜单里共有的一些选项。这些相机相关的选项基本都在相机应用的设置菜单里面，或者是在“设置”—“应用”—“相机”当中。显示相关的设置则在“设置”—“显示”当中。 画面比例。选用4∶3的比例较好。个别型号的手机，其镜头传感器不是4∶3的比例，这时我们选择推荐的默认比例，就能最大化使用到整个传感器的面积，保证画质。在这里不是很推荐大家使用方画幅或者全屏模式拍照，我们可以在拍摄之后将照片裁剪成方画幅；全屏模式下虽然画面看起来更大，但是拍摄的照片也已经经过了裁切。   vivo手机拍摄于香港。使用全屏模式无法完整利用手机传感器面积 参考线。打开九宫格参考线即可。有些手机提供了一些所谓的构图参考线和黄金分割法参考线、螺旋线的选项，我们在了解了下一章构图部分的内容之后就会知道九宫格参考线以外的构图参考线没有太大的作用。 水平线。水平线用来帮我们在拍摄时保持机位端正，建议打开该选项。 高效/兼容性最佳存储。这是iPhone当中的叫法，有些手机则是让我们选择存储格式。HEIF、HEVC等格式的高效模式能节省内存，但是在解码和传输上存在不便。如果我们用来分享和编辑照片的系统不都来自同一个品牌，建议选择兼容性最高的格式。兼容性最高的格式拍摄的照片经常是JPEG格式的，方便我们进行传输和分享。 至于各个功能菜单的选项应该如何选择和调整，我们会在后续章节当中提到。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_021.html"
        },
        {
            "id": 23,
            "title": "第三章 构图——摄影共同的话题，手机特殊的课题",
            "number": 10,
            "fullNumber": "10",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_022.html"
        },
        {
            "id": 24,
            "title": "01 综述",
            "number": 1,
            "fullNumber": "10.1",
            "content": "01 综述 构图是摄影永恒的话题，是体现摄影创作艺术性最主要的环节之一，通过焦距、俯仰、水平、远近、虚实、布景、画面布局来实现创作者心灵的表达，引导视觉、营造张力或渲染情绪。构图不是简单画一些三等分线，将其分门别类就能练好的技艺。把显示二维抽象化后，构图蕴藏在透视和布局当中；加入了颜色信息和人们的主观理解之后，构图也蕴藏在明暗、颜色对比、重心、张力、虚实当中。 构图的学习要“先立而破”。当你懂得基本规则之后，再尝试打破规则进行创新。我曾看到有人为了将每一张照片套进手机提供的参考线，拿着手机斜45°拍摄。这就属于在没有掌握基本规则的情况下过早打破规则。我也看到过学习了构图基本规则的拍摄者，因为受制于三分法、对称构图等理论，拍出来的照片略显乏味。很多时候对称构图是最没有生命力和死板的构图，这就属于在掌握了规则以后没有打破规则。在这里，我们结合手机特性来说构图方法，构图本身的理论和美学的知识则尽可能介绍。另外，本书的照片都是用手机拍摄的，本身就相当于一个构图的教程，告诉了大家用手机进行不同构图的可能性。   vivo手机拍摄于俄罗斯。采用几种构图方法的组合，我们要内化构图审美，而不要套用公式   华为手机拍摄于纳米比亚",
            "level": 2,
            "parentId": 23,
            "valid": 0,
            "href": "index_split_023.html"
        },
        {
            "id": 25,
            "title": "02 如何变焦——手机有多个镜头的根本原因",
            "number": 2,
            "fullNumber": "10.2",
            "content": "02 如何变焦——手机有多个镜头的根本原因 我相信很多iPhone用户不知道iPhone的第二个和第三个镜头是做什么用的（尤其是在iPhone XS之前）。随着手机对拍摄功能的宣传越来越多，相关的知识也逐渐普及。手机拍摄模组当中的多镜头设计主要是为了变焦考虑的，换句话说，就是为了让手机拍得更广和拍得更远。不同于我们在相机镜头上通过转动变焦环进行的连续变焦过程，手机利用多个镜头接力进行变焦的过程是不连续的，每个镜头仅代表一个拍摄焦距，中间的焦距是通过数字变焦或者混合变焦的方式来获得的。 在手机变焦的时候，我们优先通过点选而不是缩放或者轮盘的方式来选择合适的焦段。通过点选的方式，我们能使用手机的原生焦段进行拍摄，这样拍出的画质最好。 当我们通过缩放或轮盘的方式进行变焦的时候，这个变焦过程是怎样的呢？我以某款手机的具体方案为例： 超广角镜头（0.5x，等效13mm）—（数字变焦）—广角镜头（1x，主摄，等效26mm）—（数字变焦）—（大小FOV混合）—长焦镜头（3x，等效75mm）—（数字变焦）。   DXO上的混合变焦示意图 数字变焦是指对画面进行裁切后，输出一张拍摄得更远，但尺寸和裁切前相同的图像。这个过程不是简单的插值运算，由于有超分辨率和其他增加清晰度的算法的加入，所以相比于用户直接拍摄后自己裁切成相同大小，清晰度的表现会稍好。我们想拍多远就在预览画面时进行缩放，调整到对应的焦距，不要通过后期裁图。 在广角镜头和长焦镜头的变焦之间，当数字变焦超过一定范围的时候，会有大小FOV混合的加入，这时图像中心的部分由长焦镜头呈现，图像四周的部分则由广角镜头裁切后，拼接在图像周围。此时，图像的中心和四周的清晰度存在很大的差异。 这样差异不像传统光学镜头在四个边角，因为光学缺陷而造成的成像清晰度变化，是由中心到四角逐步变差的，而大小FOV混合造成的中心和四周清晰度不同是突变的。当然，随着这个方案逐渐成熟，清晰度的差异越来越不可察觉了。但目前来说，这种混合变焦方式产生的图像会有一定的怪异感，尤其在放大看的时候。 另外，有些手机出于边缘画质，用户默认喜欢的焦距范围及相机镜头和传感器匹配的考虑，镜头的原生焦距不等于手机所提供的默认焦距。在光线比较好的地方，我们对着稍远的位置可以慢慢从最广的焦距缓慢变焦来看看有没有这种情况。在镜头进行切换的时候我们能察觉到预览画面有画质和位置的轻微变化，如果这个发生轻微变化的焦距不是相机默认提供的焦距。那么恭喜你，为了利用完整的传感器面积，你可以在默认焦段的基础上缩小画面来达到和默认焦段几乎一样好的画质以及更广的视角。 以华为P系列的某款手机为例，在变焦的过程中，默认打开相机时，标为一倍变焦的1x等效焦距约为26mm视角，但是此时画面已经存在裁切，没有应用到100%的传感器面积。这款手机的0.8x等效焦距约为23mm视角，才使用到了传感器的全部面积。对应的，4.8倍变焦而不是默认的5倍变焦的时候，就已经完全切换到了长焦的镜头。   华为手机拍摄于内蒙古。长焦4.5倍光学变焦 另外，变焦时的操作方式也有讲究。如果不是点选原生焦段，我们在双手握持手机的时候可以使用两指缩放画面来变焦。而对于iPhone，单手持机的时候，我们可以用大拇指滑动变焦倍率的数字来调出变焦拨盘以实现变焦，在操作上更为方便。   华为手机拍摄。10倍光学变焦   iPhone拍摄。10倍数码变焦",
            "level": 2,
            "parentId": 23,
            "valid": 1,
            "href": "index_split_024.html"
        },
        {
            "id": 26,
            "title": "03 构图靠走位，不靠变焦",
            "number": 3,
            "fullNumber": "10.3",
            "content": "03 构图靠走位，不靠变焦 手机给我们提供了方便的全焦段覆盖，然而大部分人容易被这种方便的变焦惯坏——杵在原地不动，只通过变焦进行拍摄。 在变焦的过程当中，其实物体之间的透视关系并不会发生改变。我们在完全相同的位置拍一张广角图像然后裁图，和长焦镜头所拍摄的图像内容是相同的。 也就是说，画面的故事性不会发生变化。要改变画面的故事性，必须通过改变元素之间的关系来完成，也就是改变构图。如果我们把构图变成一个动态过程并且考虑构图的开始和结束，就变成了录像当中的“运镜”。当你遇见一个好的拍摄画面的时候，不要拍一张就走，要尝试变换角度进行拍摄。在尝试当中，你会发现自己的构图功力进步得很快。摄影师在发现有趣的事物时，也会通过观察来不断调整和改变构图，从而达到不一样的视觉效果，再在选片的过程中选取构图和故事性最满意的一张。   iPhone长焦ProRAW拍摄，于福建   iPhone拍摄，于无锡。想象一下如果使用长焦高机位拍摄，画面就会缺少故事感   华为手机拍摄，于上海   vivo手机拍摄，于香港",
            "level": 2,
            "parentId": 23,
            "valid": 0,
            "href": "index_split_025.html"
        },
        {
            "id": 27,
            "title": "04 水平、平行拍摄和俯仰拍摄",
            "number": 4,
            "fullNumber": "10.4",
            "content": "04 水平、平行拍摄和俯仰拍摄 没做好这一点，就是你拍照不好看的主要理由。手机很小，手机主摄往往又是广角镜头，拿来拍人特别容易拍不好看。如果拍摄的时候手机不水平或不平行，那么很容易拍出歪歪扭扭、构图奇怪的图像。 在很多安卓手机设置当中，我们可以打开水平线提示来保证手机处于水平。对水平线已经有较为清晰认识的用户，在拍摄时为了不干扰构图，可以打开构图参考线来进行水平线的检查和对齐。 手机拍照不容易保持水平是由手机本身的外观设计导致的。比如很多手机采用曲面屏或者边框尽可能窄的设计，再比如iPhone的默认预览界面会在画面外用其他镜头的画面拼接以扩展预览的范围。这些设计在无形当中都让我们感觉像握着一块沉浸式的屏幕在进行拍照而失去了对水平线的感知，相比于相机更容易拍出不水平的画面。 人眼在视觉上具有敏锐的本能，观看照片时能够看出画面中的地平线或水平线发生了歪斜，产生了违和感。手机内置的水平仪指示，只能告诉用户在拍摄时，一定的俯视角之内，手机是否水平。在俯视拍摄的时候，由于俯视的角度大，水平仪不会给出提示，这时候我们要通过构图参考线与拍摄对象进行对齐（比如将参考线和建筑的直线对齐），在视觉暗示上营造水平的感觉，消除违和感。当然，在这个时候，为了创作我们可以倾斜画面，比如拍摄人像的时候，人物的头部有俯仰，或者视线和地平线不平行，我们可以选择和人物头部俯仰的角度或者视线保持平行，这样的画面也不太会有违和感。其他时候，如果我们选择倾斜画面水平线，那么视觉的不平衡感就要通过画面元素的多寡分配或者视觉重心的分配来协调，重新让画面在视觉上达到平衡。这样的画面是一种有张力的平衡、对抗的平衡，视觉上有可能更出彩。 我们可以把手机的背壳当作手机的成像平面，这个平面只有和拍摄平面平行，才能保证被摄物不会因透视的作用而变形。如果这两个平面不平行，就会造成被摄物的线条不是横平竖直的，拍摄人物的时候，会让人物显得比实际高大（仰拍）或矮小（俯拍）。手机默认的主摄拍摄角度较广，俯仰拍摄带来的视觉影响会比较大。 当然，利用好俯仰角，我们也可以通过这些透视关系来强调我们想要表达的画面关系。仰拍可以展现人物的高大和伟岸（使用超广角镜头更能体现），俯拍则给人一种居高临下和掌握全局的感觉。   华为手机拍摄，于老挝。保证画面水平和平行，利用手机景深大的特点营造适当的虚实效果",
            "level": 2,
            "parentId": 23,
            "valid": 0,
            "href": "index_split_026.html"
        },
        {
            "id": 28,
            "title": "05 高低机位拍摄和倒把握持",
            "number": 5,
            "fullNumber": "10.5",
            "content": "05 高低机位拍摄和倒把握持 把手机举过头顶，利用高机位拍摄盲拍，或者低机位靠近地面拍摄，很多时候会有意想不到的效果。手机不像某些相机具有翻转屏，把手机举过头顶进行高机位拍摄的时候很难看到画面内容，不是很方便，但是用手机拍摄时的对焦烦恼比相机小得多，所以高机位拍摄的成功率也很高。手机因为镜头很小，方便进行超低机位的拍摄，尤其是倒把握持的方式，可以让镜头非常接近物体表面，拍摄出反射的效果。   倒持手机，让手机尽可能贴近地面   OPPO手机拍摄，于厦门。倒把握持手机获得倒影   华为手机拍摄，于旧金山。将画面上下翻转   华为手机拍摄，于老挝。高机位获得俯瞰视角",
            "level": 2,
            "parentId": 23,
            "valid": 0,
            "href": "index_split_027.html"
        },
        {
            "id": 29,
            "title": "第四章 颜色理论——调色，授人以鱼不如授人以渔",
            "number": 11,
            "fullNumber": "11",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_028.html"
        },
        {
            "id": 30,
            "title": "01 导语",
            "number": 1,
            "fullNumber": "11.1",
            "content": "01 导语 很多调色教程都是从某一个流行的风格或者几张吸引人的封面开始的，提供参数和一些具体的调整方法。这样的教程只适用于和实例很接近的照片。这样的学习或许能让我们调出几张好看的照片，但是在我们形成对颜色的理解上并无太大帮助。要想形成创作风格，最主要的还是依靠创作理念。对颜色的理解也是我们创作风格的一部分。色彩风格则是我们在拍摄构思后期形成的。 但我相信摄影平民化的另一边，也有很多人想要真正深入理解颜色理论并将其运用在自己的作品当中。摄影当中除了内容，调色也是个人风格的重要展现，像是马丁·帕尔、蜷川实花都在其创作中给了人们鲜明的色彩印象。 自从数字摄影兴起以来，人们对于颜色的认知、数字成像的颜色和调色，有一套完整的方法论。本章将深入介绍一些色彩理论和调色思路，来帮大家更好地理解颜色，进而形成属于自己的风格。 另外，关于手机调色和风格化成像的App非常多，本章不做具体App的推荐和使用方法的介绍，但仍会让你了解用App调色时应该有的思路。   vivo手机拍摄，于尼泊尔。无论是面对场景的颜色和光线还是后期调色，我们都要有对颜色的根本认识",
            "level": 2,
            "parentId": 29,
            "valid": 0,
            "href": "index_split_029.html"
        },
        {
            "id": 31,
            "title": "02 关于调色认识的误区，怎么看参数都学不会是为什么",
            "number": 2,
            "fullNumber": "11.2",
            "content": "02 关于调色认识的误区，怎么看参数都学不会是为什么 人们总以为调色等于摄影后期，其实调色只是后期处理的其中一个步骤。 很多用户修图会磨皮，但是磨皮也不是美颜类App的唯一功能。细致的人像修图还需要对皮肤的质感、五官的比例等进行微调。照片的后期处理也包括诸多步骤。完整的照片后期处理大都包括以下几个步骤，每个步骤都会影响最终的照片效果，调色只是其中一步。 为了更好地理解调色，这里需要重点关注一级校色和二级校色的概念。注意这里说的是照片后期处理流程，和手机图像处理流程有一定区别。这些步骤在使用相机的摄影创作当中基本由人们手动完成，在手机里则大多自动完成。 a.基础瑕疵修复：比如镜头光学畸变的矫正，由于四角失光形成的暗角，等等。 b.素材预处理：比如HDR高动态范围合成、全景拼合、降噪，等等。 c.其他瑕疵修复 ：比如去除画面的脏污，抹去画面的杂物，去除镜头光学缺陷带来的图像瑕疵，人物皮肤的初级处理，一些形变相关的初级处理，等等。 d.一级校色：把场景还原为相对准确的颜色。这个概念在影视行业当中非常重要。在影视行业，一段影片的不同片段来自不同的拍摄设备，不同的取景，不同的美术、妆容和灯光。要让这些片段后续在视觉上呈现出统一的效果，必须先还原相对真实的颜色，平衡各个设备和场景之间的差异，才好进行之后风格化的操作。我们想要调一组图，让其呈现出统一的色调倾向，也是相同的道理。在一级校色当中，我们主要是做全局性的调整：照片整体的亮度及曝光，全局的对比度，图像的白平衡，RGB三通道的比例。要注意，在数字成像的描述当中，亮度和颜色往往是分开讨论的。同样是红色，我们的视觉系统觉得亮一点的红色和暗一点的红色是不同的颜色。另外，对于RAW图像和RAW/LOG格式的视频来说，一级校色是必要的，这些图像和视频没有经过机器的初始加工，所以一级校色的所有参数需要用户自定义。而对于手机拍摄的照片来说，这些步骤已经由产品调试的工程师（和艺术家）们做完了。如果不是出现一些偏差，我们往往不需要再进行很多一级校色的工作，反而应该担心把二级校色都已经做完的问题（过度风格化）。另外，我们在后期软件当中添加LUT（颜色查找表）的时候，一般也会根据素材类型，先对素材添加设备相关的一级校色LUT，再在后续流程当中添加风格化的LUT。用过达芬奇、Premiere软件且熟悉视频的小伙伴对这个概念应该比较熟悉了。 e.图像增强：包括去雾、颜色强化、锐化、各种局部的对比度及影调的调整和强化（主要与亮度相关，这里不展开细说）。这一步对相机照片的创作来说已经属于风格化的调整；对于黑白图像来说，这一步定义了照片的大部分风格。 f.二级校色：风格化的调色，指的是我们在某一个色彩空间当中，对色彩进行全局的强化、弱化（比如饱和度、自然饱和度调整），对某些色彩进行映射和偏转，等等。大家熟知且有些被滥用的青橙调色、莫兰迪色等等，大部分都来自这一步。 我们对于图像的感受，对于色调的感觉是直观、快速、具象的，后期常常过分强调二级校色这一步，忽略了上述的其他步骤以及画面的内容。人们对某种色调的认知来自图像处理全流程。比如我现在说莫兰迪色，很多人就想象出宫廷剧的素雅场景；我说青橙调色，大家脑海中就浮现出在海边的阳光下，青色的天，还有人们橙色的皮肤。   vivo手机拍摄，于大理。手机已经帮我解决了大部分问题，我所说的调色往往是二级调色",
            "level": 2,
            "parentId": 29,
            "valid": 1,
            "href": "index_split_030.html"
        },
        {
            "id": 32,
            "title": "03 人眼和图像的数字鸿沟——从CIE 1931色彩模型到我们熟知的调色工具",
            "number": 3,
            "fullNumber": "11.3",
            "content": "03 人眼和图像的数字鸿沟——从CIE 1931色彩模型到我们熟知的调色工具 数字鸿沟（Digital Divide）一般被用来描述由于对信息与网络技术的把握差异，而在不同地区的人们中所造成的信息落差。放到调色上来说，调色之所以晦涩，就是因为机器看待颜色和图像的方式和人眼不同。调色困难，也是因为这道视觉认知的数字鸿沟。 1931年，国际照明委员会（Commission Internationale De L'Eclairage, CIE）为了实现光和颜色在数字时代的标准化，利用数字化手段准确重现人们看到的色彩，创立了CIE 1931色彩模型。   CIE 1931色彩模型 理解色彩模型和色彩空间是我们熟练调色和认知机器视觉当中颜色的第一步。CIE 1931是我们熟知的DCI-P3、sRGB、Adobe RGB等色彩模型的基础：用数字来描绘我们能看到的颜色范围和设备拍摄颜色、显示颜色的能力，用坐标来描述具体值，并且可转换为RGB。 其他的色彩模型（注意色彩空间和色彩模型的区分，色彩空间是在某种色彩模型的基础上限定的一个区域，在很多资料里CIE 1931也被称作色彩空间，本书为了和当中提到的其他概念做区分，将其称作色彩模型），比如HSB、HSV、Lab，以及相机工程当中的YUV、打印中的CYMK等，在定义上和CIE 1931有所不同，但是理念共通。并且很多色彩模型其实就是在CIE 1931的基础上经过线性代数运算获得的。当前，从数字成像到利用软件调整图像，都离不开色彩模型。色彩模型是机器描述色彩和运算色彩的方式，并不是用来描述我们对于色彩的感受的。因此，以下部分尝试把我们对颜色的认知与这些机器的概念挂钩，以便更好地调色。   横坐标代表光线的波长，纵坐标代表人眼的灵敏度。右图为3种锥形细胞对不同波长的光线存在的响应曲线，因为细胞本身的响应特性，我们可以近似理解为这3个刺激值接近RGB的概念。 从知觉上来说，我们的眼睛当中有3种锥形细胞，分别可以对可见光当中的短波长（蓝色）、中波长（绿色）、长波长（红色）做出反应。 仔细看上图的曲线，会发现存在这样的一种情况：两种或者几种不同波长的光能够刺激人眼的细胞到相同的灵敏度。因为存在光线波长和人眼灵敏度多对一的特性，在人们感知色彩时存在同色异谱现象：即我们可以感知到相同的颜色，实际上产生这样的颜色光谱并不相同。通俗来说就是，我们看一支口红和一个苹果感受到相同的红色，但是测出来的红色光谱不同。也因为这个现象的存在，我们可以方便的复现光，在屏幕上展现一块木头的颜色，用屏幕不同的像素混合，刺激人眼让我们觉得看到木头的颜色就好。CIE 1931就在这个过程当中发挥了作用。数字化的描述重现了我们感知到的颜色：3个刺激值，分别去刺激3种锥形细胞，让刺激的结果十分接近我们对某个波长的光的感知。 要注意的是，在这里我们要剔除亮度的影响，之所以CIE 1931是一个平面而不是一个空间，就是因为上图描绘的是去除了亮度影响后的色度（英文为chromaticity，是个很重要的概念），然后把三维色彩空间中的轨迹投影到二维平面上。就好像你把显示器调成不同亮度的时候，CIE 1931图上的每种颜色还是按照相同的RGB值进行显示。至此，我们把人眼的三刺激值翻译成了我们每天在计算机调色板和显示设备上看到的RGB值。在CIE 1931的表色当中，定义自然界中的原色都是三原色光(R、G、B）按照一定比例混合而成，这也是为了方便我们把光谱中的颜色放在一个二维平面之内。总的来说，CIE1931的表色描述的是在某个亮度环境下，为了复现某个波长的光，我们要用何种比例混合释放R、G、B三种信号。 我们可以从上面的内容引导出关于CIE 1931的几个结论。 a.马蹄形外沿的所有颜色（准确地说应该是色度，剔除了亮度）对应着某种波长的光形成的颜色。 b.马蹄形内部的颜色对应的不是光谱上的颜色，但是可以由不同波长的光混合而得。 c.三原色光可以在外沿上找到对应的点，这3个点形成的三角形就是我们熟悉的各种大小的色彩空间：sRGB、DCI-P3等。内部的颜色都可以用三原色光进行混合。但如果要的是三角形以外的颜色，就需要用到三原色光以外的光（说光是因为外周坐标对应着某个波长）去混合。   Photoshop的曲线面板 再让我们看看常用的RGB曲线，是不是就在某个限定的色彩空间（sRGB、AdobeRGB等）的三角形里，对某一些色彩进行偏转。要记住， RGB是色度的概念，所以拖曳某一个点的时候，其实是改变了某一个亮度下的三原色光的某个色度值，来刺激我们的锥形细胞产生相应颜色的感觉。我们单独调整R、G、B的某根曲线的时候，亮度不会改变。 看到这里我知道很多人会说：“摄影师调色师不需要知道这些概念和理论，只要在艺术上感悟好就行，调色是种感觉。”没错，调色的确需要艺术感悟，这十分重要。但调色又不仅仅是依靠艺术上的感悟，就连艺术大师，也是经历了长期的技术磨炼，积累了丰富的经验和深厚的艺术美学素养，这才在调色时能够得心应手。大师们在磨炼之后，他们在艺术上的个性和对艺术前沿的理解又被更多人所熟知，进而又演变成规律化的技术。古往今来，影像技术与影像艺术相辅相成，螺旋上升，所谓技术的顶点也是艺术。   华为手机拍摄于夏威夷",
            "level": 2,
            "parentId": 29,
            "valid": 1,
            "href": "index_split_031.html"
        },
        {
            "id": 33,
            "title": "04 在三维世界中认识和玩转颜色",
            "number": 4,
            "fullNumber": "11.4",
            "content": "04 在三维世界中认识和玩转颜色 因为数字鸿沟的存在，人们一直在寻找准确的色彩模型来直观描述我们感受到的颜色。从色貌模型CIE CAM02（多维度地表述颜色，希望能解决传统色彩模型在实际运用当中与人们感知的矛盾），到我们熟知的HSV、HSB（容易和我们的感受挂钩）、Lab（与工程和传感器上的yuv模型较为挂钩），等等。 设置3个量是因为我们作为三维生物好理解。这里引入一个调色的工具叫3D Lut Creator，这是一个PC端软件，一些摄影师、设计师可能接触过。Photoshop在调色和选色功能上实际上做得比较粗糙，直观好用但不够专业（对应的功能和算法效果我认为也不是最好的）。对于视频来说，达芬奇的调色做得也比Premiere的Lumetri要好不少。 3D Lut Creator可以和Photoshop协同工作，当中最重要的工作色彩模型是HSPe，其类似于HSB和HSV。该软件的创始人，Oleg Sharonov觉得其他色彩模型用起来太低端，所以自己创立了一个。和HSB和HSV相同，该软件把颜色分为色相、饱和度和亮度，但其对亮度的定义有所不同。 HSPe色彩模型把颜色画成一个色相环。色相环的角度代表色相，即Hue。距离圆心的距离为饱和度，即Saturation，离圆心越远的颜色越饱和。亮度用高度表示，即Value越高的地方亮度越高。这样，整个色彩模型就变成了一个圆柱体。   HSPe色彩模型为一个圆柱体 3D Lut Creator当中提供多个面板，每个面板首尾相连形成调色的工作流。这个工作流和使用手机和相机拍照时的成像工作流有非常多的相似之处。这里当然介绍不完每个面板和功能，但是可以介绍一些重要的概念让大家理解调色。 其中A/B面板相当于在这个圆柱体上横向切一刀。我们在这个网格当中拉动颜色，颜色就可以往一个方向映射，点和点可以设置联动关系，那么某一个色系的颜色就会均匀地进行偏转了。   3D Lut Creator当中的A/B 面板 下面看看C/L面板。如果我们在这个圆柱体过横截圆心上纵向切一刀，并且在与此直径垂直的方向再切一刀，就形成两个垂直的纵切面。这就形成了某一色系的亮度面板。啊，想把蓝天调暗一点？那就把蓝色相关的锚点往下拖，是不是直观又方便？   3D Lut Creator当中的C/L 面板 我们从软件当中输出的是一个查找表，这就是Lut或者颜色预设的本义。Lut查找表把某些颜色的数值映射到另一些数值上。从色彩空间上，这样的数值映射扭曲了这张照片的色彩空间，造成一些地方坍缩、空间缩小（比如我们统一调小一类颜色的饱和度），如下图所示或者一些空间消失之后错位到本来空间的其他位置（比如我们把所有蓝绿色调的颜色都映射到红橙色调上）。     华为手机拍摄，于夏威夷",
            "level": 2,
            "parentId": 29,
            "valid": 1,
            "href": "index_split_032.html"
        },
        {
            "id": 34,
            "title": "05 运用视觉效应和审美经验——调色的大概类型",
            "number": 5,
            "fullNumber": "11.5",
            "content": "05 运用视觉效应和审美经验——调色的大概类型 这是一个包含经验主义的环节，不同的人可以总结出不同的调色类型。这里还会介绍一些视觉现象，以及这些视觉现象在调色当中的应用。 简化颜色类 我们熟知的青橙色调或者是通过去掉传感器像素阵列的某一个颜色的像素而实现的technicolor风格，实际上都是在给颜色做减法。简化颜色实际上就是突出重点和风格，特别是照片当中只留下某种色系的时候。   华为手机拍摄，于以色列。场景中的色调简单   一加手机拍摄，于象山。类似青橙色调或者是technicolor风格，我调色从来不使用任何Lut预设（除了一级校色的设备相关Lut）   vivo手机拍摄，于四川。画面只保留黄褐色调 简化颜色的方法有很多种，常用的是弱化某些色系的饱和度以突出另一色系。大家常常在网络上见到的黑金色的城市夜景就是使用了该方法，更确切地说是使用无彩和有彩的对比。一些手机上的拍摄AI功能也可以算这个类型（把人物区域算出来保留颜色，背景变成黑白）。 钠灯是城市夜景中除了霓虹灯和LED灯的主要光源。钠灯大多呈暖黄色，所以如果我们在城市夜景当中凸显这样的暖黄色调，就可以在实现色调的同时展现城市夜景的主要脉络。   华为手机拍摄于上海 强化颜色类 强化颜色即运用一对或者对应的两组补色进行强化。熟悉色相环以后我们知道，色相环直径两端的颜色，一种是另一种的补色。我们的视觉总是会寻找生理平衡点。看看每年的流行色就知道，某种色系的颜色火了几年以后，补色相关的色系肯定也会火。这里要注意的是补色也可以是两组颜色之间的色系互补。在Photoshop的Adobe Color Themes当中，我们可以很直观地安排我们想要调整的颜色。   Adobe Color Themes给创作者提供的颜色参考   华为手机拍摄，于上海。典型的冷暖对比，控制好面积就能让暖色成为点睛之笔   华为手机拍摄，于青海。拍摄时强化了画面当中的暖色调和粉色 冷暖对比是补色理论调色的代表。 另外，强化颜色也不一定要去创造对比，特别是本身就很多彩的环境。我们可以运用强化颜色的手段强化画面当中原本不明显的色彩，比如通过去雾，强化细节对比，提亮，增加饱和度等方式来强化环境当中本来不突出的色彩。 运用视觉效应 亨特效应：我们的眼睛在高亮的环境当中感知到的颜色比在较暗的环境当中感知到的颜色更加明显。因此我们可以把视觉重点要表达的颜色放在高亮的部分，其他的都放在较暗的部分，但颜色不一定要低饱和。   vivo手机拍摄，于法罗群岛 史蒂芬斯效应：人眼在亮环境当中会觉得物体之间的对比度更高。所以我们在强光底下拍摄，会捕捉到一些高对比的场景。   OPPO手机拍摄，于美国加利福尼亚州。在强烈的阳光下形成了高对比的场景",
            "level": 2,
            "parentId": 29,
            "valid": 1,
            "href": "index_split_033.html"
        },
        {
            "id": 35,
            "title": "06 调色的心理学效应",
            "number": 6,
            "fullNumber": "11.6",
            "content": "06 调色的心理学效应 我们之所以感觉调色很复杂，是因为我们对色彩的感知不单单是视觉的生理过程，也受到心理学的影响。我们的年龄、职业、经历等都会对我们对颜色的认知、记忆和喜好产生影响。 例如，餐厅的布置大多数为暖色系，基本不会有蓝色的食物（我也见过但没有食欲）。色彩心理学是一个单独的学科，运用好色彩去引领情感，可以和拍摄的主旨进行呼应。这不光是电影里表达情感的常用手法，也是我们应该在自己的创作和作品当中去考虑的。电影当中，色彩和氛围感更好表现是因为电影成本高，拍摄环境大多数都是可控的。我们可以从仔细地观察自然光，从不同天气下自然光的变化中获得感悟。 这里我提出一个自己认为的颜色心理学效应，暂且称之为颜色锚定效应。我们很多时候不会对一种调色方式，或者一张调色以后的图像产生很强烈的“处理过”的感觉，原因是很多时候调色之后的图像，其某个重要颜色依然保有真实属性。比如青橙色调里的肤色，还是呈现皮肤应有的橙红色。比如很多老电影里的阳光呈现出暖黄色。保留这些锚定颜色，能让我们的调色更加自然。 从摄影创作的角度，只有调色的图像和视频几乎是没什么意义的。内容才是首位的，调色只是锦上添花。   华为手机拍摄，于新疆",
            "level": 2,
            "parentId": 29,
            "valid": 0,
            "href": "index_split_034.html"
        },
        {
            "id": 36,
            "title": "07 我们为什么要深入理解肤色——从技术较成熟的人像摄影技术当中汲取精华",
            "number": 7,
            "fullNumber": "11.7",
            "content": "07 我们为什么要深入理解肤色——从技术较成熟的人像摄影技术当中汲取精华 我们理解人像摄影的相关知识以后，也能更好地理解其他摄影门类。我们在这里深入地探讨肤色，就可以把这个理解放到对其他颜色的理解上。 人像摄影技术发展很快，是因为关于人物的一切都是有规律可循的。比如，五官的比例接近三庭五眼的比例就会好看；皮肤要去掉瑕疵，保证肤色均匀并且保留细节，这就是美肤和磨皮时的目标。 人像摄影技术的发展还离不开我们挑剔的眼睛，视觉系统对于一切和人相关的属性都有着很强的辨别能力。我们可以毫不费力地识别出人脸微表情所传达的情绪，却不能准确地记住两棵不同的树木之间的差异；我们可以一眼看出照片和视频里的肤色是否自然，却对天空呈现的蓝色看不出明显区别。肤色是我们人眼敏感的颜色之一。在专业的图卡上，常常有多个表示肤色的色块。   vivo手机拍摄，于云南。理解肤色可以帮助我们更好地理解颜色的各种概念",
            "level": 2,
            "parentId": 29,
            "valid": 0,
            "href": "index_split_035.html"
        },
        {
            "id": 37,
            "title": "08 肤色为何这么复杂——人种和光源",
            "number": 8,
            "fullNumber": "11.8",
            "content": "08 肤色为何这么复杂——人种和光源 在学术论文当中，我们常常将肤色区分为高加索人肤色（白）、亚洲人肤色（黄）和拉美人肤色（黑），等等。实际中的肤色要复杂得多。下图是化妆品行业对不同肤色的区隔，从这些色块当中我们看出，其实肤色的组成是比较复杂的。除了皮肤本来的颜色，环境光线以及不同的化妆品在皮肤不同区域产生的不同作用，也会使得皮肤的颜色变得特别复杂。另外皮肤会发生很多反射和次表面反射，这些因素综合形成了我们对于肤色的观感。   肤色 抛开亮度的影响，其实无论是哪类人种，自然肤色的色相和饱和度都在一个很小的范围内，我们对这个范围内的颜色十分敏感。在达芬奇软件当中，我们可以打开矢量图（vectorscope）的肤色指示线（skin color indicator）。这个指示线是根据人们对肤色的经验值总结来的。   达芬奇软件当中的矢量图，角度代表色相，落点与圆心的距离代表饱和度。在图中第一象限能看到一条肤色指示线和一些颜色落点 以上是在刨除光源和实际光照环境影响的情况下讨论肤色，实际情况要复杂得多。假设现场有一个很强的单色光源，比如我们在电影中常看到的蓝色和红色光源，这些光落在一个偏白的肤色上会造成很强的反射效果，这时候的肤色远远偏离了自然肤色的范围，但我们并不会觉得不自然。另外光源的质量也对肤色有着很大的影响，好的室内影棚闪光灯和室外的自然光有着连续的光谱，能很好地还原物体本身的颜色，我们称之为光源的显色性高。然而昏黄的路灯和室内的灯光大多是钠灯和质量不太好的LED灯，还原色彩的能力较弱，所以在这些光源下呈现出来的肤色不会很理想。   vivo手机拍摄，于四川。自然光下的肤色的呈现效果往往比人造光源理想   特殊光源条件下的肤色可能和我们的经验总结有很大偏差，但是在视觉上不会觉得奇怪",
            "level": 2,
            "parentId": 29,
            "valid": 0,
            "href": "index_split_036.html"
        },
        {
            "id": 38,
            "title": "09 相机是如何处理肤色的——肤色的“调色味精”",
            "number": 9,
            "fullNumber": "11.9",
            "content": "09 相机是如何处理肤色的——肤色的“调色味精” 在拍摄人像时，相机的肤色调校在很大程度上影响了成片的风格。很少有人横向对比不同相机或者手机之间的肤色差异，实际上各个设备在不同场合的肤色差异非常大。相比于“忠于原味”地记录下所拍摄的肤色，所有厂商都无一例外地对肤色区域的颜色进行了处理。有人用Apple Grapher对佳能EOS 5D Mark II相机的DNG profile（DNG配置文件）进行解析之后，发现相机本身对于肤色的偏转作用：肤色由多种复杂的颜色构成，肤色中偏粉的部分，相机会往红色调整，肤色中偏红的部分相机会往品红调整。佳能相机能拍出更“白”、更“红润”的脸，一部分的秘密就藏于此。 在手机成像当中，后处理模块对于颜色的调整还要复杂得多。比如大家用于调整图像风格的Lut预设，早就被广泛运用于手机图像的处理当中。另外，因为AI的存在，计算摄影分析性别、年龄、肤色类别、肤质、五官等早就不是难事了，所以对于肤色还有很多分类丰富的、细致的调节。   苹果在发布会上展示的计算摄影在人像处理流程上的超高复杂度 使用手机前置摄像头自拍时，由于皮肤占据画面比例较大，手机会运用到局部白平衡技术（Local AUB）。在后期调整当中，我们可以手动调整画面某个区域的白平衡，使得人物区域的肤色更为自然。类似的，学术前沿正对环境当中存在多光源的环境，以及当复杂环境光当中存在我们需要明确辨色的情况，开发这种技术。局部白平衡往往不需要对光源进行估计，而是通过把图像放入各种单光源训练的神经网络之后判断这张图像的受光情况，然后输出各部分准确的颜色。手机前置自拍往往不是考虑肤色的影响之后对白平衡进行风格化的偏移，而是直接对图像进行分割，对肤色区域使用单独的白平衡参数。 除了相机本身的后处理，相机的一些技术指标也在影响着肤色。色彩深度是其中的一个指标，其概念比较容易理解：我们拥有多少颜色预算去描述不同的色彩。在肤色上，相当于你的蜡笔盒子里有多少不同颜色的蜡笔来对肤色进行描述。不同颜色的蜡笔越多，肤色的颜色层次就越细腻。   不同的色彩深度描述的色彩过渡不同，DXO对传感器的测试就包括了色彩深度这一项 但不是说相同的相机拥有相同的色彩深度纸面参数，表现就是相同的。肤色中红色的比例最高，不同传感器对红色系的响应和对于光谱的响应有差异。另外，数码传感器普遍在低感光度下，色彩深度高，在高感光度下，色彩深度低。这就是我们在夜景和昏暗的场景之下，很难拍出和调出理想的肤色的第二个原因（第一个原因是上述提到的光源显色性问题）。还有传感器及感光介质的感光特性不同，这也是为什么有一些摄影师直到现在还喜爱用胶片进行创作。在颜色的输入上，胶片和数字传感器存在差异，这不是通过胶片模拟滤镜可以模仿的。下图是柯达用于人像拍摄的Portra 400胶片的特性曲线，如果我们把图里面的白平衡调整准确，即R,G,B3条线在某点重合，3条线依然不能完全重合，由此体现出这个胶片在肤色和颜色上的特征。胶片对于亮度的响应也和数码传感器存在区别，例如对于画面高光的响应往往不是线性的。   柯达Portra 400胶卷的特性曲线   vivo手机拍摄，于四川。手机的颜色调试对白平衡有很大影响",
            "level": 2,
            "parentId": 29,
            "valid": 1,
            "href": "index_split_037.html"
        },
        {
            "id": 39,
            "title": "10 白平衡对肤色的深刻影响——颜色基准对肤色如此重要",
            "number": 10,
            "fullNumber": "11.10",
            "content": "10 白平衡对肤色的深刻影响——颜色基准对肤色如此重要 上述说的都是颜色的调校，那么白平衡作为颜色的基准是如何深刻地影响肤色的呢？这里要提到的一点就是肤色的多样性。肤色多样性在偏冷的白平衡下更高。我们可以利用3D Lut Creator当中的一些分析工具来帮助我们理解。一个正常的肤色肯定是R>G>B，肤色无论深浅都是偏暖色调的。这就意味着，如果此时的白平衡偏冷，那么与原本肤色的暖色之间在数值上就会被拉开更大的差距，肤色将显得更加多彩。反之，如果照片整体呈现更暖的色调，那么肤色将显得更加统一。 在一些手机上面，比如iPhone，我们可以预设相机的风格，目前开放的是色温和对比度的选项。这里的预设并不是滤镜效果，而是相机将我们的倾向纳入考虑，对自己的图像处理流程和AI算法做出不同情况下结果的偏移。 所以我特别推荐大家通过这个预设找到最适合自己肤色的设置。 白平衡造成的肤色差别在未化妆、肤色本身就比较丰富的人身上比较容易看出来。这里选取了评测网站Dpreview的一张高画质人像样张，可以看到原图中的人物肤色较暖，人物脸上有一些血色。肤色主要是由黑色素、胡萝卜素和血红素决定的，其中黑色素最为关键。黑色素分为真黑素和褐黑素。真黑素使皮肤呈现棕褐色，褐黑素使皮肤呈现红色。下页的图例中，模特的脸棕褐色和红色相间，但由于直射在人物脸上的阳光偏暖，在相机较暖的白平衡表现下，人物的肤色呈现比较均匀。我们在人物的脸上设置3个取色点，如下页图例中“分析器”窗口的左下方显示的3种肤色所示，这3个取色点的肤色目前较为接近。   调动图像的白平衡之后，我们可以发现肤色看起来更加多彩了，红润和白皙部分之间的差距被拉得更开。从取样点的RGB值也可以看出，一些颜色之间的差值变得更大了。因此，如果要突出体现靓丽的肤色或多彩的彩妆，就要用一个偏冷的白平衡设置。",
            "level": 2,
            "parentId": 29,
            "valid": 0,
            "href": "index_split_038.html"
        },
        {
            "id": 40,
            "title": "11 亮度对肤色的深刻影响——影调如何塑造肤色",
            "number": 11,
            "fullNumber": "11.11",
            "content": "11 亮度对肤色的深刻影响——影调如何塑造肤色 接下来，我们要把肤色和亮度结合在一起考虑。假设一道侧光照着人物，那么人物面部会产生自然的阴影，肤色也会分为高亮、中亮和低亮区。 高亮区的肤色反射最强，而且往往是妆容造成的，一般与环境光线的颜色有呼应，在观感上的主要作用是勾勒人面部的轮廓和描述妆容。高亮区的肤色亮度如果够亮，就会给人以肤色通透、神采焕发的感觉。但是高亮区不宜过多，尤其是拍摄面部特写的时候，否则会让人觉得这部分的肤色信息缺失了，给人一种画质不好的观感。 中亮区的肤色和环境光线的颜色呼应得最多，与环境主要的颜色接近的时候，才不会在场景当中有违和感。电影中的人物也常常是这种情况，在完全可控的环境光线之中，就算和我们理想中的肤色有偏差，但我们会自然而然地觉得这是图像调色的一部分。 低亮区的肤色必须更加准确地反映肤色和血色，我一般称这些颜色为记忆锚定颜色。这些区域的颜色必须符合我们记忆当中对肤色的印象。低亮区的肤色如果不准确，很容易让人产生肤色偏色的感觉。   华为手机拍摄，不同亮度的肤色有着其不同的视觉意义",
            "level": 2,
            "parentId": 29,
            "valid": 0,
            "href": "index_split_039.html"
        },
        {
            "id": 41,
            "title": "12 后期处理当中调整肤色的基础——通过图像的傅里叶变换进行分频",
            "number": 12,
            "fullNumber": "11.12",
            "content": "12 后期处理当中调整肤色的基础——通过图像的傅里叶变换进行分频 当我们要把图像的平坦区和细节部分分开处理的时候，常常会用到分频的方式。分频处理也是大多数美颜算法、磨皮插件的基础算法步骤。用通俗的话来讲，我们对图像进行频域上的处理的时候，相当于在不同的维度用不同的逻辑思考方式去看待图像。这个方式就是用不同特征的正弦波对图像进行转换和解析，也就是傅里叶变换。 在Photoshop中，我们如何对一张图像进行分频处理呢？在这里，我们的目标是区分出图像当中的低频部分来使肤色更加均匀，而不影响那些高频的毛孔细节一类的东西。 复制两个图层，我们对上一个图层进行高斯模糊操作，选择“滤镜”—“模糊”—“高斯模糊”，把数值放在4左右（针对这张图）。这样我们就得到了这张图的低频部分（不是频域解析，只是从结果来说）。在这个图层上我们可以通过使用修补工具及局部的对比度和细节强度的调整，来使肤色更加均匀。   在Photoshop中通过高斯模糊获得的低频图像 然后把下一层图层挪到上面，选择“图像”—“应用图像”—“选择减去”，减去刚才我们模糊过的图层。然后在缩放和补偿值文本框中分别写上2和128。按照下图进行设置，我们就得到图像的高频细节层。在这个图层上我们可以针对细节纹理进行增强等操作。   在Photoshop中分离高频细节 调整完以后把高频图层的图层混合模式改为线性光，合并高低频图层使得图像恢复颜色和细节。此时，我们已经分别从高低频对图像进行了精细的处理。对于这两个图层的操作足够精细的话，可以调整出更有质感、更具有风格化的肤质和肤色。这是那些默认数值或者所谓AI分析达不到的，这些调整也体现了拍摄者对于图像和摄影的认识。",
            "level": 2,
            "parentId": 29,
            "valid": 0,
            "href": "index_split_040.html"
        },
        {
            "id": 42,
            "title": "13 高饱和度的图像很低端吗——理解饱和度",
            "number": 13,
            "fullNumber": "11.13",
            "content": "13 高饱和度的图像很低端吗——理解饱和度 饱和度不是高了就一定好，或低了就一定好。例如，阴天的迷雾中，拍摄对象穿一身红衣服可能是画面的点睛之笔；但如果拍摄环境是五彩斑斓的小镇，艳阳天时穿一身红衣可能就会显得俗气。 饱和度虽然用来描述图像鲜艳的程度，却是个独立于亮度的绝对量。饱和度作为HSB（色相、饱和度、亮度）或者HSV（色相、饱和度、视觉亮度）色彩模型的计量的时候，值是单独的，但是讨论观感的时候饱和度必须与其他两个维度挂钩。   图片来自孟塞尔颜色 直接看定义可能有点抽象，我们结合图例来分析。仔细看看下方左上图中第一排的红色色块（R1、R2、R3），横向比较这三个色块，我们会感觉R3是R1-R3里面最鲜艳的，但其实R1-R3的饱和度是一样的。这是因为根据HSB色彩模型里饱和度的计算方式，R1-R3的R、G、B的比例是相同的，R1-R3的饱和度都是100。同理，P1-P3的饱和度都是50。饱和度不等于我们感知的鲜艳程度。 纵向比较，在同一亮度下，R1、P1、W1当中，我们明显会感觉R1是最鲜艳的。因此，在同一亮度的情况下，饱和度等于我们感知的鲜艳程度。 看完下面的图例你会明白：高饱和度并不总是给你很鲜艳的感觉，尤其是低亮度高饱和度的情况。所以我们可以用这种方法去营造特定的色彩氛围，比如所谓的冷淡风调色。   图片来自孟塞尔颜色 饱和度这个量充满了迷惑性，所以我们要尝试在别的语境之下去探寻对颜色鲜艳程度的感知。因此，在色彩空间当中，像HSV、HSB这样的色彩模型大多也是为了计算方便和描述简单，对于我们调整图像、修改设计其实并不友好。 现在，我们把刚才看到的那几个色块放到新的语境下重新审视。在下图图例的左上角，每一列色块被放到了他们所对应的平均亮度的环境当中。不论是颜色还是亮度，其实我们的视觉系统感受更深的是他们的“相对关系”。纵列来看，W1-W3都是各自“亮度环境”当中最亮眼的，因为我们感知这3个色块传播和反射光的能力最强，所以感觉它们是最亮的，同时也是最不鲜艳的。这个不鲜艳指的是颜色不够正，即传播和反射某种颜色的光的能力比较差。   图片来自孟塞尔颜色 还是这几个色块，同样是讨论明度、色度和鲜艳程度，但这次我们把所有色块放到同一个亮度环境底下检视。这次你会发现P3和R2的鲜艳程度是差不多的，只是一个（P3）明度高一点，一个（R2）明度低一点，而且会感觉第一排色块与第二排色块相比不那么鲜艳了（相比于135页的左上图，亮度环境改变，同一排色度从相同变成了不同）。颜色最正的R3在9个色块里面仍然是一枝独秀，是我们感觉最鲜艳的。 看到这里你能否悟出一些道理了呢？ 高饱和、鲜艳的颜色，其实往往是那些很正、很亮的颜色。 你可以想象一下阳光下的红丝巾。 这种鲜艳程度的比较往往是在一个环境当中进行的，这里我们主要考虑环境的亮度（图例当中的灰色或渐变背景）。鲜艳的、突出的颜色，是那些在暗环境里又正又亮的颜色。一个很鲜艳的颜色如果放在暗环境里，也不会显得那么鲜艳了。 你想象一下将红丝巾放在灯光较暗的舞台上，或者放在包里。 现在我们明白了如何感知和量化鲜艳程度，那么大众究竟喜欢多鲜艳的颜色呢？ 在视觉倾向上，一些认知研究的机构和图像科学技术的机构做过这样的研究：研究用户的喜好及用户是否会觉得这样的图像真实自然。要特别注意，所有研究都提到喜好和真实自然是两个方向，所以永远别用真实与否去评价一张图像是否好看。饱和度就像图像的“味精”，加一点会让人觉得好看，但是加多了就会让人觉得图像有问题了。因此，越来越多的标准也会把一些色卡或者是主观环境的饱和度纳入图像质量评估体系。 在建筑上也有人做过类似的研究：对于不同高度和饱和度的建筑，人们的喜好程度如何。结果发现，人们会更喜欢高亮中饱和和低亮高饱和的建筑的外观。 综上所述，在有比较的环境当中，总体来说我们觉得饱和度适中的东西更加自然。当明度适中或者较高时，人们会喜欢更鲜艳一些的图像，但同时也承认这样的图像看起来会比较不自然。但是当明度较低时，我们对鲜艳程度的感知会变得迟钝，这种喜欢较暗环境中的鲜艳物体的趋势会变弱。 上面这个结论揭露了如何运用饱和度让图像好看或者是凸显个人摄影和设计风格。这些结论要结合以下内容才能让我们真正有所体会。 1.低亮高饱和一点都不低端，大部分人还很喜欢。 2.过高或过低饱和度的图像既不自然也不受大家喜欢，但这仅仅是从取悦眼球的角度看。图像作为信息量的载体，肯定还是要将内容放在首位，过高或过低的饱和度会产生很强烈的视觉风格，比如黑白照，以及那些T台上时装的高亮鲜艳撞色。 图像肯定要综合来看，接下来从摄影和调色的角度看看我们应怎么运用饱和度。   iPhone拍摄于新疆 a.低亮高饱和 对于这类图像，我们的视觉第一关注点都会放在图像最亮、最鲜艳的部分，其他部分因为亮度低，所以我们会迟一些关注，但是图像因此有了层次感。要注意的是，画面的整体颜色要尽可能统一，在低亮的部分不要滥用太多太杂的颜色。   华为手机拍摄，于加利福尼亚州。整体的饱和度较高，但是因为亮度低，所以没有刺眼的观感   华为手机拍摄，于上海 b.高亮高饱和 其实大部分在艳阳天拍出来的图像都属于这个范畴。我们可以通过增加画面中的光影和暗调来去除高亮高饱和的杂乱感觉，或者用统一的办法简化色调。   OPPO手机拍摄，于厦门。夜景经过HDR处理之后，亮度比目视时要高，同时整体饱和度也高   一加手机拍摄，于青海。在阳光晴好的自然光下，适合拍摄高亮高饱和风格的图像   iPhone拍摄，于秘鲁。清晨的山丘 c.整体低饱和 整体低饱和的风格有助于统一场景整体的颜色。   iPhone拍摄，于巴西。整体低饱和",
            "level": 2,
            "parentId": 29,
            "valid": 1,
            "href": "index_split_041.html"
        },
        {
            "id": 43,
            "title": "第五章 拍出最高的画质——拍好之前，一定先拍到",
            "number": 12,
            "fullNumber": "12",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_042.html"
        },
        {
            "id": 44,
            "title": "01 认识镜头的光学缺陷然后尽量避免",
            "number": 1,
            "fullNumber": "12.1",
            "content": "01 认识镜头的光学缺陷然后尽量避免 在手机拍照技术里面，算法发展迅速，传感器技术也日新月异，图像处理水平随着平台的升级也稳步提升。 手机拍照所有环节里最不济的就是镜头了。镜头基本是传统光学和材料科学的产物，这部分技术在手机拍照流行以后进步缓慢。因此，很多镜头导致的画质缺陷都需要在成像的其他环节弥补。 手机镜头一般由孔径光阑（一般是最外层镜片）、镜片组和红外截止滤镜3个部分构成。镜头设计的时候要考虑镜头的分辨率还有色差、场曲、畸变、鬼影等技术指标，我们常常听到的手机镜头是7P的就代表其镜片组有7层镜片。 光学设计和手机的整体方案一样，都是一个取舍的过程。比如iPhone面对夜晚的强光源时会出现“鬼影”，你可以看到路灯和广告牌等一模一样的残影出现在手机画面当中。虽然在拍照之后通过AI的计算会消除一部分“鬼影”，但是去除的效果并不理想。iPhone虽然有这个缺陷，但是在白天面对阳光直射的时候眩光比较小，不太容易出现其他手机容易出现的红色花瓣“鬼影”，同时在照片的P3色域对红色的还原也比较到位。这就是iPhone在进行光学设计时的取舍。我们在面对非常讨厌的“鬼影”问题的时候，除了调整拍照角度以避开这样的光源，暂时没有别的方法。 另外，虽然对镜头好坏的评价已经有了相对完善的体系，比如像差就细分为球差（近光轴的明锐的光点变得模糊）、彗差（远离光轴的光线变成有彗星一般的拖尾）、像散（光线变成分离且相互垂直的短线）、场曲（垂直于光轴的成像面变成弯曲的面）、畸变（成像面有了枕形和桶形的形状偏差）等等。这些手机镜头的光学缺陷是我们拍出的照片清晰度不高、色彩不准确的一部分原因。一样的问题在相机镜头中同样存在，不同的是手机已经通过计算摄影的方式对这些缺陷进行了弥补。 那么我们能做的是什么呢？我们能做的就是用手当手机镜头的遮光罩，挡住从侧面入射的强光。画面外摄入的强光，比如太阳光，会让手机拍摄出来的画面出现雾化、对比度下降等问题。把手半握放在镜头前挡住这些光线，可以让手机在侧逆光拍摄的条件下拍摄效果更好。   iPhone拍摄，于新疆。用手遮挡了侧面强烈的入射阳光",
            "level": 2,
            "parentId": 43,
            "valid": 0,
            "href": "index_split_043.html"
        },
        {
            "id": 45,
            "title": "02 高像素模式——附加功能还是真有其效",
            "number": 2,
            "fullNumber": "12.2",
            "content": "02 高像素模式——附加功能还是真有其效 手机往往会提供高像素模式，有些手机则称之为高清或超高清模式。一般手机拍摄的照片的最终像素，不等于厂商宣传的像素。要使其相等，一般需要打开高像素模式，这个模式一般放在相机的设置菜单或者是相机应用的“更多”选项里。 我们应该在什么时候使用它呢？在聊这个话题之前，我们先谈谈手机在设计之初是如何选择合适的传感器的。 抛开其结构和功能形态，手机摄影传感器的发展有两条发展路线——更大的尺寸和更高的像素。在传统相机行业里，尺寸和像素这两个因素螺旋上升，尺寸上从一英寸到M43画幅，再到APS-C画幅、全画幅和中画幅，升级尺寸之后大家就会想办法升级同样面积传感器的像素数量。 像素不变时，传感器尺寸增加，可以让单个像素的面积更大，从而使得进光量更大。这也有助于提升其满阱电荷容量（full well capacity，像素饱和时容纳的电荷数），在不靠算法的情况下提升其基础的动态范围表现。在当今以背照式CMOS传感器为主流结构的时代，传感器的尺寸对画质的影响比像素更加重要。这也是为什么传感器大得多的数码相机，其画质能比手机好很多，当然，这里不考虑算法对手机摄影的加成。 但是大尺寸的传感器会带来手机设计上的一系列困难：手机背部空间有限，更大的传感器意味着更厚的手机外形、更大的镜头和更复杂的镜头光学结构（为了保证大底的边缘画质）。所以手机的传感器很难达到一英寸以上，要不然手机会变得像能打电话的相机。盲目追求传感器尺寸很容易让手机陷入窘境。另外，大尺寸的传感器还带来了更浅的景深，让画面有虚化效果，但这样不利于近距离和微距拍摄。能轻易地拍出从前景到背景都清晰的照片一直是手机摄影的一大优势，很多人也会近距离翻拍文件，而大尺寸的传感器对这两件事都是反效果的。这就是很多用户在升级了手机以后抱怨的问题：手机拍文件或者近距离拍摄的能力变差了，具有记录性质的照片反而更难拍摄了。 传感器尺寸不变时，若增加像素数量，可以使得画面的解析力和分辨率提升，但是其边际效益递减。有一段时间人们追求一亿像素的传感器，但是同系列手机在之后的几代可能退回5000万像素，就是因为额外的5000万像素并不能带来较多的画质提升。高像素的设计使得单个像素面积特别小，因此进光量少，造成弱光、画质差，满阱电荷容量低造成传感器基础动态范围小。并且，过高的像素还会大量占领手机有限的运算资源，对于手机使用多帧合成不友好。而且，相机解析力的提升不单单源于像素的提升，镜头也要拥有与传感器能力匹配的高光学分辨率。相比于传感器的不断更新换代，依靠材料科学和光学技术提升解析力的镜头显然在进步幅度上有些跟不上。 但是，高像素也有好处。手机超分辨率算法、去马赛克算法、去噪算法在AI的帮助下大步前进，像素数量决定了这些算法能达到的效果上限。算力问题被解决的时候，1200万像素的图像和4000万像素的图像在画质上会有本质差异。 另外，硬件工程师们也在想办法兼并高像素传感器和大尺寸传感器的优势。所以四拜耳阵列传感器应运而生。该传感器在常规情况下可以将相邻像素（同色）四合一，以更好地适应手机以高进光量、高动态、低像素进行运算的需求。在光线良好的时候，该传感器也可以将四合一像素拆分成单个像素进行拍摄，通过Remosaic算法，把四拜耳阵列拍摄的图像还原成标准的拜耳阵列，从而输出高像素、高解析力的图像。 相信从上面的描述你已经可以体会到，手机拍照提供的高像素模式基本只适合在强烈的户外光条件下使用。如果一个拍照模式或者一种拍照算法很成熟，那么手机会将其设置成自动切换的方式。显然高像素模式目前还只是一个附加的功能，对于光线的要求比较高。 除了通过调整传感器的输出选项实现高像素，一些厂商还配合AI超分辨率算法等形式增加清晰度。在华为的一些机型当中，高像素模式有50MP AI选项，使用该选项时拍照的运算时间会大幅增加。总的来说，高像素模式适合在静态的、明亮的场景当中使用，用来拍摄静态风景、静物、建筑会有良好的细节表现。   一加手机高像素模式拍摄，于甘肃。景深大、清晰度高，让岩石的细节得以清晰呈现   vivo手机超高清模式拍摄，于西藏。石头的纹理得以清晰呈现，场景中不存在运动画面，所以可以选用这个模式",
            "level": 2,
            "parentId": 43,
            "valid": 1,
            "href": "index_split_044.html"
        },
        {
            "id": 46,
            "title": "03 噪点——手机噪点的来源及如何保证高画质拍摄",
            "number": 3,
            "fullNumber": "12.3",
            "content": "03 噪点——手机噪点的来源及如何保证高画质拍摄 获得噪点更低、更纯净的图像一直是所有影像产品和创作者追求的方向。有些人认为画面的噪点是画面风格的一部分，有噪点的画面会有一种复古感，或者可以使画面的颜色过渡得更加均匀，这些说法都没错。但要知道的是，我们在画面当中加入噪点很简单，但是去除噪点、还原清晰的图像却很困难。所以在拍摄时，我们应该着眼于如何拍出低噪点的图像。   华为手机拍摄，于日本。夜景图像更容易受到噪点的影响 手机噪点的来源有很多种，从最终的图像上看，我们无法区分其来源，但是我们可以从原理上分析。理解噪点的来源不仅方便我们在后期使用不同的降噪方法去除噪点，判断设备的拍摄能力，还方便我们判断当下的拍摄是否选对了拍摄模式（比如当前的弱光场景是用超级夜景模式拍摄好还是使用普通拍照模式好）。 噪点可以分为彩噪和亮度噪点，这是根据噪点带给人的直观视觉感受进行分类的，虽然容易理解，但不方便我们从计算摄影的角度理解噪点。 在图像的采集阶段，由于光本身的属性，光子抵达传感器特定的像素是一个符合泊松分布的随机事件，这个过程会产生散粒噪点（shot noise），这是光的固有特性。在环境比较明亮的时候，相机拍摄的感光度低，散粒噪点是噪点的主要来源。 因此在较明亮的环境下拍照时我们不用太担心噪点，但是要明白这些噪点会影响画面可用的动态范围，进而限制我们后期调整图像的幅度。也就是说，把在这些环境下拍摄的图像拿去做后期编辑，大幅度提亮暗部后，噪点会变得更加明显，让你觉得图像的暗处不够纯净，画质不好。 另外一类噪点和图像传感器本身的关系比较大。有些发生在图像采集时和采集前，比如传感器的电压水平产生波动（像素重置，信号增强）或者长曝光时的暗电流。有些发生在图像采集之后，比如其他电子元器件的干扰，数字和模拟信号转化的过程，或者因为手机的感光度设置需要放大这些信号等。这些噪点统一被称为读取噪点（read noise）。它们的出现有些和时间相关，在统计上呈高斯分布，因此在手机内部可以通过多帧图像被平均化处理掉（比如热噪点）。相比于天文摄影和传统摄影在后期解决这些噪点，手机计算摄影里的大部分噪点在拍摄时已经被消除得差不多了。有些噪点对应着特定数学模型，所以厂商在调试的时候会进行针对性处理。有些噪点和特定传感器的一些读取特性相联系，所以噪点呈现一些条纹状的固定形态。 对于读取噪点，那些需要花费更多时间的拍照模式会将其去除得更加干净。使用夜景模式拍的照片相比普通模式拍的照片，其噪点水平往往更低。另外，相较于相机，手机噪点的复杂性更强。相比于处理相机拍摄的图像，一些计算机软件对手机拍摄的图像进行降噪的效果往往不佳。但对于专业模式拍摄的单帧图像（RAW图像、DNG图像），计算机软件还是能取得不错的降噪效果。这不包括谷歌的Pixel系列或者Apple ProRAW图像，他们虽然被称为RAW，但也经过了一定的多帧运算和降噪了。之后越来越多的手机会开放经过了一定运算处理的RAW格式图像，在噪点的消除和细节保留的权衡上可以给拍摄者更多的参考空间。   iPhone拍摄，于福建。使用Apple ProRAW格式",
            "level": 2,
            "parentId": 43,
            "valid": 1,
            "href": "index_split_045.html"
        },
        {
            "id": 47,
            "title": "04 引导手机调用合适的镜头拍摄最佳画质",
            "number": 4,
            "fullNumber": "12.4",
            "content": "04 引导手机调用合适的镜头拍摄最佳画质 前面说到手机变焦通过光学变焦和数码变焦结合的方式进行，也说到手机会自动判断情况并调用合适的算法介入，接下来将一个常用的拍摄技巧介绍给大家。 不知道你有没有发现，手机切换成长焦的时候，如果光线不是很强，拍摄效果会很差。这是因为此时手机通过拍摄距离、光线强度和抖动的情况等条件进行判定，这时使用主摄拍下一张大幅度裁切照片的效果会比使用长焦镜头拍摄的效果要好。 大家可以尝试引导手机在弱光环境下仍然使用长焦镜头，然后稳持手机拍摄想拍的场景，以获得更好的画质。   华为手机拍摄。尽量引导手机在夜景当中使用长焦镜头 打开手机的相机应用，将镜头对准一个光线比较充足的地方，比如广告牌、路灯等，然后切换长焦镜头，让相机认为光线条件符合切换的条件，再对准我们要拍摄的物体进行拍摄。 能这么做是因为手机的大部分算法和模式都遵循易进难出的原则：用效果优秀的算法尽可能多的涵盖我们拍摄的场景，谨慎地判断进入条件，但是进入以后尽量维持场景，以免造成拍摄不稳定。   iPhone长焦夜景模式拍摄。尽量引导手机在夜景当中使用长焦镜头",
            "level": 2,
            "parentId": 43,
            "valid": 0,
            "href": "index_split_046.html"
        },
        {
            "id": 48,
            "title": "05 AI如何具有思考能力：神经网络和卷积",
            "number": 5,
            "fullNumber": "12.5",
            "content": "05 AI如何具有思考能力：神经网络和卷积 1997年，IBM发明的“深蓝”计算机战胜了连续12年获得国际象棋冠军的卡斯帕罗夫，AI开始被关注。 图像当中的所有问题都可以被数学化，我们把图像的问题分成多个维度：清晰度、颜色、亮度和对比度等。再把这些维度细化，比如清晰度的问题细化成图像的去马赛克、降噪、超分辨率计算。这些细分领域就变成了现在AI计算摄影的一个研究方向。 下面我们通过例子来说明AI在图像当中发挥的作用。 就拿图像降噪来说，我们把降噪之后的一个像素的值写成y，降噪之前的一个像素的值写成x。那么现在就可以用一个数学函数来描述降噪问题：即x经过某种运算之后变成y。为了简化这个问题，我们假设有一个神奇的参数w,w乘以x之后就能降噪。AI就是通过很多的现实例子进行学习：比如搜集原始图像里对应的每个像素值xn和降噪后的图像里面对应的每个像素值yn，把这些作为“证据”；然后通过各种各样的算法寻找最优解，从而找到这个神奇的参数w。 比如AI算法里梯度下降的方法，在运算的时候会通过最小化损失函数来不断接近参数w的最优解。这样对于一个新图像，也能带入这个算法得到降噪后的像素值。这么一来，一个降噪算法就诞生了。 但这个算法目前还是通过较为传统的数学方式来获得的。找到神奇的参数w需要不断地进行大量计算，这符合计算机善于重复计算的特性，但是这个算法还和AI没有太大的关系。 所以现在，我们让刚才的降噪算法变得更接近实际情况一些，并且让这个算法拥有神经网络一般的思考能力。 我们先改改假设，一个像素点降噪以后的值，不光取决于像素点本身，还取决于这个像素点邻近的像素值。所以为了得到这个y，我们的数据输入变成了x1-xn总共n个输入。因此也要寻找对应的n个神奇参数w1-wn，在计算的时候我们会获得n个x像素值和神奇参数w的乘积，将它们求和以后获得z。这个z有什么用呢？这个z要带入激活函数f（z）进行运算。当运算的结果小于某个值的时候，算法认为这个输入的像素值根本不是噪点，不需要向下游输出y值。运算的结果大于某个值的时候，整个运算被激活，算出降噪后的像素值y，或者是作为中间参数继续向下游运算。   人工智能的简化“神经元”模型 上面这个数学结构具有多输入单输出的特性。以降噪算法为例，每一个相邻像素点都是一个影响降噪算法的因素（xi），优化了每一个因素对应的参数（wi），将因素综合考虑以后求和变成参数z；然后把z放入激活函数f（z）来决定是否要向下游继续运算；最后得到降噪之后的像素结果值y。这个过程特别像生物学当中人类神经元的活动过程：树突接受多个输入通过轴突，向突触反馈结果。很多这样的神经元连接在一起，就变成了神经网络。我们拿数据训练的目的就是得到上述降噪示例当中的wn，这样下一次新的图像输入的时候，我们就可以通过这个训练好的模型来获得理想的降噪效果。 大家还常常听到图像领域中的卷积神经网络这个词，那么卷积是什么意思呢？人脑对一个图像做出的反应，实际上是眼睛收到的信息在大脑的不同位置进行层层反应之后得出的。比如我们看到了一辆车，可能大脑先反应和提炼出这辆车的边缘，然后概括出车的轮廓，然后看出车前进的方向，最后才在脑子里明确这是一辆车。卷积神经网络就是模拟视觉拆解和简化的过程，通过数学的方法提炼出图像的轮廓、边缘、颜色、主体位置等信息。   卷积及其运算 比如我们要对一张超高分辨率的图像进行降噪，先要概括出这张图像是白天还是晚上拍的，好采取不同的策略。要做这件事不用对超高分辨率的图像进行运算，那样费时费力，只要有一张特征图看个大概就好了。所以我们设计一个3×3的卷积核（如上页图所示），用这个卷积核套住图像的9个像素，然后在对应的位置相乘，再把所有位置的结果相加，最后获得一个值作为小图像的数值（图右边的0）。每做完一次就移动一次卷积核，对每一个像素进行运算。这么一来我们就对图像进行了卷积，得到了特征图。这个卷积核的参数可以通过机器学习的方式自动寻找。 为了进一步减小数据量，我们可以对特征图进行池化。比如上页图的5×5矩阵，每9个参数里取一个最大值作为代表，这样提取以后虽然画面变成了一个抽象的我们不能理解的图，但是对于神经网络来说这样既保留了这张图像最紧要的部分（比如算法通过池化减小数据量后快速知道了图像是白天拍的还是黑夜里拍的），又能大大减少运算量。 经过多次卷积和池化之后，我们可以找到这张图像的很多特征，比如晚上拍的，彩噪很多，画面暗的地方很多。然后针对这些条件选取一种降噪方法来获得最好的降噪效果。 刚才所说的都是算法最基本的概念，对于AI来说，大量优质的学习数据以及设备所具有的算力也是很重要的。就拿降噪来说，行业当中有很多公开的数据集可用于算法的学习，或者用于对自己设计的降噪算法的能力进行验证。在算力方面，目前手机在AI计算方面的能力比一些相机强很多，有专门针对AI计算需要所设计的芯片，比如NPU。在计算机上，则是显卡的GPU更适合AI方面的运算。   华为手机拍摄，于新疆。人像，夜景，动态，这些复杂的因素如果没有A I加成，无法想象仅仅依靠手机本身的器件实力如何拍出如此画质的照片",
            "level": 2,
            "parentId": 43,
            "valid": 1,
            "href": "index_split_047.html"
        },
        {
            "id": 49,
            "title": "06 超分辨率和超高清——软件算法跨越硬件限制的实例，过度锐化的成因",
            "number": 6,
            "fullNumber": "12.6",
            "content": "06 超分辨率和超高清——软件算法跨越硬件限制的实例，过度锐化的成因 简单来说，机器学习的出现让算法做了一些它从没学过的事情。想想小朋友学会了九九乘法表，了解了乘法的道理以后，就可以算出九九乘法表以外的题目，这就是举一反三。机器学习不光会举一反三，还掌握了数学的基本法则，因此可以开始考虑一些乘法以外的更高阶的数学问题，比如乘方、阶乘、矩阵。 “超分辨率”是很多厂商喜欢使用的营销名词，我们熟知的苹果Deep Fusion，安卓阵营的高清、高画质宣传等，以及老照片修复技术、拍摄的文字增强技术等，背后都是超分辨率算法在发挥作用。这里我们用Adobe公司的一个公开示例来说说超分辨率。 Adobe使用了一种增加分辨率（上采样）的算法。深度卷积神经网络会根据临近的输入像素来推导需要输出的新像素。 根据临近像素生成新像素的算法并不是什么新鲜事，比如我们在Photoshop当中增加图像大小的时候，依靠双三次插值（bicubic interpolation）等方法，利用较为固定的运算法则来生成新像素。 传统的AI算法都会用低分辨率图像和高分辨率图像配对来进行训练，这样下次算法看见了低分辨率图像就会自动生成对应的高分辨率图像。但是Adobe的AI算法在训练的时候不光通过配对图像来训练，还增加了没有去马赛克的各个颜色通道的RAW图像，与低分辨率图像来一起训练。   左上：未去马赛克的图像；中上：单通道图像；右上：低分辨率图像；下排：高分辨率图像 通过这样的方法，一张42MP的图像变成了一张170MP的图像，同时在细节表现方面也有很大的提升。   超分辨率算法（左）与传统算法（右） 这些超分辨率算法虽然听起来很理想，但也有难以避免的问题：超高分辨率的数据集比较难获得，且对于原本分辨率已经比较高的输入图像来说，很难再有明显的效果提升。谷歌的超分辨率技术通过分散模型逐步在清晰的原图像当中增添随机噪点，直到图像只剩下噪点，再让网络反向学习这个过程：逐步处理一张纯噪点图像，在过程当中利用低分辨率的图像作为去噪指导，直到该图像变成一张无噪点的清晰图像（SR3方法，即基于扩散模型，通过重复细化实现超分辨率的方法）。这种方法超过了这几年流行的生成对抗式网络(generative adversarial networks, GAN)的方法，生成对抗式网络的方法常常因为训练集的不稳定而出现模式崩溃问题（模型产生的结果无意义或只生成某个风格的结果等）。 我们可以看到一些手机拍摄的图像存在局部清晰度的差异和超分辨率算法。有时我们会发现人脸、文字这些区域的清晰度很高，但是其他区域比较模糊，这种清晰度的差异有可能是超分辨率算法导致的。 在营销上，超高清拍照概念是几个图像处理领域的集合，不单单是超分辨率。 其一是如何去除图像去马赛克过程中的细节损失。我们利用时间上的图像序列换取空间分辨率（像素位移的概念，利用拍摄时手的抖动或OIS组件精确的抖动做到）就可以做到，像素位移这个概念时常被称作“抖像素”或者相机当中的“超高清模式”。 其二是图像修复领域。不改变图像的分辨率，但图像却从相对模糊变得相对清晰，我们可以翻拍家里冲印出来的老照片，通过算法处理之后的人脸会更加清晰。这主要是利用最大似然估计（max likelihood estimation，已经知道结果的情况下去估计参数）一类的方法进行图像清晰化处理，多用于文字、人脸、固定纹理比如纺织物等。简单来说，这些模型在构造之时得知了高分辨率清晰图像和低分辨率不清晰图像的配对，即“标准答案”。然后根据拍出的实际图像（相对模糊），在模型中拟合一组参数去生成最有可能的高清图像。这是一种推测出高清细节的方法，有可能不准确。 其三是配合锐化、插值等图像处理步骤，从低分辨率图像生成高分辨率图像。早期的“高清拍照”多是这个概念，虽然文件体积增大，参数上看起来图像的分辨率提高了，但人们能感知的细节量并没有变得更多。因为锐化相关的模块简单，在基础图像调试的时候一般已经被最优化。 很多人抱怨目前的手机存在过度锐化的问题，这其实是上述的超分辨率、超高清相关功能的综合作用，加上图像在细节对比度和颜色等方面调试出来的综合效果。我们没有办法在手机当中设置这些选项，但可以在后期软件当中通过调整清晰度、锐度等相关选项进行反向处理，让图像的细节看起来稍微柔和一些。   把传感器向右移动一个像素   把传感器向下移动一个像素   把传感器向下、向右分别移动一个像素   谷歌AI 博客当中介绍超分辨率技术的插图。利用移动传感器消除图像去马赛克过程当中的猜色（即通过相邻像素值来判断此像素值），提升图像清晰度",
            "level": 2,
            "parentId": 43,
            "valid": 1,
            "href": "index_split_048.html"
        },
        {
            "id": 50,
            "title": "07 AI技术如何影响我们拍摄的图像——从营销到效用",
            "number": 7,
            "fullNumber": "12.7",
            "content": "07 AI技术如何影响我们拍摄的图像——从营销到效用 我们在营销上感受到的AI技术完全不同于我们在课堂当中学习到的AI技术。营销时，厂商为了包装AI技术，会用最简单和感性的故事配合看得见摸得着的开关或者硬件实体，向用户传达信息。而课堂里的AI技术比较晦涩难懂，距离厂商的成熟化产品方案也还比较远。 一些手机的拍照界面有AI模式的开关，比如AI色彩、AI摄影大师等，这些是厂商认为的一般用户容易感知的AI技术。AI技术发展的一个主流方向是根据图像内容识别，得出场景的内容类型，并且对图像做一定的风格化调整。   华为手机拍摄。AI识别秋叶场景 先说说大家容易感知、厂商容易宣传的部分。 摄影图像的风格化调整其实和图像内容的关系并不大。厂商从日常生活中的一些场景中可以总结一些大众的喜好规律，这些规律可以在手机的AI算法里面发挥作用。 比如：识别到秋天的时候让秋叶更红，这样看起来秋色更浓；识别到日出日落的时候，整体更加偏向暖色调和剪影的效果；识别到雪景让画面更加白皙（摄影上曝光补偿“白加黑减”的道理）；拍美食的时候，让整体色泽更加鲜亮，等等。 大家如果发现AI主要在这些时候生效，那么可以在需要即时分享的时候打开AI开关，而在需要自己修图加工的时候关闭AI开关。这类效果对图像做出的是风格化调整，只为了让图像风格更加悦目，不太考虑颜色的真实还原。 还有一类可感知的AI是功能上的提示和模式的切换调整，包括识别到一些建筑或者风景的时候提示用户使用超广角进行拍摄，识别到人像场景的时候切换到人像虚化模式，以及拍摄PPT的时候自动裁切屏幕和文字的部分，自动将拍摄到的内容转换成文字。 这类AI功能都是为了简化用户的操作，对用户的生活有所帮助，和摄影的关系并不大，其介入和提示基本都在我们可以接受的范围内。这就是AI的第一个层面：AI算法对应一个完整的、可以开关的功能。比如“图像分类＋个性化处理”对应手机上的AI拍照功能。 AI的第二个层面，就是将我们之前说到的很多原理和算法放在手机的图像处理流程和后处理算法当中。 目前的算法当中，图像的去马赛克、白平衡、HDR、降噪、细节增强等已经有AI的广泛参与。这些模块在手机的不断更迭之中，在一定程度上取代了传统算法，从前由图像处理芯片负责的事情都变成了通过AI进行运算。很快手机上就会基本实现AI-ISP，把我们熟知的图像处理模块都AI化。从目前的行业趋势和科研界所探明的情况来看，AI算法基本能规避传统算法的一些缺陷。 因为AI的介入，相比于传统相机，手机拍出的图像有时突破了硬件的限制，并且有更多偏离客观的风格化倾向。 AI的加入给计算摄影创造了更多可能，但也带来了一些问题。 比如AI道德问题。手机的远摄望月功能引发过很多争议，AI算法超过了器件本身的能力，拍摄出了清晰、标准的月亮图像（月亮因为潮汐锁定，总是以相同的一面对着我们）。抛开营销上的是非，AI如果拍出了偏离实际环境的图像，我们如果不仔细对比，很难分辨真假。这样的技术是否违背了摄影的客观性？和这个问题类似的是如今被广泛应用的超分辨率功能。通过AI生成的细节有可能不是绝对客观真实的，尽管看上去细节量增多了。在有相关组织对这些事情进行评判之前，我认为目前这些技术对拍摄者的帮助都是正向且积极的，算法的介入目前并没改变我们可感知的事实。但对应的我们也要警惕技术的泛滥——美颜功能可以被用来美化人像，却也有可能被别有用心之人用作身份造假。AI算法蓬勃发展的同时，AI去美颜，AI鉴别图像是否经过三方软件修图等技术也在发展。   华为手机拍摄，于西藏。望月功能往往只对漆黑夜空中的月亮有效   华为手机拍摄于青海 AI还会有过分风格化的问题。对于创作者来说，演绎自己的风格是首要任务。相机提供的应该是一份相对原汁原味的材料，而不是已经加过很多调味料的半成品。AI处理和手机其他模块处理的图像往往过分风格化。手机面向的是大众用户，手机厂商所做的事情是帮助用户直接创作出理想的图像。可是理想的图像毕竟是主观的，所谓一千个用户心中有一千个哈姆雷特。我们可以从一些拍照产品当中看到AI未来的趋势。有些App在前置拍照当中提供捏脸功能，记录你自拍时的脸型喜好，然后将该脸型应用在后续的每一张自拍当中。未来，AI也可能会从现在的厂商定义的风格，走向学习用户喜好的风格，从而创造出千人千面的图像。   vivo手机拍摄，于法罗群岛。我们要懂得手机图像的风格化形成因素，然后改变它",
            "level": 2,
            "parentId": 43,
            "valid": 1,
            "href": "index_split_049.html"
        },
        {
            "id": 51,
            "title": "第六章 拍出最好的风景——手机会简化摄影师的工作流程，但不会改变其创作意志",
            "number": 13,
            "fullNumber": "13",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_050.html"
        },
        {
            "id": 52,
            "title": "01 想拍风景，用全景还是广角镜头",
            "number": 1,
            "fullNumber": "13.1",
            "content": "01 想拍风景，用全景还是广角镜头 能用广角就别开全景。手机全景的拍照算法和摄影当中的拼接方法不同，前者多采用扫描式的方法（谷歌Pixel系列的手机、大疆的系列产品则多采用拼接式的方法）。我们移动手机，画面就一条一条地被拼接合并。扫描式全景的操作方法虽然对用户而言很方便，拍摄的范围更广，但是效果问题很多。 比如在拍摄过程中，手机移动太快，图像有些地方就会出现模糊；手机移动轨迹不水平，图像就容易出现拼接错误，让本来连贯的物体出现断裂。而且受制于图像拼合时候的投影计算，物体往往很容易变形。将曲面成像的东西投影到平面上，需要在形状和面积上做出取舍：要么保证形状一致，但相对地面积关系不准确；要么保证面积关系准确，但图像会发生变形。   在目前大部分的全景拍照当中，拍出的物体的形状都会失真，所以全景功能不太适合用来拍摄建筑，因为直线都会发生弯曲。 拍摄风景的时候，如果广角镜头拍出的画面不够宽广，我们可以考虑使用全景功能。使用的时候，有几个操作技巧需注意。 第一，尽量保证手机缓慢并且匀速移动。 第二，尽量保证手机是围绕一个轴心旋转拍摄的。 第三，移动的轨迹在同一水平面上。 如果用户对全景拍照有更高的要求，也可以像使用普通相机那样竖持手机，保证每张图像的画面重叠1/3左右，将场景完整记录下来，再在计算机上用全景的处理软件（Autopano Giga、PTGui、Photoshop等）进行拼接。   iPhone全景模式拍摄，于秘鲁。超大的取景角度需要用全景镜头才能拍下   vivo手机拍摄，于印度尼西亚。超广角镜头可容纳很多景物   vivo手机拍摄，于西藏。带有HDR的全景模式拍摄",
            "level": 2,
            "parentId": 51,
            "valid": 0,
            "href": "index_split_051.html"
        },
        {
            "id": 53,
            "title": "02 手机拍照的风格来源——HDR、白平衡和颜色",
            "number": 2,
            "fullNumber": "13.2",
            "content": "02 手机拍照的风格来源——HDR、白平衡和颜色 手机的HDR、白平衡以及和颜色相关的模块是手机图像处理的主心骨，在很大程度上决定了手机拍照的图像风格。 HDR代表手机的图像风格，手机之间的拍照风格差异，是大家觉得图像看起来假和不真实的最主要原因。HDR的存在是为了让手机拍出的图像尽可能还原画面的高光和阴影，同时进行一些风格化的渲染。手机的HDR算法包括复杂的曝光策略、HDR合成算法本身、硬件HDR相关的算法，以及很多的图像增强算法。   vivo手机HDR拍摄 用多次或多种曝光弥补单次曝光的缺陷是HDR算法的核心思路。将多张图像合成一张图像的时候，要尽可能缩短每张图像的拍照间隔，甚至要做到同时拍摄多张图像。我们看到的行人的走动、树叶的摆动对于手机的多帧合成而言都是很大的挑战。如果合成得不好，我们就会在图像上看到一些奇怪的现象：人的影子断裂，树叶的踪迹消失，或者是运动的区域有明显的噪点。这都是多帧合成的弊端。 在软件和算法上实现HDR基本上就是基于不同时间连续拍摄一组图像。计算摄影学的奠基人之一，斯坦福大学教授，也是谷歌相机前总工程师的Marc Levoy开创了HDR+算法：通过连续的欠曝图像合成，合成之后暗处由于噪点低可以更大幅度地提亮，以此获得一张高动态图像。而传统的包围曝光算法，则是通过连续拍摄不同曝光量的图像然后融合。融合的时候，建立评价函数：结合对比度、亮度、饱和度等因素让每张图像在同一位置的像素以不同的比例参与最后的成像（便于理解的解释方法，融合的时候哪个像素表现得好，就让它多出点力）。融合的时候，又通过拉普拉斯金字塔把图像拆解成不同的分辨率在每一层融合，这样就可以避免融合得过于生硬。 融合之后，一般算法都会形成一个高位图像，高于8bit，为了渲染成能够被显示的图像，图像要通过影调映射（tone mapping）渲染成我们常见的低位图像。这个过程中也有很多与对比度相关的参数在发挥作用，比如全局对比度、亮度、局部对比度等。为了获得更悦目的光影效果，这些对比度调整方法中会增加很多图像混合算法，比如AI的对比度增强算法、Retinex算法、直方图拉伸法等。 HDR的调整是一个主观性很强的调整，没有统一的标准。下图的棋盘阴影错觉告诉我们，人眼对于局部亮度和亮度关系的感知并不是绝对客观的，也告诉我们亮度表达的复杂性。有时候我们觉得拍照的效果不够自然，有点假，很可能是因为图像HDR的处理过度或者风格与我们的喜好不符。我们看见拍好的图像在进入相册之后针对人像的区域有单独的处理和提亮，也很可能是HDR人像相关的策略在发挥作用。   棋盘阴影错觉，正方形A和B的颜色完全相同 包围曝光算法和HDR+算法直到现在还常常被混用，对于这两种算法，我们应该各取所长：用包围曝光算法获得更高的HDR动态范围，用HDR+算法在较短的拍摄时间内减少鬼影，增加暗部的噪点。软件相关的方法都是不同时拍摄的，难以消除鬼影问题，因此我们会将硬件方案和硬件HDR配合一起，增强HDR的鲁棒性，同时让HDR能够适用于视频。 一些经典的硬件HDR方案，比如某些四拜耳阵列结构的传感器，把原本4个一组的像素拆分得更细，从原本的RGB到4个R、4个G、4个B，在HDR成像模式下，每4个一组的对角线像素两两进行曝光，分成长曝光和短曝光，再通过特殊的解马赛克方法，合成一张同时拍摄的高动态图像。传感器上面的DOL方法（即digital overlap，指的是接近同时的情况下输出长短曝光合成图像，要求传感器硬件上的支持），类似苹果采用的staggered HDR方法，也是一种硬件解决方案。像素在传感器上是一行一行进行曝光的，本来从第一行到最后一行要都曝光完才能开始下一张曝光，但是这种方法可以做到第一行曝光结束了之后，直接开始第二次时间较短的曝光，不用等到最后一行曝光结束了才开始。节省下来的时间用于输出不同曝光的图像，虽然不是同时拍摄，但是也大大减少了鬼影出现的机会，降低了合成难度。现在很多传感器的曝光方式都是上述原理的变种，主要是为了HDR合成的多帧能够尽可能同时拍摄。   vivo手机拍摄，于印度尼西亚。HDR算法使得手机相机在这样的大逆光场景中表现良好   vivo手机拍摄，于四川。这样极限的逆光场景考验镜头的光学素质和HDR的算法水平 介绍了HDR后，下面说说白平衡。 想象手拿一颗红色的苹果，在日光下、夜晚的暖色路灯下，我们都觉得苹果是红色的，这是因为人眼在一定色温范围的光源内能自动适应，大脑能够判别颜色。但是对于手机来说，需要给定白色的基准，才能准确还原苹果的红色，这个白色的基准就是白平衡的意义。大部分情况下，我们希望白平衡准确，也就是说我们希望手里的苹果拥有在图像中看到的一模一样的红色。但是在比较极端的情况下，比如烛光旁边，或者阴天傍晚的雪地里（那时候的天光相当“蓝”），连肉眼看到的红色都会更暖或者更冷一些。对于手机来说，此时它应该准确还原苹果的红色，还是还原更接近我们感知的有氛围感的颜色呢？这是由手机调试的白平衡倾向决定的，这种倾向不是对错问题，而是风格问题（当然，如果日光下的苹果不是红色的，那有可能是白平衡错了）。白平衡算法一直是摄影技术的重点研究领域，白平衡算法的发展从最开始的灰度世界假说——自然世界的平均色彩是灰色，到完美反射假说——白色是场景当中反射率最高的颜色，再到现在借助AI的办法决定场景的白平衡。我们已经越来越少在手机上看到白平衡彻底出错的情况（颜色完全不对，目前单色场景还是很容易出错，比如画面当中只有草地、只有单色卡纸等，所以有些手机加装了多光谱色温传感器来改善这类问题），但是图像的色彩很容易表达得不好看。发绿的肤色，发绿的沥青路面，带点粉的沙滩，偏青色的蓝天，可能都是白平衡表现不够好导致的，手机在这方面还有很大的进步空间。   vivo手机拍摄，于西藏。单色背景和纯色面积很大的场景对手机白平衡来说是较困难的场景 除了整体的白平衡，手机当中还有很多方法可以对单个颜色进行调整。颜色的调整有的是为了形成图像的风格，也有的是因为手机硬件或者光学上的缺陷不得已而为之。这是每个厂商都会遇到的，比如传感器对于不同波长的光响应不一致，逆光干扰的时候镜片上的眩光影响了颜色，等等。我们有时觉得拍出的图像偏色了，在现在这个技术节点上，更多是指单个或几个颜色不准确。颜色是图像当中最主观的成分。我们回看图像的时候，可能觉得天空不是印象中的蓝色，草地不是印象中的绿色了，这更多是和我们脑中的记忆色彩做对比，而不是同场景中客观测量得到的颜色做对比。所以评价图像的时候，我们觉得图像没有满足我们对此情此景的想象，那是因为成像风格和记忆色不符；而有些人拿手机拍摄产品，现场比对发现图像呈现的颜色和质感不对，那是在和客观真实的颜色比对。客观真实的颜色和人们对颜色的喜好在图像、颜色领域的学术探讨上是区分开的。各个厂商对手机颜色风格的调试要同时满足这两方面的需要，这也是手机在颜色上的发展方向。 现在的网络上有各种调色教程，都在告诉大家用什么样的设置、滤镜、参数能拍出好的效果。这些内容看起来方便、成效快，但是绝大部分没什么营养。对于颜色的理解和认识要从基础的颜色理论入手，再利用颜色理论去理解调色工具的含义；对于色调的认识要通过艺术作品去感受，色调是场景、光线、亮度、美术、主体等综合作用的结果。色调不是调色，更不是几组参数。   一加手机拍摄，于内蒙古。蓝天和沙漠的场景对于白平衡的挑战不小",
            "level": 2,
            "parentId": 51,
            "valid": 1,
            "href": "index_split_052.html"
        },
        {
            "id": 54,
            "title": "03 干预拍照结果的重要方式——点测光和对焦",
            "number": 3,
            "fullNumber": "13.3",
            "content": "03 干预拍照结果的重要方式——点测光和对焦   iPhone拍摄，于上海。点测光让HDR恢复更多高光细节，虽然这么做暗处的噪点表现会稍差 在预览界面如果不对画面进行任何操作，那么按下拍照键，手机就会智能判断所有拍摄参数。我们看见预览画面过曝时，可以通过点按画面进行点测光（touch测光），即优先对点测的区域进行测光，保证曝光准确。此时对焦点也会在我们点按的区域上。另外一个调整曝光的方式就是点按后上滑或者下滑预览画面。 有一些手机可以通过长时间点触+拖动的方式，实现拍摄对焦和测光的分离。举个例子，我们想要拍摄站在窗前的人像照片，但是由于手机一般会优先对人脸测光并且想把脸拍摄得曝光准确，因此窗外的景物就会过曝。试拍以后我们发现相册里的成片比预览画面稍好，但是天空的细节还是丢失了。这时我们可以把对焦点放在人脸上，把测光点放在窗外。或者也可以点触人脸对焦之后，向下滑动屏幕调低曝光补偿以还原窗外更多的高光细节。 上述这个例子再次强调了我们前文提到的手机可能存在的所见非所得的问题，所以是否要通过这里介绍的方式干预手机的对焦和测光，以及何时干预，需要大家在使用一段时间之后，比对预览和拍照结果按需采取。",
            "level": 2,
            "parentId": 51,
            "valid": 0,
            "href": "index_split_053.html"
        },
        {
            "id": 55,
            "title": "04 专业模式——用调整相机的思路调整手机的曝光参数",
            "number": 4,
            "fullNumber": "13.4",
            "content": "04 专业模式——用调整相机的思路调整手机的曝光参数   华为手机拍摄，于加利福尼亚州。利用专业模式拍摄的星空 安卓手机一般都设置有专业模式，能让我们使用操作相机的方式操作手机。下面介绍专业模式当中的可调选项。 手机通常没有可变光圈（三星的S系列曾经出现过通过硬件解决画面边缘画质下降及频闪光源拍照异常的方式），所以在专业模式当中也就不可调。   iPhone拍摄，于无锡。使用手机基于多帧合成的ProRAW格式，后期可自定义效果，获得比较大的图像调整空间 手机专业模式中的可调选项是ISO、S、EV、AF、WB，相机当中对应的概念为感光度、快门速度、曝光补偿、对焦模式、白平衡。 感光度（ISO）越高，画面对光线越敏感，越容易在暗处看清楚物体，但是噪点也会越高。 快门速度（S）越快，越容易捕捉物体运动的瞬间。 曝光补偿（EV）则是在自动测光的基础上增加或者降低曝光。但要特别注意的是，手机的亮度和对比度通常受到曝光、拍摄模式、HDR、图像增强、gamma等模块的影响。对于出图非单帧结果的手机(比如iPhone，它没有专业模式但是有曝光补偿选项)，调整曝光补偿并不一定是线性提亮图像，虽然这样做呈现的效果观感肯定会更好，但是整体不好预测。 对焦模式（AF）让我们可以在自动对焦和手动对焦之间切换。手机的手动对焦功能与相机的不同，很难给出距离指示，因为手机的对焦马达调整存在个体差异等因素，所以我们只能根据预览画面来判断手动对焦是否合焦。 WB是白平衡，我们通过它可以设置场景的色温值。 另外要补充的是，专业模式下的ISO数值，通常对应传感器支持的原生感光度，比如ISO 100～ISO 6400。我们在EXIF看到的ISO数值不是所有都可以调用的。比如我们在手机宣传视频里看到的ISO 409600，是通过计算摄影的方式获得与相机的ISO数值近似的结果。还有很多厂商宣传的双原生ISO，也不一定能在专业模式当中调用。 手机拍照的EXIF信息是不准确的。通过拍照参数学习拍摄手法的方式在手机上难以实现，手机EXIF信息当中的焦距和光圈要经过换算才能成为全画幅相机的参数。快门速度、ISO信息等则由于多帧图像和计算摄影天性，没有太高的参考价值。 苹果的ProRAW格式在原生相机当中不支持用专业模式或者类似的相机操作方式进行拍摄。三星S系列的某款手机十分特别，单帧图像的专业拍照模式可以进行超长时间的曝光，也提供了多帧图像的专业模式，让我们在拍摄的时候就对白平衡、曝光补偿和对焦模式进行控制。",
            "level": 2,
            "parentId": 51,
            "valid": 1,
            "href": "index_split_054.html"
        },
        {
            "id": 56,
            "title": "05 拍出最好看的夜景",
            "number": 5,
            "fullNumber": "13.5",
            "content": "05 拍出最好看的夜景 夜景分成城市夜景和自然光夜景。城市夜景当中存在复杂的光谱和不同亮度的人造光源，是一个弱光+高动态的场景。自然光夜景则是纯粹的弱光场景，月光的亮度只有约2lux，而星光的亮度只有约0.0003lux。拍摄城市夜景，手机需要融合HDR能力加上强大的降噪能力。拍摄自然光夜景，手机则要通过算法加上适当的长曝光才可以获得细节尽可能丰富的照片。   华为手机夜景模式拍摄 夜景模式和HDR一样，作为一个单独的模式，其存在感会越来越低。一些机型已经完全隐去了HDR开关，就是因为厂商有把握让手机自己判断算法该何时介入。在夜景模式上也一样，手机对于场景的判断会更加智能化，不会设立单独的模式让用户操心何时选择。如果厂商之后还会保留夜景模式的手动选择入口，那实际上是在问用户是否愿意用很长的时间去拍摄一张照片。   vivo手机夜景模式拍摄 夜景模式相较于默认拍照模式，都会有更长的曝光时间，手机会根据场景的光线情况及手持手机的稳定程度判断合适的曝光时间。拍摄城市夜景时，手持手机就可以拍出画质优秀的照片。而要拍出好的自然光夜景，比如星空，建议使用三脚架进行拍摄。这时候手机通过陀螺仪等分析自身处于稳定状态，一般会将曝光时间延长到20s以上。但是大家要注意，用手机的专业模式拍摄的自然弱光照片，其画质很难和用相机拍摄的匹敌。这是硬件限制所致：随机噪点问题在小传感器上面会严重得多。换句话说，如果光是雨水，那我们用小的瓶子很难收集到，但用大的盆一下子就能收集不少。   iPhone拍摄，于新疆。使用夜景模式手动调整到最长时间曝光 在有些手机当中，拍摄自然弱光的模式被称作星空模式、极夜模式等，我们可以选用这些模式拍摄自然弱光。在这些模式下，手机会针对星空等场景单独做调试。比如在夜景模式的基础之上，手机将每张照片的曝光时间控制在16s左右，这样做能保证在主摄焦段（23～27mm）拍摄时，星星不拉线，把星星错拍成星轨。对齐多张16s曝光的图像序列进行输出。地面部分相对固定，可使用多帧降噪的方式处理，再把星空和地面进行合成。 另外，长曝光当中由于暗电流和热像素产生的离散的彩噪等图像缺陷，也可以通过算法帧间对比计算和消除。在天文和夜空摄影里，这些步骤需要通过单独在拍摄现场设置和调整环境来进行，相当麻烦。 没错，这些听起来非常复杂，专业摄影师拍摄星空时甚至还会用到赤道仪等专业设备，而手机直接在算法中就完成了相关的操作。 如果大家发现手机通过夜景模式拍摄自然弱光的效果不理想，那么可以使用手机的专业模式，将对焦设置到无穷远，然后将曝光时间设置在20～30s，感光度设置在ISO 400～ISO 1600（根据月光和画质等其他因素调整），别忘了打开手机的RAW格式选项保存后期空间大的照片。 一些夜景模式的原理其实类似于HDR，因此夜景模式可以被认为是一种特殊的HDR，通过多种不同曝光的图像叠加实现高光及阴影细节的还原，同时利用相同曝光的帧平均计算减少时域噪点。当然，更好的效果还是要借助AI算法实现，该领域内有很多人在研究如何通过单张夜景漆黑的短曝光图像，利用深度学习的网络进行图像去噪和图像增强，直接生成低噪点、亮度合适的图像。这在传统相机领域和算法当中听起来像是天方夜谭。在训练的时候，这类算法针对夜景图像直接用神经网络替代了ISP的图像处理流程，用每种颜色像素的RAW图像（指相机的原始数据而不是用于专业创作的RAW图像）和长时间曝光的高分辨率图像作为数据进行训练。",
            "level": 2,
            "parentId": 51,
            "valid": 1,
            "href": "index_split_055.html"
        },
        {
            "id": 57,
            "title": "06 利用手机实现长曝光",
            "number": 6,
            "fullNumber": "13.6",
            "content": "06 利用手机实现长曝光 我们在相机上通过延长曝光时间来使画面动静结合——运动的运动呈现运动的状态而不动的物体保持静止。手机和相机一样，我们可以手动在专业模式当中延长曝光时间来实现长曝光。如果环境中的光线过于明亮，也可以加装减光镜，减少进入画面的光线。 其实手机当中也有一些算法效果是为长曝光功能设计的，我们可以在手持手机的情况下使用。 华为手机的流光快门功能一直深受用户喜爱，用这个功能拍摄，可以在不借助三脚架的情况下实现长曝光。该功能包含4种模式：“车水马龙”“光绘涂鸦”“丝绢流水”“绚丽星轨”。4种模式对于画面的对齐方式不同，对于新出现的高光的叠加方式也不同，我们分别可以用来拍摄城市的车流、光绘、瀑布流水和星轨。   vivo手机星轨模式拍摄   vivo手机光绘模式拍摄   华为手机“车水马龙”模式拍摄 利用三脚架拍摄城市夜景的时候，使用“车水马龙”模式。手持手机拍摄瀑布、海浪或者想长时间曝光模糊行人的轨迹时，则使用“丝绢流水”模式。 但是要注意的是，多次长曝光和单次长曝光有所不同，因为帧与帧之间存在时间间隔，所以运动轨迹的叠加会不连续。我们使用这些模式拍出的物体的运动轨迹，在运动连续且不重复的时候，比如行人单方向的移动，会产生轨迹的断裂感。如果要追求连续、自然的轨迹，还是需要在专业模式当中使用长曝光。 iPhone在原生相机当中没有相关的选项，大家可以在拍摄时打开动态照片，然后在相册应用里将动态照片的模式调整为长曝光，以获得类似长曝光的效果。   华为手机“丝绢流水”模式拍摄。运动的轨迹还是存在间隔   vivo手机星空模式拍摄，于四川",
            "level": 2,
            "parentId": 51,
            "valid": 0,
            "href": "index_split_056.html"
        },
        {
            "id": 58,
            "title": "07 黑白模式",
            "number": 7,
            "fullNumber": "13.7",
            "content": "07 黑白模式 有些手机将黑白模式作为滤镜的一种，这样拍出来的黑白照片和我们自己拍摄彩色照片再转成黑白照片不会有太大的区别。有些手机的多摄方案采用彩色+黑白的组合，这些手机的拍摄模式里一般会有单独的黑白模式。在该模式下，手机主要利用黑白镜头拍摄，可能有额外的算法和为黑白调试的风格效果。因为黑白镜头的所有像素只用来记录明度信息，所以在同样像素的情况下，黑白镜头能够展现更丰富的细节及光影过渡。当然手机的成像不一定如此，因为黑白照片的受众毕竟是少数，并且黑白照片可以通过彩色照片去色的方式得到，所以我们比较难在手机上看到类似相机那样的专门为黑白照片研发的拍照产品。 摄影是减法的艺术，这句话很适用于黑白摄影：黑白照片可以简化画面，统一照片形式感，突出内容。   华为手机拍摄，于上海   华为手机黑白模式拍摄   华为手机黑白模式拍摄   一加手机哈苏黑白模式拍摄，于桂林",
            "level": 2,
            "parentId": 51,
            "valid": 0,
            "href": "index_split_057.html"
        },
        {
            "id": 59,
            "title": "08 微距功能",
            "number": 8,
            "fullNumber": "13.8",
            "content": "08 微距功能 近距离拍摄物体可以拍到我们在日常生活中观察不到的细微之处。手机的微距拍摄主要由两种镜头承担：iPhone、华为某些机型的超广角镜头，小米、OPPO等使用的长焦镜头。 微距能力一般和手机的模组设计关系较大，在软件和算法上没有什么特别之处，支持微距拍照的手机一般也可以微距录制视频。 使用长焦镜头进行微距拍摄是一个比较好的方案，我们可以在不打扰拍摄主体的情况下进行拍摄。而使用超广角镜头进行微距拍摄是因为需要凑得特别近，从而很容易打扰到拍摄主体并且挡住照射拍摄主体的光。我们经常在相机上面加装补光灯来对近距离的物体进行补光，但是手机的闪光灯在设计上基本不会考虑微距拍摄的情况，无法进行微距补光。   一加手机微距拍摄，于内蒙古。沙漠中的植物   iPhone微距拍摄   vivo手机拍摄。超广角的大景深甚至允许大家在拍照时使用微距作为前景，这在手机上很不容易实现",
            "level": 2,
            "parentId": 51,
            "valid": 0,
            "href": "index_split_058.html"
        },
        {
            "id": 60,
            "title": "第七章 拍摄完美瞬间——抓拍与连拍，用技巧补足手机拍照的薄弱环节",
            "number": 14,
            "fullNumber": "14",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_059.html"
        },
        {
            "id": 61,
            "title": "01 如何用手机进行抓拍",
            "number": 1,
            "fullNumber": "14.1",
            "content": "01 如何用手机进行抓拍 先介绍一下用手机进行抓拍的几种方式，和大家常有的一些误区。 首先，一些手机支持长按快门的时候快速抓拍，我们称之为burst模式，这样拍摄的照片通常没有经过太多的算法处理，为了保证速度而牺牲了画质。在一些iPhone手机当中，长按快门是录像，按下快门之后左滑就可以进入快速抓拍模式。 其次，利用动态照片一类的功能也可以实现抓拍。比如iPhone，我们拍完动态照片之后进入相册，相册当中回放的是基于视频画面进行强化的低画质照片，只有我们按下快门时照片画质才高。 所以，如果手机没有特别的运动抓拍模式，一般最能保证画质的方式就是在默认的拍照界面多次点按快门。这么做也有缺点，对于手机来说连续快速单拍非常消耗资源，可能会因为后台运算能力不足或者是内存不够，导致快门被禁用。 一些手机当中存在的延迟在影响我们的抓拍体验。 第一个是相机启动时间，即从我们打开相机到屏幕中出现预览画面的时间，又称作冷启动时间。 第二个是相机拍照的时间，这个时间被拆分成多个环节。 首先是快门延时（shutter lag），说的是从我们按下快门到开始曝光的时间。和相机不同，因为手机拍摄时要从预览的状态切换到拍摄的状态，所以会存在快门延时问题。如今，就算我们停留在相机预览界面什么都不做，手机还是时时刻刻在进行很多的运算，做好准备迎接我们随时按下快门，所以快门延时一般很低甚至不存在（zero shutter lag,ZSL）。   小米手机运动抓拍模式拍摄，于上海 其次是shot to shot时间（即拍摄间隔时间），它表示我们在拍摄照片之后，经过多长时间才能在相册当中看到完整处理后的照片。如今大部分手机为了让我们在按下第一次快门后尽快按下第二次快门，会把第一次按下快门拍摄的照片粗略处理一下就丢到相册中变成缩略图，以保证我们的拍摄体验。这也是为什么我们经常在拍完照片点进相册看照片，会看到一个变化的过程：相册里的照片在经过完整处理后会有所不同。 总结一下上面的内容。我们在快速抓拍的时候，尽量抓准时机，少量快速地多次点击快门，以获得最佳效果。另外，如果手机设置当中有快速抓拍、运动抓拍等选项，可以将它们打开。   vivo手机拍摄于四川   华为手机拍摄，于重庆。低角度抓拍",
            "level": 2,
            "parentId": 60,
            "valid": 0,
            "href": "index_split_060.html"
        },
        {
            "id": 62,
            "title": "02 手机的对焦需要我们操心吗",
            "number": 2,
            "fullNumber": "14.2",
            "content": "02 手机的对焦需要我们操心吗 很多有一定摄影知识的人，觉得手机对焦很容易做到。因为手机上的景深不是很浅，且大部分镜头是广角，一般对焦只需要担心3m以内的物体， 3m以外对手机来说基本都是无限远，不用对焦。长焦镜头在对焦上更困难一些，因为镜头设计特别，所以对焦行程可能比较长。而且长焦镜头一般光圈比较小，较难有足够的光线进入完成对焦。但是长焦模组的感光元件一般都比主摄更小，而且厂商有时会稍微限制长焦的最近对焦距离，来保证长焦的对焦行程尽量短和准确。 这么看来，手机对焦其实很容易，又因为很容易对准焦点，所以手机追焦（焦点自动跟随主体或者运动物体的能力）不是很重要。那么手机的追焦功能难道就没有什么用吗？ 这种想法忽略了很重要的一点：我们需要用手机智能识别运动的物体和判断运动物体的距离和状态，让手机的曝光和算法都切换到合适的模式，这就需要使用追焦功能对主体进行准确判断。另外，手机对焦不光是追求速度，还要追求智能，要尽可能配合拍摄者的拍摄意图。比如部分手机只对位于中央的面积较大的物体进行对焦，但是很多时候画面的主体只占据比较小的面积，这种对焦逻辑就难以实现自动对焦。再比如下页这张照片，前景的狗狗占据较大面积，但是面向我们的狗狗才是需要对焦的主体，这就需要相机有一定的画面分析能力。 总的来说，对焦在逐渐变得智能化，手机的对焦不像相机的对焦那么困难。当我们发现手机对焦的物体不是想要拍摄的主体的时候，可以使用点触屏幕的方式实现焦点的转移。 另外，很多手机通过长按屏幕可以实现AE/AF Lock功能，就是在拍照和录制视频时锁定一个区域进行对焦和测光。当该功能在测光和对焦不稳定的时候可以帮上忙。   小米手机万物追焦功能抓拍的狗狗   华为手机拍摄。在光线较好、运动物体较远的情况下，手机一般都能完成抓拍",
            "level": 2,
            "parentId": 60,
            "valid": 0,
            "href": "index_split_061.html"
        },
        {
            "id": 63,
            "title": "03 手机的对焦技术是如何发展的",
            "number": 3,
            "fullNumber": "14.3",
            "content": "03 手机的对焦技术是如何发展的 对焦问题在手机拍照发展的初期是一个大问题，当时的问题主要是对焦慢：传统的步进马达使用反差对焦等早期技术，在合焦速度上比较慢。之后随着相位对焦的普及，手机在合焦过程当中不再存在“呼吸效应”，不需要镜头的反复移动，对焦的时候干净利落、不犹豫，能够通过对比相位图像直接指导手机准确移动镜组到对焦位置。   相位对焦通过对比相位图像，准确移动镜组到对焦位置，不再像反差对焦那样边对焦边试验 对现在的手机而言，相位对焦技术（PDAF）已经是标配。诸如双核对焦技术（Dual PD）的出现，将同一个像素底部的感光区域一分为二，形成相位对焦所需要的相位图，大大提升了对焦的精度。但是将像素底部的感光区域一分为二的做法在一些比较特殊的场景，比如都是横线条的场景中，就会出现难以对焦的情况。因此这个技术在后来的更迭中出现了在绿色像素上做对角线分割的情况（Dual Pixel Pro），这样不但能检测左右相位差，还能检测上下的相位差。   Dual Pixel Pro的分割像素方式   vivo手机长焦拍摄，使用长焦依然能够对焦准确",
            "level": 2,
            "parentId": 60,
            "valid": 0,
            "href": "index_split_062.html"
        },
        {
            "id": 64,
            "title": "04 对焦难题的典范转移，追焦技术是如何实现的",
            "number": 4,
            "fullNumber": "14.4",
            "content": "04 对焦难题的典范转移，追焦技术是如何实现的 解决手机追焦问题的关键在于清晰地区分背景和主体，一些人眼看来很简单的事情，对于相机来说却不是如此。大部分时候，背景也时刻处于运动当中（因为手机本身的移动及风吹草动）。最开始人们把图像转换成矩阵分解（低秩矩阵和稀疏矩阵），但是全部依赖这样的运算会过于复杂。   矩阵分解计算主体和背景 后来又使用光流法计算的方式来区分背景和主体，但是光流法对于判断运动物体的形态和类型并不友好。   光流法分析运动物体 在新的方法里，算法通过10帧左右的短序列对背景进行建模，在模型中对图像分块，然后在不同的帧之间比对这些块，验证其为背景。运动的区域出现以后会被单独拎出来，交由神经网络进行人物和动物的分类。然后在帧间进行交叉验证，确认人物或者动物的运动范围，这样就可以框选和追踪画面的运动主体。小米12Pro就是运用了类似的方法进行追焦。   追焦系统算法流程图   将人物和动物作为主体识别工作流：（a）两组原始图像；（b）用该方法识别的主体；（c）主体区域识别结果；（d）交叉验证后的最终结果   iPhone拍摄。追焦使得自动抓拍运动主体成为可能",
            "level": 2,
            "parentId": 60,
            "valid": 0,
            "href": "index_split_063.html"
        },
        {
            "id": 65,
            "title": "05 快速连拍技术的发展",
            "number": 5,
            "fullNumber": "14.5",
            "content": "05 快速连拍技术的发展 快速连拍对于相机的性能要求是很苛刻的，而在手机计算摄影当中，这个话题变得更加复杂。计算摄影需要多帧长时间处理，本身生成一张图像的时间就会超过图像信息当中的曝光时间，加上还要处理和存储，总时间会非常长。 很多人会说手机算力不够，但是算力和图像质量是一个交替上升的过程，提升的算力会被厂商拿去对图像进行更复杂和效果更好的运算。所以要把快速连拍技术发展好，厂商需要对手机的画质和功能有着非常强的规划和管理能力。 对于拍照时间和体验，厂商需要在不妥协画质的情况下，对整个拍照研发过程进行系统的管理。大部分安卓厂商都在牺牲拍照时间来换取更好的效果，而苹果目前更加注重体验，所以在连拍方面会更有优势一些。   vivo手机拍摄，于兰溪。通过快速连拍捕捉开门瞬间   华为手机拍摄，于上海。利用长焦连续抓拍",
            "level": 2,
            "parentId": 60,
            "valid": 0,
            "href": "index_split_064.html"
        },
        {
            "id": 66,
            "title": "第八章 拍出最美的人像——在我们的喜好、创作目标与手机算法之间博弈",
            "number": 15,
            "fullNumber": "15",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_065.html"
        },
        {
            "id": 67,
            "title": "01 虚化美如画",
            "number": 1,
            "fullNumber": "15.1",
            "content": "01 虚化美如画   华为手机人像模式拍摄。如今的虚化效果在一些场景中已经非常自然 虚化是图像处理领域的一座大山，理解手机处理虚化图像的最好的方式，就是了解我们人类是如何感知距离的。人类对于世界的立体感知和动物有着些许区别。动物更多是因为良好的移动能力探索出了立体世界的样貌和边界，而人类看着眼前的世界或者是二维的图像就能感知物体的远近。 我们的感知一是来自双眼的信息。我们的左右两只眼睛具有视差，分别用左右眼看一只手，看到的是不同的图像。我们在追踪观察物体的时候，两只眼睛会朝不同的方向运动，这被称作趋同，即双眼同时朝相反方向运动以获得或维持单双眼视觉，是双眼判断空间的重要线索，也是我们会晕VR（virtual reality，虚拟现实）的原因之一。 二是来自物体间的相对大小关系、遮挡关系，细节丰富程度的递进变化，线条带来的透视暗示（比如向消失点延伸的跑道），我们观察到的运动速度以及物体的清晰程度等信息。 如同其他算法一样，我们在视觉上观察物体远近的方式也被应用在虚化算法里。 手机计算摄影的人像模式、大光圈模式等，都在模拟相机上大光圈所产生的光学虚化效果，通过清晰的主体和虚化的背景实现主体和背景的分离。其本质可分为两个部分：首先，估计出场景的深度信息，并且分离主体和背景；其次，对焦外区域进行特殊的模糊处理，生成虚化部分，并根据计算在应该有光斑产生的地方生成光斑。虚化效果发展之初，精度十分有限，在主体和背景判断上出现了许多错误。随着技术的成熟，如今的虚化效果已经有大幅进步，功能可用性大幅增强，尤其适用于拍摄人像。 在使用的时候，虚化效果往往适合拍摄距离不是很远的人和物体。因为手机计算深度图距离的限制及手机的焦段的考虑，这里推荐大家更多使用虚化效果来拍摄半身像或肖像特写，拍摄物品的话最好拍摄3m以内的物品，以获得最佳效果。   华为手机人像模式拍摄。人像模式更适合用来拍摄半身像 计算深度图的进步在计算摄影领域主要来自以下两个方面：通过多个来源的信息增加和交叉验证深度图的准确性；通过规律性的总结和AI的帮助更好地区分主体和背景。深度图的来源在计算摄影领域大概有以下几个方面：多镜头作为双目系统计算深度，好比我们的左右眼，看远近不同的物体时有视差。单颗传感器也可以作为双目系统，很多传感器用以对焦的双核对焦技术可以简单理解为把传感器像素分成了左半边像素和右半边像素。虽然左右视差很小，但是对于估计近处物体的深度十分有用，配合大多时候上下排列的多镜头系统，可以同时产生水平和垂直视差。 TOF、LiDAR一类的用于测距的组件，通过主动发射信号并且接收信号反馈来计算物距，也可以辅助深度图计算。但是他们起到的作用没有大家想象的那么大，因为其精度不足以承担计算深度图的主要任务，目前只能对于一些易于混淆的物体和情况，比如眼睛和特殊图案的背景等起到校验作用。   iPhone人像模式拍摄。如今深度图计算对于镂空和边缘的识别已经越来越准确 有些手机的前置和后置镜头只有“单目”，也不能自动对焦，那它是如何实现虚化的呢？这就是AI在虚化当中的作用，其学习参考的方式和人眼通过单目获取深度信息的方式类似。使用手机自拍时的拍照规律十分可循，拍摄距离大都差不多，拍摄的内容也大多是从头到肩膀，此时用AI的方式分割出人物和背景，精度也够用。在后置拍照上，AI也能帮上忙。虽然人物的姿态和情况更加复杂，但也有规律可循，AI可以辅助把人物等主体更精细地区分出来。另外，将头发丝分割出来，单单以深度图的精度很难做到，这时需要用到图像抠图技术（image matting），将图像的主体和背景分离。其中的关键就在于处理好背景和主体的交界处（比如头发丝），这部分大多也得运用AI去推导头发丝的边缘在多大程度上属于主体或者背景（抠图算法中基于学习的alpha matting算法）。现在，基于AI的抠图已经十分强大，我们熟知的AI换脸、Photoshop 2020的一键抠图，都基于类似的技术。   图源谷歌 AI Blog。从Dual PD系统、双镜头系统获得的深度图，以及将二者融合之后的结果 因为手机都是通过计算生成虚化效果，所以在拍摄完之后，我们可以改变对焦点、虚化的程度等，先拍再调。而且因为虚化运算量大，所以预览画面的效果和成片的差距很大。在决定用虚化拍摄的时候，我们不用太在意预览画面的效果，而要善于使用相册当中的虚化编辑功能。 iPhone的电影模式产生的虚化还可以在相册当中生成关键帧记录焦点的变化，这意味着我们也可以先拍再虚化视频。另外，iPhone的深度图被Photoshop等软件支持，我们可以在修图的时候调用深度图信息，在不人工抠图的情况下对照片的主体和背景进行单独的处理。 随着手机传感器尺寸越来越大，不需要开启虚化，在主体离手机较近的时候，拍摄的画面也能有一定程度的虚化效果了。拍摄非常近的物体或者微距拍摄时，不要使用虚化模式。   iPhone人像模式拍摄。在预览画面时，深度图计算会出现错误，但是不用担心 计算完深度以后，需要对主体以外的部分进行虚化处理，这是一个主观性更强的过程。你可能会注意到有些厂商的虚化模式光斑是圆形的，而有一段时期，iPhone的虚化模式光斑在画面四周呈椭圆状，每个光斑还有亮边，就好像光学镜头的像差和口径蚀现象造成的一样。不同厂商利用不同的数学方法对焦外区域进行滤波产生虚化和光斑，而不单单是简单的模糊处理。这些不同的处理办法就像五花八门的光学镜头一样，产生了风格不同的虚化效果。这就是虚化选项里面旋焦、蔡司镜头效果、星星或者心形光斑的由来。 计算摄影的虚化存在很多的可能性，因为在虚化程度上不受光学系统限制，所以在传统镜头上大得夸张的F0.95光圈在移动端可以很轻松就模拟出来。焦外的成像也可以有各种风格。但这不代表虚化的效果自然，目前手机的虚化效果相比于相机的虚化主要有以下两个方面的不足。 第一，深度图使用的是深度估计加上抠图的方式达到虚化效果，相比于光学虚化换了一个概念。手机虚化发展的逻辑是：相机大光圈可以方便地分离主体和背景—手机也要做到主体和背景分离—深度图计算精确度有限—结合主体识别和影像去除背景等方法来抠图—一样能有分离主体和背景的效果。手机拍照认为把人物的部分识别出来之后，人物的部分就要绝对清晰。但是相机的虚化只遵循光学规则。想象一下，我们用大光圈拍摄一个半身人像，这个人侧身站立，焦点在眼睛上，理论上这个人的前后肩膀也是会因光学虚化而模糊的。再比如我们拍摄近距离的面部特写，只有眼睛的部分是清晰的而面部其他部分是模糊的。深度图信息可以把人头和头发精细地选择出来，但是面对五官需要虚化的部分还是束手无策，拍出来的面部都是清晰的。这些都限制了手机虚化效果的使用范围。还有就是远距离和长焦虚化的问题，因为双目系统的硬件限制，LiDAR、TOF等组件也对近距离的物体更加有效，目前3m以外的深度图信息还是过于粗略了。如果你问我是手机的虚化方法好还是相机的虚化方法好，我会认为相机的虚化方法更好。因为我们在手机拍照和计算摄影的方方面面都尽量遵循人类对场景的视觉感知，眼睛对于虚化的处理和相机的虚化方法是最接近的。当前手机的虚化方法是一种不得已而为之的临时妥协方法，希望厂商在埋头继续做准深度图的同时能够跳出来看一看为什么手机的虚化模式使用率一直没有显著的提升。 第二，手机生成的虚化效果有时候太强烈了，特别是拍全身像的时候，人们在视觉上还不习惯这种效果。手机拍全身像的虚化效果有时像是一个24mm、F0.7的光学镜头拍摄的。在传统相机中，中画幅、大画幅的胶片机可以营造这种把现实世界变成微缩景观的方法，在小画幅相机上也有Brenzier方法，利用全景拼接产生大画幅虚化和景深效果。但是，总的来说我们还是不太习惯这样的视觉处理，把主体全部拿出来的全身像和非常模糊的背景会给我们比较强的“修图暗示”。",
            "level": 2,
            "parentId": 66,
            "valid": 1,
            "href": "index_split_066.html"
        },
        {
            "id": 68,
            "title": "02 人像光效——模拟影棚打光",
            "number": 2,
            "fullNumber": "15.2",
            "content": "02 人像光效——模拟影棚打光 人像光效是指拍摄人像照片的时候，通过对人物的面部甚至是人体建模，在画面当中增加现实里不存在的光源，给人物打光，模拟我们在影棚拍摄或者室外拍摄中利用各种道具补光的情况。 手机的默认拍照模式，尤其是使用后置镜头时，基本上都是对现实拍摄场景进行了一定的优化和强化。人像光效增加了现场不存在的光。自从iPhone提出人像光效以后，安卓厂商也通过自研或者和算法公司一起研究，目前鲜有厂商继续坚持。而后，人像光效演变成脱离人脸具体建模的技术点，变得更加滤镜化，可以模仿现实场景中的日落灯、霓虹灯等效果。 人像光效这么多年在技术上几乎没有进步，是因为人像光效有较高的门槛，各个厂商的研发热情也不高。 无论人物和背景的光线关系是顺光还是逆光，光线只有柔和、均匀的时候，人像光效才能起到正面效果。其他时候人像光效起到正面效果的概率比较低。 这就和我们在摄影时什么时候使用补光灯一样。想象一下，一个人在日落时靠在窗边，阳光照亮侧脸，这样带有明显方向性的光暗示了环境的光线情况，也顺应环境塑造了人脸的光线。加之侧光本来就能塑造面部的立体感，如果这时再通过人像光效面部打光塑造立体感，打光方向不对会使现场的光线逻辑混乱，打光方向对了也可能生硬不好看。人像光效的使用需要用户对现场环境和人物脸上的光有准确判断。 谷歌在人像光效的技术上有着持续投入研发，在众多厂商当中获得了更好的人像光效效果，其算法思路以及对于影棚打光概念的应用值得其他厂商学习。 在谷歌的Pixel系列手机当中，人像光效的光照方向也是自动的，AI会放置一个遵循现场光照规律的光源。 算法先将人物的面部抽象成不同表面材质（完全反光、粗糙漫反射表面等）的球体，通过分析抽象出来的不同表面球体的光照情况来判断现场光的颜色、位置、强度，然后通过在面部建模来分析人脸大致的朝向。 接着，算法按照摄影师在影棚的操作习惯来增强现场光线，以及判断负责填充人物面部阴影的补光位置。影棚里面的主光源（key light）大多遵循这个规律：大约在视线上方30°，在相机朝向的30°～60°。填充光源的强度通常为主光源的一半。 了解了现场光照情况，判断了虚拟光源的位置和强度之后，需要在人物面部增加打光效果。这是由另一个AI算法来完成的。在AI训练当中，需要用同一人物有/无光照，以及不同角度光照的图像作为训练集。因此谷歌搭建了一个由64台相机、331个光源组成的多镜头环绕系统，采集了70多个人的数据。     华为手机人像模式拍摄",
            "level": 2,
            "parentId": 66,
            "valid": 1,
            "href": "index_split_067.html"
        },
        {
            "id": 69,
            "title": "03 美颜颜如玉",
            "number": 3,
            "fullNumber": "15.3",
            "content": "03 美颜颜如玉 谁不爱美颜后的自己呢？美颜在计算摄影当中是一个独立且广泛的领域。安卓手机的原生相机提供了基础的美颜效果，其中OPPO、vivo手机里的美颜相关选项十分丰富，同美颜App的量级相当，而苹果手机不提供任何美颜相关的选项。 大部分手机的美颜功能都在人像模式当中提供了可调参数，可以调节美化皮肤、五官、身材的程度。后置拍照美颜功能一般不涉及形变，即大眼、瘦脸等功能，因为后置拍照的人脸可能很小，但是包含磨皮、祛斑、祛痘等针对肤色区域的操作。 皮肤质感的处理在图像后期当中是一个比较专业的领域。在Photoshop中会用到高低频、双曲线、中性灰等方式进行处理。在计算摄影当中也有类似的方法。通过对图像进行傅里叶变换、小波变换，我们相当于用了另一种语言去解释图像。变换之后的图像，我们可以在新的语境之下去统计特征。比如在频域，皮肤的纹理细节可以和皮肤的肤色区分开来，那么我们将肤色处理得更加均匀（比如使用双边滤波），同时保留细节，就可以美化皮肤。 瘦脸、大眼、瘦身一类的形变处理，在皮肤上添加妆容感比如高光、眼影一类的美妆处理，为人物戴眼镜、戴帽子、加动画的特效类处理，这些都基于人脸解析（Face Parsing）或者人脸网格（Face Mesh），就是要通过深度学习的方式或者建模的方式去详细划分人脸的区域。 手机当中或多或少会存在一些看不见的美颜算法。有些是我们在书中提到的各个模块针对人像的风格化处理，导致大家有图像美颜过的观感；有些则是厂商将美颜类的效果放在相机的默认设置里，这些效果没有提供开关，作用力度小不易察觉。这种情况在前置自拍时会更多一些。   华为手机拍摄。手机本身的图像处理也会影响人物皮肤的质感",
            "level": 2,
            "parentId": 66,
            "valid": 0,
            "href": "index_split_068.html"
        },
        {
            "id": 70,
            "title": "04 闪灯亮晶晶",
            "number": 4,
            "fullNumber": "15.4",
            "content": "04 闪灯亮晶晶 手机和相机相比，二者的虚化效果存在一个很明显的分水岭。有经验的拍摄者可以区分手机虚化和相机虚化的图像差异，闪光灯和其他灯光设备也是。 手机闪光灯的发光量和相机相比简直是九牛一毛。当前手机闪光灯都是通过小小的LED灯发光，和使用惰性气体填充、瞬间高能量发光的专业闪光灯相去甚远。因此目前的手机闪光灯只推荐在拍摄半身像或者近处的人像、物体时使用。 在相机上，我们用闪光指数GN来表明闪光灯的发光能力（闪光指数=光圈×距离）。一个闪光指数40的闪光灯可以在相机中设置光圈为F4的时候（ISO 100）照亮3米外的物体。在摄影上实际使用该公式的时候，我们会对公式做出些微的调整以使其符合实际情况（比如换成我们熟悉的距离单位或者考虑闪光灯的角度范围后乘以系数等）。手机闪光灯因为能量太低，所以用检测相机闪光灯能力的测光表测试常常无法获取读数。 但是这不要紧，硬件上的不足我们可以用算法弥补。本来针对监控安防领域的Flash HDR技术已经广泛应用于手机。我们将开启闪光灯拍摄的图像与关闭闪光灯拍摄的多帧图像融合在一起，以获得曝光更加充足、对主体也有补光的图像。 闪光灯拍摄和普通拍摄的区别在于，主体的曝光基本由相机的光圈和闪光灯输出的光线多少来决定（因为闪光灯给予主体的能量一次到位，在最高同步速度以下，不随拍摄时间累积）。背景的曝光则是由传统的曝光参数决定的（手机的快门速度和感光度决定了背景的亮度）。   iPhone拍摄。强制打开手机自带的闪光灯 闪光灯主要有两次革新，都是由iPhone早期在闪光灯上的改变引领的。一次是双色温闪光灯的出现，使用冷色和暖色两个灯珠，匹配不同的环境及肤色。如今这个技术的思路变成了双色温4LED，或者是我们在前置自拍的时候屏幕会根据我们的肤色和所处的环境使用不同冷暖的屏幕颜色补光。另一次则是慢速同步闪光的出现，慢速同步闪光允许我们用更充足的时间对闪光范围以外的背景进行曝光，从而使背景和主体的曝光更加平衡。 主摄拍摄的时候，手机自带的闪光灯只够打亮半身像。在拍摄夕阳的逆光人像、夜景人像的时候不妨一试，会有奇效。我们使用胶片小相机的时候，常常打开闪光灯获得这种效果，手机也有将这种效果表现得好的时候。但因为手机闪光灯的角度固定，只能直射主体，不像相机闪光灯那样可以进行柔光处理，或者调整灯头通过墙面等漫反射光照亮主体，所以手机闪光灯直射时皮肤的一些缺陷难免会被放大，在开启的时候要注意。 手机拥有强大的夜景模式，厂商也自知闪光灯效果存在诸多限制，所以一般菜单上的闪光灯按钮默认为根据场景自动闪光。如果要强制打开闪光灯，我们常常需要进入设置里选择“开启闪光灯”一类的选项。 在前文你已经了解到手机的快门触发和拍摄时间的计算非常复杂，在相机内部，要用准确的时间戳同步相机快门和触发外接闪光灯闪光，这个过程不是那么简单。 华为手机和iPhone的原生相机已经支持某些专业的手机外置闪光灯。这类闪光灯可以通过手机进行测光（TTL测光，即通过相机镜头测光，不用手动调整闪光相关的参数），拍摄时手机自动传递所需要的参数到闪光灯，实现加入闪光灯以后的准确曝光。 大家可以多尝试使用闪光灯拍摄更多的创意效果。闪光灯摄影，包括硬件的创新和软件的革新，比如结合闪光灯照亮的图像进行图像增强等，会是未来手机摄影发展的另一条新赛道。   华为手机拍摄。搭配Profoto外置闪光灯，TTL测光，同步触发闪光   华为手机拍摄。搭配Profoto外置闪光灯，TTL测光，同步触发闪光",
            "level": 2,
            "parentId": 66,
            "valid": 1,
            "href": "index_split_069.html"
        },
        {
            "id": 71,
            "title": "05 拍摄合影",
            "number": 5,
            "fullNumber": "15.5",
            "content": "05 拍摄合影 因为超广角镜头存在较强的透视畸变，所以我们在拍摄合影时应尽量避免使用超广角镜头。主摄和长焦镜头比较适合用来拍摄合影。 但是自拍合影时我们只能手持手机，近距离使用超广角拍摄，那么透视畸变造成的人脸变形是否在所难免了呢？ 其实手机厂商已经研发出了相关的算法来缓解这个问题，这样就算人物在画面边缘也不会明显变形。还记得我们在前文提到的投影的概念吗？手机厂商就是利用不同投影方式的特点，使得人脸不奇怪，同时背景不变形的。 其实我们也可以把超广角强烈的透视畸变看成是一种投影：这种投影遵循近大远小的透视规则，站在边上的人离投射中心远，所以人脸看起来就会大，但是线条的横平竖直不受影响，所以背景的建筑不会变形。 我们把地球投影成一个平面，主要用的是球极平面投影。在这种投影方式下，距离失真，但是角度保留，虽然建筑的线条弯曲，但是人脸不会变形。 算法将图像分割成需要应用球极平面投影的人像区域以及遵循透视的背景区域，应用对应的投影方式后，利用能量最小化原则处理人像区域和背景区域的过渡部分，让画面不因两种投影同时存在而变得畸形。   华为手机拍摄，于贵州。使用超广角镜头拍摄合影也不用担心产生畸变   vivo手机拍摄，于西藏。把人物放在画面中心也可以减少人像的变形",
            "level": 2,
            "parentId": 66,
            "valid": 0,
            "href": "index_split_070.html"
        },
        {
            "id": 72,
            "title": "第九章 拍出最棒的视频——视频技术和技巧",
            "number": 16,
            "fullNumber": "16",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_071.html"
        },
        {
            "id": 73,
            "title": "01 高质量视频录制",
            "number": 1,
            "fullNumber": "16.1",
            "content": "01 高质量视频录制 手机为了节省存储空间，一般会默认拍摄的视频为1080p。如果手机存储够用，建议大家将画面分辨率调到4K。另外要注意4K、60fps这样的规格在很多时候并不适用于手机的每个摄像头。我们有时会发现用这样的规格连续变焦的时候，手机不切换到其他摄像头而是进行数码缩放（通过观察预览画面可以知道）。 我们需要记住每个摄像头能拍摄的视频的最高规格，以及拍摄时是否能在同一规格之间切换。像我在本节开头所说的情况，如果大家在拍摄当中有变焦的需求，那可以降低视频的规格到4K、30fps。 同样的情况还存在于视频HDR的功能上。有时只有主摄支持视频HDR（需要硬件支持），所以我们打开视频HDR开关的时候，其他摄像头干脆不让你选用了。我们只有关闭开关才能重新使用别的摄像头。 还有视频美颜，很多时候也会因为算力的限制只支持1080p分辨率的拍摄。 手机录制视频支持的功能与拍照不同，更多是手机硬件上的规格支持所能达成的功能，很难做到统一。在逻辑上会非常混乱，又不方便和用户解释，所以我们拿到手机要弄清楚每个摄像头支持的拍摄选项。 iPhone的电影模式，因为生成虚化基本都是软件进行计算的结果，所以不光多个摄像头之间可以用一样的规格使用电影模式拍摄，并且前置摄像头也支持电影模式的视频虚化。因为用户常常调用不同的镜头拍视频，却触发了不同的拍摄规格，这对于我们存储和编辑视频都会造成麻烦。 视频功能要进步，器件设计和算法适配都要优化。比如当今流行的传感器的四拜耳阵列结构使得手机的输出可以在高像素、高进光量、HDR几个状态之间切换，这样的硬件设计给拍照和录制视频都带来了很多益处。   传感器四拜耳阵列的普通输出模式和HDR输出模式   vivo手机拍摄，于西藏。傍晚弱光，其实在拍照板块手机的传感器也在切换着输出模式，在高像素和高进光量之间各取所需，甚至是各取所优进行合成",
            "level": 2,
            "parentId": 72,
            "valid": 0,
            "href": "index_split_072.html"
        },
        {
            "id": 74,
            "title": "02 防抖——在运镜和消除抖动之间取舍",
            "number": 2,
            "fullNumber": "16.2",
            "content": "02 防抖——在运镜和消除抖动之间取舍 一打开手机的录像菜单，我们的第一感觉一般是“稳”，这是因为手机防抖技术越来越成熟。 手机防抖主要分为两个方面。其一是OIS，就是光学防抖，主要指硬件层面实现的防抖，形式有一般的OIS组件、微云台（如vivo的X系列）、IBIS （iPhone首次出现，通过传感器的位移实现防抖）。其二是EIS，也就是电子防抖，主要指通过软件算法的方式实现防抖。这两个方面加在一起，使得在运动中手持手机录制视频成为可能。 OIS根据器件类型主要分为SMA式、悬丝式和滚珠式。3种方式通过滚珠或者弹簧，让整个相机模组在z轴上进行运动的同时（出于自动对焦的需要），让镜头和传感器模组实现平移，从而达到防抖的效果。如今的传感器和镜头越做越大、越做越重，OIS要能稳定这些器件越来越困难，所以微云台和本来应用在相机上的IBIS技术也出现在了手机当中。因为手机内部的空间实在是小得可怜，所以相比于我们看到的外置手持云台（比如DJI的OSMO Mobile等产品）、OIS和其他防抖形式，微云台和IBIS技术在手机上能达到的防抖效果十分有限，防抖角度一般都在1°～3°。这样小的防抖角度，主要帮助我们缓解一些手部的颤动和小的晃动。相比于录制视频，OIS在拍照的时候起的作用更大，毕竟我们对静态图像清晰度的要求高于动态画面。手机的OIS光学防抖可以消除小的抖动导致的画面模糊，并且在多帧合成的时候能让手机采集更长时间曝光的图像，增强夜景、弱光场景下的整体画质。随着手机对齐算法的不断提升以及一些新兴算法的出现，AI能够直接消除小的颤动造成的模糊，提升清晰度，这让硬件防抖的重要性进一步下降。所以一些手机开始取消硬件防抖，利用算法补齐硬件的缺失，或者是只在主摄或者主摄和长焦上面采用光学防抖。 在视频拍摄当中，电子防抖发挥着绝对重要的作用。在视频拍摄当中， OIS相关的硬件防抖常常“捅娄子”，需要EIS来帮忙。在走路、跑动、骑车等过程中录制视频，手机会产生各种复杂的抖动和不同频率的振动。因为OIS防抖角度小，运动过程中录制视频很容易超出防抖角度，所以防抖就有时介入，有时不介入，造成画面在模糊和清晰之间不断切换，给人很差的观感。为了规避这种情况，EIS的做法不是想办法让暂停的每一帧都绝对清晰，而是利用“人眼对于方向一致、连贯的运动模糊感觉更自然”这一特性，把这些间歇性的无规则抖动和模糊融入连续的运动模糊当中，让视频的表现更加自然。 EIS通过裁切画面，只取画面中心部分，画面四周作为防抖时裁剪的余量（一般在10%～20%），通过采集运动数据对运动进行分析和预测，然后对当前和未来的帧进行扭曲、变换、对齐等操作，来使画面变得稳定。 EIS所需要的运动数据来自陀螺仪（手机的姿态）、OIS（OIS记录了相机模组在x、y轴上的运动）及对焦模组（模组在z轴上的运动）。这些数据会被打上明确的时间标记，和成像过程进行同步，用于后续消除视频的果冻效应、对焦产生的呼吸效应（随着相位对焦的进步已经越来越少出现）以及视频的抖动。结合这些信息，还有AI算法的判断，接下来手机会分析哪些是拍摄者有意的运动（运镜），哪些是不必要的抖动。这样手机就可以在拍摄者横移拍摄的过程当中消除纵向的抖动，同时保持拍摄者的意图。AI算法还要通过预测避免画面抖动过大而超出防抖裁切范围的情况。分析结束以后，AI算法对未来的帧在图像上进行分块，进行局部的形变、扭曲，这样画面整体就趋于稳定了。 有一些很高频率的震颤，无论是OIS还是EIS都无法完美消除。EIS在图像变换过程中也会损失视频清晰度，并且画面的运动也会显得呆板一些。EIS当前并不能完美区分拍摄者有意的移动和相机的抖动。 看了上述内容，相信你对防抖的作用有了更深的理解。如果手机提供防抖功能，那么固定机位拍摄的时候我们应关闭防抖以避免防抖介入带来额外的画面运动。在走路的情况下拍摄，使用普通的防抖功能就够了，手持外置云台主要是帮我们在拍摄时保持水平而不是防抖，购入需要三思。手机如果有运动防抖选项，则一般只会在拍摄过山车、山地车骑行、滑雪等运动比较剧烈的场景时才会考虑启用该防抖选项。 如今，许多厂商都在追求防抖角度，这不一定是一个好的信号。越大的防抖角度也意味着我们想要营造的一些小的画面运动和运镜会被防抖抵消。你可能会注意到很多电影和纪录片都会结合一些手持拍摄的、带有一定晃动的给人以临场感觉的镜头。我们在拍摄纪录片，或者营造紧张氛围的场景时，就会使用手持手机这样的不怎么消除抖动的拍摄方式。大部分的手机不存在防抖开关，我们无法关闭防抖功能来实现这些进阶的运镜。   华为手机3倍光学变焦拍摄。长焦的OIS组件在拍摄时起到了很大作用",
            "level": 2,
            "parentId": 72,
            "valid": 1,
            "href": "index_split_073.html"
        },
        {
            "id": 75,
            "title": "03 浓缩时间的延时摄影",
            "number": 3,
            "fullNumber": "16.3",
            "content": "03 浓缩时间的延时摄影 延时摄影就是每隔一段固定的时间拍下一张照片，然后将这些照片按序列封装成一段视频。长曝光一般是说浓缩一段时间的画面并将其变成一张照片。我们要注意两者的区别。 在专业摄影领域，延时视频便是如此制作的。延时视频因为由照片而来，所以有着巨大的调整空间，并且画质高于一般的视频。 在手机领域，绝大部分厂商用更简单的办法达到了一样的效果——视频抽帧。视频抽帧即用手机长时间进行视频录制，每隔一段时间抽取一个画面，以达到延时摄影的效果。这种方法无疑大大损失了画质。 有些厂商发现了这个问题，比如华为和vivo的手机就支持使用照片流生成高画质的延时视频。这需要非常稳定一致的照片作为支撑，还需要不同于拍照时间的曝光和HDR策略来配合。 延时摄影要求画面稳定，常常需要用固定机位进行拍摄，推荐大家在进行延时摄影的时候将手机固定在三脚架上，用第三方手机云台的运动延时拍摄功能来拍摄。拍摄时，云台的电机会带着手机稳定移动，得到运动的延时画面。我曾经把手机用运动相机的固定夹夹住，将其放在厨房定时器上拍摄过，一样收到了不错的效果。 大部分厂商的延时摄影功能会根据拍摄时间的长短自动生成一段30s以内的视频内容，也有不少厂商允许我们根据实际情况自定义拍摄的总时长和画面拍摄的时间间隔。我们可以参考常见延时摄影的运动速度，根据经验来进行这些参数的设定。 不同厂商的可调整选项及参数表现形式略有不同，这里以在功能上有代表性的华为手机延时摄影功能为例。 在延时摄影界面，视频的帧率为30fps。A模式自动决定拍摄间隔，按下快门之后开始拍摄。手动模式分别让用户调整速率和总拍摄时间。速率即间隔时间，15x代表帧与帧之间有0.5s间隔，因为15/30=0.5，也就是每半秒拍摄一张照片。1800x则代表间隔时间为60s。总的拍摄时间默认为无限长，也就是用户再次按下快门后停止录制。后面的Pro按钮则等同于专业模式的选项，用户可以自定义每张照片的设置。 日落到夜晚时段的光线变化很大，这时的场景被摄影师称为holy grail （不好处理且给人感觉很神圣的）场景。这时候如果使用固定的曝光参数，视频画面很快就会黑得看不见。专业摄影师使用LRTimeplase一类的软件自动分析每一帧的平均亮度，结合曝光参数进行亮度平滑化处理。这样，日转夜的视频就可以做到变化平衡。 在拍摄这种复杂场景的时候，手机的自动延时功能大部分不理想。这是因为场景实际存在亮度跳变（比如突然来了乌云），或者手机本身偶发测光、曝光不稳定，使得画面有闪烁，从而和专业处理过的片段有差距。这样的精细处理从理论上对于算法来说并不难，相信在不久的未来就会实现。 刚才说的是固定机位的延时摄影，还有一类在移动中拍摄的称为Hyperlapse的延时摄影，即大范围移动延时摄影。在浓缩时间的过程当中，我们可以大范围移动相机，营造另一种视觉效果。对于手机来说， Hyperlapse的大部分技术要求和延时功能相关，但要面对更加复杂的曝光计算和平滑亮度的挑战。另外，Hyperlapse对于手机防抖的要求和拍摄普通视频的要求也会有所区别。Hyperlapse在小型化的运动相机中已经有了很不错的表现，相信很快也会作为手机拍照的一个附加功能发展起来。   OPPO手机拍摄。在固定机位取景试拍之后使用延时功能录制视频",
            "level": 2,
            "parentId": 72,
            "valid": 1,
            "href": "index_split_074.html"
        },
        {
            "id": 76,
            "title": "04 “放慢时间”的慢动作",
            "number": 4,
            "fullNumber": "16.4",
            "content": "04 “放慢时间”的慢动作 和延时摄影的降格处理相对应的就是“放慢时间”、升格拍摄的慢动作。将拍摄的画面放慢4倍，也就是以120fps的帧率拍摄对手机来说已经是家常便饭，目前手机上主流的规格是240fps的1080p视频。 在这样的帧率下，我们要用慢动作拍摄人们日常的生活和运动场景已经是绰绰有余。很多厂商的手机支持更高帧率的拍摄，但是往往带有一些限制。比如要降低拍摄的分辨率到1080p以下，或者是严格控制录制的时间，触发快门，当手机预览画面中的一个方框检测到运动物体时自动开始录制。再者，在非常高的帧率下，有些手机厂商用的是AI补帧的策略，突破传感器捕捉能力去计算两帧之间额外的帧生成物体运动的情况，这样的方法会使画质产生更大的缺陷。 慢动作当中，很多事物都会变得很特别，你能用手机清晰地记录蜜蜂翅膀的震颤，或者发现我们习以为常的路灯其实一直在有规律地闪烁，阳光下的水珠折射出了色彩。 过高的帧率设置的应用面比较窄，而且会让普通的慢动作放慢太多，加上画质的下降和拍摄时间的限制，一般大家选择240fps、 1080p的规格就足够了。 另外，很多人小看了4K、60fps这个设置的优势。我们输出的视频的格式大部分是25fps或30fps，这个帧率能够保证画面运动流畅而不会有卡顿的感觉。随着显示设备刷新率的提高，我们对视频帧率的要求也有所提高， 60fps显然更符合这个趋势。另外，就算你最后要输出25fps或30fps的视频，60fps的视频给了用户不少慢动作效果的空间，能够让拍出来的视频质感更好。 如今，手机的慢动作功能能发展得这么好，离不开传感器技术的一个重要革新，那就是传感器DRAM（动态随机存取存储器）层的出现。本来传感器拍摄好的图像要传输出来处理需要通过MIPI（移动行业处理器接口），而MIPI本身有着很多规格和速度的限制。但是我们在图像传感器的底部加上DRAM层，也就是内存，能够让手机传感器高速拍摄的图像先存进内存，再一帧一帧传出来。这个技术大大增强了手机拍摄慢动作的能力。 慢动作和延时摄影作为“放慢时间”和“浓缩时间”的视觉表达方式，可以让叙事的节奏和剪辑的节奏更加错落有致。",
            "level": 2,
            "parentId": 72,
            "valid": 0,
            "href": "index_split_075.html"
        },
        {
            "id": 77,
            "title": "05 HDR10、杜比视界——视频标准的影响",
            "number": 5,
            "fullNumber": "16.5",
            "content": "05 HDR10、杜比视界——视频标准的影响 这些名词是什么？与我们前文提到的HDR有什么不同？ HDR这个名词在本书当中已经出现了很多次，大家要分清我们讨论它们的不同语境。在拍照和录制视频时，HDR作为一个算法生效。这样的算法大多是把实际场景当中宽广的动态范围压缩到普通屏幕能显示的范围之内，所以你拍下的太阳能在屏幕上清晰显示且不过曝。 但是这样拍摄而来的太阳的观感，远不像我们实际看到的太阳那样刺眼。随着显示技术的不断提升，屏幕在峰值亮度和对比度上面有了较大的突破。人们想要在屏幕上还原更加逼真的视觉感受，因此也需要在视频上重新规范这种从记录到播放的、端到端的过程。 HDR10、杜比视界和HLG等标准就此诞生。 HDR10和杜比视界是如今视频领域较为主流的两个HDR标准。我们只有用支持这些标准的设备拍摄视频，再在支持这些标准的回放设备上观看视频，才能获得完整的HDR视频体验。 HDR10是一个开源而且免费的标准，以三星为代表的安卓阵营在视频的拍摄和回放上面都宣称自己支持HDR10甚至是HDR10+。因为开源而且免费，目前支持HDR10的设备中电视会稍多一些。有趣的是，在内容上面，杜比视界视频会更多，像是网飞、索尼等（暂时）都只站在了杜比视界阵营。 而以苹果为代表的手机也支持杜比视界。杜比视界需要授权费用，但是其一大优势在于视频当中存在逐帧的元数据（metadata），这些元数据允许厂商通过不同的设置和算法去解析这些内容，在统一HDR数据标准的基础之上实现一些灵活和有特色的显示。 这些标准的实现在整个影像行业中都是超前的，而且手机屏幕一般在技术上领先于大部分人日常使用的其他屏幕，带给人的观看体验也要好很多。要在摄影领域实现HDR标准视频的拍摄、制作和回放，你需要在相机上增加额外的监视器，并且看到的只是灰蒙蒙的画面，然后在价格不菲的显示器上面进行复杂的后期制作和回放。   vivo手机拍摄。各类HDR标准使画面的高光表现更有现场感",
            "level": 2,
            "parentId": 72,
            "valid": 0,
            "href": "index_split_076.html"
        },
        {
            "id": 78,
            "title": "06 HDR视频标准对我们进行内容创作的启发",
            "number": 6,
            "fullNumber": "16.6",
            "content": "06 HDR视频标准对我们进行内容创作的启发 下面说说HDR视频标准的核心知识，并结合这些核心知识展现HDR视频的视觉效果，谈谈这些标准对我们进行内容创作的启发。 影像是一个将我们的真实感知逼真再现的过程。现实世界的亮度动态范围非常高，可能达到215∶1，也就是大家常常在一些相机宣传当中听到的图像拍摄有15挡动态范围。 而一般的显示器，其高度动态范围只有1000∶1，就算是各种标准的HDR显示器也还达不到215∶1的高度动态范围。为此我们需要一个函数来把相机宽广动态范围捕捉到的高动态信息翻译成显示器有能力显示的范围。 这就是显示行业当中大家熟知的，HDR标准使用的感知量化器色调相应函数（PQ EOTF）。名词本身很复杂，但是下面的图很直观。这个函数把纵轴上的亮度（相机捕捉的对应的画面亮度）变成了横轴上的显示器的某一档显示亮度输出（用百分比表示）。   感光量化曲线 大部分HDR标准的PQ EOTF都是这个形态，其特征就是现实当中高亮的内容被分配到了一个较小的亮度区间进行显示，而这也是目前HDR标准在视觉上我们能感知到的最大优势，那些火光、阳光、天空等明亮、略有些刺眼的场景，在显示器上虽然细节显示得不是很清楚，但是更加接近我们的真实感受。画面当中充满细节的部分和普通显示器显示出来的一样，大都位于画面当中中间亮度甚至是比较暗的部分。但如果画面当中老是充满这样的高亮区，就如同我们在现实当中一直顶着太阳光想要去看清东西一样，会更容易产生视觉疲劳。 图中的曲线之所以大部分都是这个形态，和我们的视觉习惯也是分不开的。我们对于高亮的物体的细节感知能力较差，因此不需要分配很多显示资源来展现画面很亮的地方；反而是画面比较暗的地方，更需要有高对比度和良好的过渡。记住这一点，无论是在理解显示原理和这些函数的设计上，还是在内容拍摄和后期制作上，对我们都大有帮助。   华为手机拍摄，于缅甸。我们将高光部分作为视觉中心，同时注意暗部的影调过渡",
            "level": 2,
            "parentId": 72,
            "valid": 0,
            "href": "index_split_077.html"
        },
        {
            "id": 79,
            "title": "参考资料和文献",
            "number": 17,
            "fullNumber": "17",
            "content": "参考资料和文献 Google AI Blog Dpreview技术文章 DXOMARK文章 smithsonian national museum of natural history ColorChecker: How to get PERFECT skin colors with every camera Sigma 65mm F2 DG DN sample gallery 孟塞尔颜色blog Chalmers A, Debattista K.HDR video past, present and future: A perspective[J].Signal Processing: Image Communication, 2017, 54: 49-55. Ho C J J, Chen H H.On the distinction between phase images and two-view light field for PDAF of mobile imaging[J].Electronic Imaging, 2020, 2020(14): 390-1-390-6. Chan C C, Chen H H.Autofocus by deep reinforcement learning[J].electronic imaging, 2019, 2019(4): 577-1-577-6. Yousif H, Yuan J, Kays R, et al.Object detection from dynamic scene using joint background modeling and fast deep learning classification[J].Journal of Visual Communication and Image Representation, 2018, 55: 802-815. Chandrasekaran V, Sanghavi S, Parrilo P A, et al.Sparse and low-rank matrix decompositions[J].IFAC Proceedings Volumes, 2009, 42(10): 1493-1498. 尹宏鹏， 陈波， 柴毅， 等.基于视觉的目标检测与跟踪综述[J].自动化学报， 2016, 42(10): 1466-1489. Liu D.Real-Time Simulation of Depth of Field with Bokeh[J]. Schrapel M, Etgeton P, Rohs M.SpectroPhone: Enabling Material Surface Sensing with Rear Camera and Flashlight LEDs[C]//Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems.2021: 1-5. BS ISO 1230:2007 《Photography—determination of flash guide numbers for electronic flash equipment》. Isidoro J R, Milanfar P.A pull-push method for fast non-local means filtering[C]//2016 IEEE international conference on image processing (ICIP).IEEE, 2016: 1968-1972. LeGendre C, Ma W C, Pandey R, et al.Learning illumination from diverse portraits[M]//SIGGRAPH Asia 2020 Technical Communications.2020: 1-4. Liang C K, Lai W S, Shih Y.Distortion-Free Wide-Angle Portrait on Camera Phone[J].2019.High-dynamic-range (HDR) vision[M].Berlin, Heidelberg: Springer Berlin Heidelberg, 2007. Elliot A J, Maier M A.Color psychology: Effects of perceiving color on psychological functioning in humans[J].Annual review of psychology, 2014, 65: 95-120. Moroney N, Fairchild M D, Hunt R W G, et al.The CIECAM02 color appearance model[C]//Color and Imaging Conference.Society for Imaging Science and Technology, 2002, 2002(1): 23-27. Whitfield T W, Whiltshire T J.Color psychology: a critical review[J].Genetic, social, and general psychology monographs, 1990. Coard S I, Breland A M, Raskin P.Perceptions of and Preferences for Skin Color, Black Racial Identity, and Self-Esteem Among African Americans 1[J].Journal of Applied Social Psychology, 2001, 31(11): 2256-2274. Kuang J, Xiong W.Color constancy for multi-illuminants high-dynamic-range scenes[C]//Color and Imaging Conference.Society for Imaging Science and Technology, 2008, 2008(1):56-60. Shaik K B, Ganesan P, Kalist V, et al.Comparative study of skin color detection and segmentation in HSV and YCbCr color space[J].Procedia Computer Science, 2015, 57(12):41-48. Cubukcu E, Kahraman I.Hue, saturation, lightness, and building exterior preference: An empirical study in Turkey comparing architects' and nonarchitects' evaluative and cognitive judgments[J].Color Research & Application: Endorsed by Inter‐Society Color Council, The Colour Group (Great Britain), Canadian Society for Color, Color Science Association of Japan, Dutch Society for the Study of Color, The Swedish Colour Centre Foundation, Colour Society of Australia, Centre Français de la Couleur, 2008, 33(5): 395-405. De Ridder H.Saturation and Lightness Variation in Color Images of Natural Scenes[J].J.Imaging Sci.and Techn, 1996, 6(40): 487-493. Capel D, Zisserman A.Super-resolutionenhancement of text image sequences[C]//Proceedings 15th InternationalConference on Pattern Recognition.ICPR-2000.IEEE, 2000, 1:600-605. Chen Y, Tai Y, Liu X, et al.Fsrnet: End-to-endlearning face super-resolution with facial priors[C]//Proceedings of the IEEEConference on Computer Vision and Pattern Recognition.2018: 2492-2501. Chen C, Chen Q, Xu J, et al.Learning to see inthe dark[C]//Proceedings of the IEEE Conference on Computer Vision and PatternRecognition.2018: 3291-3300. Liu S, Ou X, Qian R, et al.Makeup like asuperstar: Deep localized makeup transfer network[J].arXiv preprintarXiv:1604.07102, 2016. Mertens T, Kautz J, Van Reeth F.Exposurefusion: A simple and practical alternative to high dynamic rangephotography[C]//Computer graphics forum.Oxford, UK: Blackwell Publishing Ltd,2009, 28(1): 161-171. Wang M, Yang G Y, Lin J K, et al.Deep onlinevideo stabilization with multi-grid warping transformation learning[J].IEEETransactions on Image Processing, 2018, 28(5): 2283-2292. Xiao L, Heide F, O'Toole M, et al.Defocusdeblurring and superresolution for time-of-flight depth cameras[C]//Proceedingsof the IEEE Conference on Computer Vision and Pattern Recognition.2015:2376-2384. Xu N, Price B, Cohen S, et al.Deep imagematting[C]//Proceedings of the IEEE Conference on Computer Vision and PatternRecognition.2017: 2970-2979. Chang H C, Lai S H, Lu K R.A robust and efficient video stabilization algorithm[C]//2004 IEEE International Conference on Multimedia and Expo (ICME)(IEEE Cat.No.04TH8763).IEEE, 2004, 1: 29-32. Afifi M Brubaker M A, Brown M S.Auto white-balance correction for mixedilluminantscenes[C]//Proceedings of the lEEE/CVF Winter Conference on Applications of Computer Vision.2022:1210-1219.Table of Contents 封面 扉页 版权信息 目录 内容提要 彩插 前言 第一章 手机摄影时代，技术创新与相机之争 第二章 常常忽略的基础——新手不知，老手不解 第三章 构图——摄影共同的话题，手机特殊的课题 第四章 颜色理论——调色，授人以鱼不如授人以渔 第五章 拍出最高的画质——拍好之前，一定先拍到 第六章 拍出最好的风景——手机会简化摄影师的工作流程，但不会改变其创作意志 第七章 拍摄完美瞬间——抓拍与连拍，用技巧补足手机拍照的薄弱环节 第八章 拍出最美的人像——在我们的喜好、创作目标与手机算法之间博弈 第九章 拍出最棒的视频——视频技术和技巧 参考资料和文献",
            "level": 1,
            "parentId": null,
            "valid": 1,
            "href": "index_split_078.html"
        }
    ],
    "lang": "zh-cn"
}