{
    "canAnalysis": true,
    "chapters": [
        {
            "id": 1,
            "title": "内容提要",
            "number": 1,
            "fullNumber": "1",
            "content": "内容提要 记录平凡生活，分享快乐点滴，留存美好回忆……用手机拍摄和分享已经成为每个人生活中必不可少的一部分，但是，如何能拍出高质量的照片，如何能通过后期制作提升照片效果，如何拍出好玩有趣的短视频，仍然是许多人的困惑。 卷毛佟是近年来在网络上涌现出的优秀手机摄影师之一，本书是他针对上述问题悉心总结的手机摄影技能教程。本书从解锁拍摄技巧讲起，继而讲解了构图、用光、拍摄视角、场景转换、黑白效果、视觉对比、拍摄创意等方面的知识，提供了多种多样的手机后期处理技法和短视频拍摄思路，旨在帮助读者全面提升手机摄影技术。掌握本书知识，轻松玩转手机摄影不再是梦。 本书适合喜欢用手机拍摄、分享照片的人们，以及想更加深入地了解手机拍摄及照片后期处理技法的手机摄影爱好者阅读。",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_001.html"
        },
        {
            "id": 2,
            "title": "插图",
            "number": 2,
            "fullNumber": "2",
            "content": "插图  （本书图片除特别标注外，均为作者卷毛佟所提供。）",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_002.html"
        },
        {
            "id": 3,
            "title": "推荐序1",
            "number": 3,
            "fullNumber": "3",
            "content": "推荐序1  自己选择的路，蹦蹦跳跳地走完吧 我和海宝（卷毛佟）是6年的同事、8年的朋友了。 他刚到北京时，戴副眼镜、顶着个傻头来面试。然后，第一天就懵懵懂懂地被我们拉着去天津图书馆发传单。结束后，我们在天津街头横着走，他就安静地在后面跟着。我们喝大酒，他就默默地一杯杯干。以后的6年里，从一个个攻下来的市场，到离开时的大醉，到失恋时的大哭，到结婚时的喜庆（是的是的，不是一个人），有那么几年，我们几乎天天都在一起。 但是给我印象最深的，却是他有一段时间的签名： “自己选择的路，跪着也要走完。” 我一方面吃惊于这种韧劲，一方面又觉得哪里有点不对劲。 后来我逐渐想通了——一条路，当你总想着“走完”的时候，这条路的过程其实你就不太享受了，这就不算是个好路。 海宝的手机摄影之路，就不是什么“跪着走完的。” 偶然的一次尼泊尔之旅，踏踏实实拍回来2000张照片； 为了整理照片而在马蜂窝上写了游记，无意中却成为旅游撰稿人； 为公益进行的雅安地震之行，在灾区无法用相机拍照。在飞驰的汽车上随手抓的照片，却得了一等奖。他意识到：主题比技术更重要。于是，他开始从相机转向手机…… 遇到了自媒体、短视频红利。那段时间，他在一家餐饮公司做市场，超级超级累，还是每天坚持自己的兴趣，发一些关于摄影的内容。 他走上的这条路，是机缘巧合；热情推他走着，却并未走完——相信这本书带给他的机会和可能性，会在他面前徐徐展开——这才是人生的好路。 其实，最重要的不是走什么路，而是人生的主题。 《美国纽约摄影学院摄影教程》被认为是最经典的摄影入门教材。在厚厚的几百页中，关于摄影的原则却只有三条： 1.要有一个毫不含糊的主题； 2.把注意力引向主题； 3.删除所有不重要的其他内容，保持简洁。 选择一个人生的好主题才是关键——这个主题有时候你能感觉得到，有时候就是模模糊糊的。在这个主题之下，有时是你选择了一条路，有时只是凭着直觉到处乱逛，而路反过来选择了你。 但不管怎样，最终你走上那条达到人生主题的路，都是咧着嘴、蹦蹦跳跳地走完的。 咧着嘴因为真的很累，蹦蹦跳跳是因为爽极了。 最后，认真推荐一下这本书。 这是一本一板一眼地教你怎么做手机摄影的书。 海宝是东北人、体育生、暖男，内心有点小不羁。这四张牌啊，几乎是好人卡里的同花顺。本书像海宝本人一样，踏实，稳重，没什么花架子，但是特别实用，偶尔灵光一现。 如果你要读一本关于手机摄影的书，这本就足够了。 毕竟，你要成为的是记录自己美好生活的大师，而不是要成为什么手机摄影大师。所以，你应该看一个真正体验过生活、记录过生活，而且获得了美好生活的人的书。  古典作家，著名生涯规划师，新精英创始人",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_003.html"
        },
        {
            "id": 4,
            "title": "推荐序2",
            "number": 4,
            "fullNumber": "4",
            "content": "推荐序2  十年前，我们都是一穷二白、嘻嘻哈哈、准备大干一场的少年 1 我跟海宝认识有整整十年了，从他刚来北京、租住在没有暖气的房子里开始的。 我记得一个冬天的早晨，我问他一些事情，他说自己在外面。我说，这么冷，你在外面干什么？他说，因为房间里更冷，出来还能有太阳光，暖和点。我当时就乐了，真是取暖靠太阳啊。 这个小故事，我十年都没有忘记，因为那时候的我们都一样，刚毕业，没什么钱，靠一点点薪水过日子，能省就省，房租这种巨大的开销更是如此。我住在市中心6平方米的筒子楼房间里，他住在离公司30公里外的郊区农民建的租金300元的小房子里。 那时候，他在一家公司做市场运营，还什么都不会，一切都是摸着石头过河。我当时在一家公关公司里做最底层的员工，有时候照猫画虎地给他说点行业信息。一来二去熟悉之后，我发现他很喜欢摄影。 有一天，公司里的保洁阿姨处理一些过期杂志，准备扔掉。我正好路过，本来想看看有什么我能看的，结果却发现了几十本精装、未拆封的摄影杂志。都是超大版本，印刷精美，高级得不得了！ 我把这一堆杂志全拦截下来，寄给了他。虽然我不知道他当时是什么水平，但我觉得他应该需要吧。  2 这十年，我们联系不多，我只是经常从网上、朋友圈中看到他的摄影作品，越来越惊艳。我从来没想过，他真的成了一个这么棒的摄影师，而且还是做手机摄影，用他下班后的业余时间来做。这简直太不可思议了。 我们再次频繁地联系，是从去年开始。他辞职了，开始做自己的摄影事业。 他开了微信公众号，分享自己的“斜杠”生活； 他在网上和线下讲摄影类的课程，几乎每个平台都能看到他的身影； 他开了抖音账号，分享摄影小技巧，3个月就有几百万粉丝。 他用了十年时间，从住300元的民建房、月薪1300元的小北漂，到在北京买房、安家、结婚，把自己的爱好一步步培养成了能养活自己的事业。 而我，眼睁睁地看着他的所有变化慢慢发生，并且梦想成真。 说实话，很激动，也很想为他鼓掌。 3 这年头，“梦想”这个词，怕是没人相信了。太多的人想一夜成名，当网红大V，赚大钱。但可能很少有人想到，那些真正成名的网红大V，都有过很长时间的蛰伏和煎熬。太多人学习怎么涨粉，怎么让自己红，做什么样的内容吸引人的眼球，但很少有人想过，如果只学技巧就能成功，那还要努力干什么？ 很多人问我：“星姐，我有一个爱好，我应该怎么用爱好养活自己呢？” 说实话，爱好是养不活自己的，只有为爱好付出巨大的时间和精力，把爱好变成自己的事业，才有可能养活自己。这其中的付出，不言而喻。 海宝，是我身边做到这一点的迄今为止第一个人。这条路，他走了十年。 现在的他，早已买房买车，把自己的媳妇儿一年养胖20斤，过上了和和美美、滋滋润润的生活。 而他，却一直记得我给他的那几十本杂志。搬了很多次家，他都一直带在身边。也正是这几十本杂志，成为我们之间的一个纽带。虽然交流不多，但每次需要帮助时，对方都全力以赴，因为我们都是为自己的梦想而拼命努力的人。  4 前段时间，我的新书出版了。他在第一时间买了我的书支持我，并且拍了一系列新书美照给我。 有一张照片，是在阳光下，反射着太阳光，呈现出温暖的颜色。我突然想起十年前，那时候的我们都一穷二白，都是嘻嘻哈哈、准备大干一场的少年，就像照片里的温暖的颜色一样，充满希望。 十年后的我们，都已人到中年。他胖了，我有了两个孩子，每天我们都在为上有老、下有小的生活乱七八糟地奋斗着。但在夜半时分蜂蜜色的灯光下，我们都还听得到自己内心的声音，也还能看到梦想的亮光在我们眼前晃荡！ 十年，我们都在自己想要走的路上，一直艰难但努力地走着。 很慢，但却很坚定。坦坦荡荡，从不后悔。 写到最后，我想说： 祝福你，海宝，你值得拥有现在美好幸福的一切。早生贵子，一次生俩！ 加油！  @一直特立独行的猫，百万畅销书作家",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_004.html"
        },
        {
            "id": 5,
            "title": "前言",
            "number": 5,
            "fullNumber": "5",
            "content": "前言  我用8年时间把兴趣变成了职业 1 你还记得曾经的兴趣爱好吗？现在你会把多少时间精力投入到兴趣爱好上？ 记得小时候，有一次过年，舅舅从外地带回一个相机，大家都叫它“傻瓜相机”，其操作非常简单，上好胶卷，按快门就可以了。那是我第一次接触照相机。在20世纪90年代，那还是个奢侈品，大人们是不会让孩子们拿去随便玩的。 2009年大学毕业，我从东北来到北京，成为一名北漂，住在西北五环外香山附近的一个私建的出租房里，10平方米，没窗户，没厕所，没有厨房，挤着3个人。很多人说北漂不容易，回老家或者去个小城市也不错。其实我并不觉得有多苦，因为来了北京，我才知道原来生活可以这么多姿多彩，原来有这么多事情可以做，原来生活是要掌握在自己的手里的。 我的第一份工作，工资是1300元。拿着收入证明，我办了信用卡，马上跑到中关村刷了3200块钱买了人生中的第一部单反相机，分期付款12个月还清。1300元的工资，每个月还要拿出300多元还信用卡。 有了相机之后，每个周末我都不会再蜗居在终日不见阳光的小屋子里，而是背上相机穿梭在北京的街头巷尾。从繁华的CBD到古朴的老胡同，从宏伟壮丽的天安门到风光宜人的颐和园，从满是枫叶的香山到酒吧环绕的后海，在北京的各个角落我都留下了清脆的快门声。虽然我不太懂什么技术，也没有专门学习过，拍的照片也很一般，但是我享受观察细节的过程。 我沉浸在对生活细节的感受中，相机镜头就像一个放大镜一样，带着我不停地寻找身边被忽略的细节。当我们驻足观察的时候才会发现，原来平淡的生活，也可以过出诗意。 2 2012年我去了尼泊尔。第一次出国，见到什么拍什么，人、建筑、风光、吃的、喝的……只遗憾储存卡买少了。回来整理照片的时候发现拍了差不多2000张。结合照片，我写了1万多字的游记。对我来说，真是一个大工程。游记和照片发到了马蜂窝网站，然后我就没在意这个事了。 有一天突然有一个朋友说：我在网上看到你的游记被首页推荐了。我快速打开网站，发现留言、点赞、收藏的消息提醒一直在往出弹。网站还找到我，要和我联合出一期《尼泊尔徒步》的攻略，攻略和游记现在在网上的阅读量超过了100万。后来我又接到了一些杂志的约稿，于是我的照片和文字第一次变成了铅字，也拿到了人生中的第一笔3000元的稿费。  说实话，那时候我心里很得意，觉得一个兴趣爱好竟然能被这么多人认可，这让我对摄影的兴趣又上升了一级。 2013年雅安发行地震。震后第三天我以社会志愿者的身份到了灾区。因为环境的特殊性，我就开始用手机拍照。这时候手机发挥了它的便利性特点——可以随手抓拍，视角也更真实。 在灾区拍摄的很多照片并没有什么技巧可言，不过这次之后，让我对于照片的意义有了更深刻的认识，我不再盲目地按快门了。  3 2016年是知识付费、个人IP爆发的一年。平时有很多人都希望我能教教他们如何拍照。我突然产生了一个想法：既然有这么多人希望学习摄影，而且手机拍照的功能这么强大，人们对拍照的需求也越来越大，那我不如就做一个在线课程与大家分享。 经过半年的准备，第一期“零基础手机摄影训练营”于2017年5月上线了。我的目标是招募100人，没想到的是，一周的时间招了200人，一个月的课程收入是我工资的两倍多。第二个月我又开了第二期，效果比第一期还好。 那段时间我白天上班，晚上讲课，身体吃不消了，几乎每天都要忙到凌晨2点才能睡。虽然累，但我喜欢。都说最幸福的事就是做自己喜欢的事，而且还能做得不错。所以后来我决定辞职，因为我认为要想把一件事情做好，光靠业余时间的投入是很难的。 辞去工作之后，我就成了一名自由职业者，全身心地投入手机摄影的培训和自媒体上。我并没有因为不上班就变得很清闲了，因为我突然发现，自由职业者要想有好的未来，就需要把自己活成“一个人的公司”，所有的事情全要自己去搞定。不过虽然累，但是乐在其中。 之后，我陆续收到了很多合作开课的邀请，在千聊、荔枝、趁早、饭团我都开了自己的课程，累计影响超过100000人次。而且成为微软、中国移动、国家电网、360、龙湖集团、戴尔等大型企业的线下培训讲师，还被CCTV1、CCTV2、36kr等多家媒体采访。  当我看到学员拍出好照片，看到他们在比赛中获奖，能在生活中成为别人的摄影师，在替他们高兴的同时，也为自己感到自豪。在我的价值观里有一个是“影响力”，看到这么多人因为我的举动而发生改变，让我非常有成就感。 让我欣慰的不仅仅是帮助学员提升了拍摄技能，而是他们在学习了手机摄影之后，慢慢地改变了对生活的态度。这也是我一直在传递的理念：“用手机记录生活的美好。”学员中最小的10岁，最大的60多岁，几乎是四代人。大家在群里每天讨论摄影技巧，分享摄影心得，互相交流哪里有好景色。这些人来自世界各地，美洲、大洋洲、非洲、欧洲；在国内的几乎遍布所有的省份。他们之间没有任何隔阂，大家因为共同的兴趣爱好聚在一起，让自己的生活变得更有味道了。  4 2018年短视频爆发，我觉得大家对于视觉阅读体验的追求会越来越高，于是快速行动，抓住这个机会在抖音平台通过短视频分享手机摄影技巧，内容也都是在生活中如何拍照、衣食住行接地气的内容，就是希望大家能通过我的教程，在生活中能拍出更多好看的照片，能够提升生活的品质。3个月的时间，吸引了超过300万粉丝的关注，视频的播放量超过了2亿次。当我看到这些数字的时候，有点不敢相信，因为我做手机摄影的这一年的时间里，从开始的期待影响100人，到现在影响上百万人，这个目标是我完全不敢想象的。刚开始别人问我是怎么做到的，我只能说是运气好，只能说我认准了一个事就想着把它做到最好，而且本身做的事情就是自己的兴趣，投入产出比就会比较高。幸运女神可能也更青睐努力的人吧。 在手机摄影领域，有一个比赛被称为“手机摄影的奥斯卡”，它就是全球iPhone摄影大赛。2018年是第十一届。我很荣幸地有3张照片获奖，分别获得了风光组、建筑组、日落组的特别荣誉奖。虽然没有进入前三名，但是我转型做手机摄影仅一年能获得这样的成果，还是非常开心的。  建筑类 荣誉奖  风光类 荣誉奖  日落类 荣誉奖 经常有人来咨询我，说工作太累了，生活太枯燥了，出于各种原因只能做着不喜欢的工作，应该如何平衡工作和生活？自己也有很多兴趣，但是从来没为它做过什么。我认为，兴趣可以成为职业，也可以成为生活的调剂品。有投入才会有产出，投入时间，投入金钱，投入情感。生活就像一辆在路上行驶的车，你就是手握方向盘的司机，想走哪个方向，想在哪里停留，掌控权应该握在你的手中；不能让车失控，把自己活成一个“生活的傀儡”。 感受生活中的点点滴滴，它是你生命的组成部分。给生活一个阳光的笑脸，生活不会辜负用心的人。  5 当你打开这本书时，翻看目录，可以从里面找到你最感兴趣的章节开始阅读，因为每一个知识点都是可以独立阅读的，为的就是能够降低学习门槛，使你能用碎片化时间阅读，即学即用，这样才能快速提升手机摄影的水平。摄影不仅是一门艺术，也是一门技术，技术就需要不断地练习。 附上本书的思维导图，帮你快速找到有价值的信息，也帮你更快地理解何谓摄影，提升摄影思维。   6 在写书的过程中，我也一直在思考：到底摄影能给我们带来什么？职业摄影师可能需要用作品赚钱，需要用作品证明自己，对这些人来说，这就是一份职业。那么对于普通人来说，摄影只是一个兴趣爱好吗？ 我在拍照的过程中，最深刻的感受就是“静心”。当你用全部的注意力观察路边的一棵小草的时候，你会全身心地进入属于自己的世界，忘记烦恼，忘记压力，忘记周围人的眼光。这个时候只属于你自己。所以我想，对于普通人来说，摄影是最好的幸福助推器。 记得今年父亲节的时候，我在抖音上发了一个视频，问大家上次给父亲拍照是什么时候。结果出乎意料，几百个人的留言中，99%的人都在惋惜：父亲已经不在了，遗憾没有给父亲拍一张照片，没有跟父亲合过影。我希望大家看完这本书，能够拿起手机，给你身边最爱的人拍照，留下他生命中的每一个时刻。 我也要感谢一直以来无私支持我的父母、爱人。正是他们对我的信任和鼓励，才让我有足够的信心和动力去尝试不一样的人生。 还要感谢古典、赵星为我的书作序。在我成长的道路上，他们是我的引路人，是我的见证者。最后要感谢为本书提供素材的学员（排名不分先后）：蔡佳琨，焦嫒迪，张营，莫莫，孙慧，谭祥菊，亚亚，欣然，茜茜妈，Ting，大大，白开水，谭小岛，秘博闻，刘韦岩，本真，小潘潘，乐姐。还有那些默默支持我的每一位学员、读者，我的付出能为大家带来收获是我最大的欣慰，感谢你们！",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_005.html"
        },
        {
            "id": 6,
            "title": "第一章 解锁手机拍照的隐藏技能，轻松拍好照片",
            "number": 6,
            "fullNumber": "6",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_006.html"
        },
        {
            "id": 7,
            "title": "手动对焦，才能拍出你想要的照片",
            "number": 1,
            "fullNumber": "6.1",
            "content": "手动对焦，才能拍出你想要的照片 你有没有发现一个问题，你的手机相册里的照片可能有几千张，但是很多照片都很模糊、不清楚？这种情况多数是因为大家拍摄的时候很着急或者很随意，相机还没有对好焦就按了快门。那么，什么是对焦？手机上并没有写出来这个功能，但这却是拍照最重要的一个步骤。  图1.1　iPhone 8 Plus北京 图1.1中人物脸部清晰，周围环境前后景都是虚化的，显得照片中人物非常的突出。  图1.2  图1.3 图1.2中，前边的猫很清晰，后边的比较模糊。图1.3中恰好相反。这就是对焦点位置不同导致的不同效果。拍照的时候要根据自己想表达的主题，来确定画面的焦点在哪，要保证焦点位置清晰。如果使用自动对焦，可能会造成对焦不准，因为手机无法准确地判断你希望哪只猫成为焦点。  图1.4  图1.5  扫码观看视频演示 直白地讲，对焦就是使相机能够清晰成像的过程。在按快门前，先确定想让画面中哪个位置最清晰，这个位置就是照片的焦点。现在的手机都是自动对焦的，但是再智能的手机也没办法完全理解你的想法。或者相机在自动寻找焦点的过程中，还没有确定焦点，你就按了快门。所以，有的时候不经过手动对焦，照片就会出现“跑焦”的问题，拍出来的照片就可能会模糊。 很多人拍照根本没有这个对焦的过程，拿出来就拍。正确的方法其实很简单：拍照的时候，在屏幕上点击你要拍摄的主体的位置，在屏幕上会出现一个黄色的方框（图1.4），这就是焦点，相机就会保证这个位置的画面是最清晰的。 安卓手机也用同样的操作方法，但是有一些安卓手机会有一个功能，就是点击屏幕时会自动拍照。有的时候想点屏幕对焦，但是相机就自动拍摄了。这个功能可以在相机的设置里去选择是否打开（图1.5），个人建议不打开，用起来会更方便。 把对焦放在最开篇来讲，是因为在摄影中，唯一不能舍弃的就是对焦，因为对焦是保证画面清晰度的重要因素。如果主体不清晰，画面模糊，只要不是刻意为之，那这个照片就是失败的。照片光线不好，构图不合理，这些通过后期都可以实现修改，但是清晰度是没办法后期改变的。所以，按快门前，最好先手动对焦。",
            "level": 2,
            "parentId": 6,
            "valid": 0,
            "href": "index_split_007.html"
        },
        {
            "id": 8,
            "title": "掌握基本的曝光原理，降低废片率",
            "number": 2,
            "fullNumber": "6.2",
            "content": "掌握基本的曝光原理，降低废片率 因为手机拍照的便利性，使得我们随时随地都可以拍照。摄影是光影的艺术，没有光，就不会有摄影这种艺术形式的存在。但有的时候，在光线不是很理想的环境中，拍出来的照片也不好看。翻看自己的相册，应该会有很多这种特别亮或者特别暗的照片（图1.6和图1.7），这就是曝光不合理造成的效果。  图1.6  图1.7 图1.6为曝光不足，图1.7为曝光过度。 曝光，通俗地讲就是，一张照片的光线明暗是否合理，有没有太亮或者太暗、看不清细节的情况。 为了直观地理解曝光，可以把镜头想象成一个窗户，第一种是过曝，可以理解为窗户开得太大，进来的光太多了，特别亮，白茫茫一片，看不出细节。第二种情况是欠曝，就是窗户开得太小了，进来的光太少了，太暗了，看不清。所以，我们要做的就是找到合理的曝光，来保证画面明暗适度、细节清晰。  图1.8  图1.9 这三张照片分别为曝光不足、曝光正常和曝光过度的效果。  扫码观看视频演示 拍照的时候，点击屏幕对焦，其实画面的亮度也是有变化的，手机会根据你对焦的位置的敏感程度，自动调整曝光度。如果对焦点的位置太亮，相机会自动降低亮度；如果对焦点太暗，相机会自动提高亮度。但是，智能自动依然没办法完全满足人们的需求，所以现在的手机基本都有手动调节曝光这个功能（图1.8）。比如，苹果手机在拍摄的时候，你点一下屏幕进行对焦，焦点旁边会有一个小太阳标志，你上下滑动就可以调整画面的亮度。向上滑动增加曝光，画面变亮；向下滑动降低曝光，画面变暗。 安卓手机也有同样的功能，不过有的型号是太阳标志，有的是灯泡标志，有的是三角箭头标志。虽然图标不同，但是功能相同。 我们应该掌握的是，在什么时候使用这个功能。如果是在光线特别足、很亮的环境下，多数情况下照片会过曝。在对焦之后，向下滑动图标，降低曝光度，保证画面明暗部分都比较清晰。相反在晚上、室内光线不好的地方，可以适当增加曝光，保证画面的暗部细节也能比较清晰。",
            "level": 2,
            "parentId": 6,
            "valid": 0,
            "href": "index_split_008.html"
        },
        {
            "id": 9,
            "title": "打开辅助线，保证照片画面横平竖直",
            "number": 3,
            "fullNumber": "6.3",
            "content": "打开辅助线，保证照片画面横平竖直 我在上课的过程中，发现一个问题：很多人的照片都拍得歪歪扭扭的，说白了就是没办法做到横平竖直。可能有人会问：照片一定要横平竖直吗？当然不是，但是对于摄影入门者来说，要做的是打好基础，把最基本的原则掌握好，再去发挥自己的创意。而且有的照片一定要拍得横平竖直才能突出它本身的特点，比如气势恢宏的古建筑，比如大型建筑群，或者地平线、海平面之类的。如果拍歪了，效果就大打折扣了。  图1.10 这张建筑的照片，拍得很正才能凸显它的气势。如果歪了，就完全失去建筑本身的特点，也会让人感觉整个照片重心不稳。  图1.11 图1.11是苹果手机的屏幕。我们看屏幕上有几条白色的线，两横两竖，这就是辅助线。这个线在我们拍照的时候可以起到辅助作用，保证画面的稳定。 比如这张图里面的海平面，只有拍正了，才能突出平静的感觉。拍的时候，把海平面和辅助线保持平行状态就能保证照片不会拍歪。而且，辅助线还能辅助拍照构图，这部分内容后面会讲到。  图1.12 虽然安卓手机型号特别多，名字不同，但是大部分手机都会有这个功能。图1.12是小米手机，在设置里它的名字叫【水平仪】，打开之后，屏幕上会有一个方框，如果手机歪了，这个框就会倾斜，提醒你。  图1.13  图1.14 努比亚手机在快门的位置有一个水平仪（图1.13）。如果是水平的，箭头显示绿色，歪了就显示红色，用起来也非常方便。 有些人并不是故意拍歪的，这种情况很常见。因为拍的时候，可能会手抖，或者光线太强，手机屏幕反光，看不清楚，所以很多照片会拍得比较歪。这个其实很好解决。现在的手机都有辅助线的功能，比如苹果的辅助线就是九宫格，它可以帮助我们对准画面；安卓的手机也会有不同的构图辅助线，或者水平辅助线。根据不同手机型号，名字不同。 苹果手机，可以在【设置-相机-网格】里面打开。不用担心这个辅助线出现在照片上，因为它只是屏幕上的辅助线，不会出现在照片上。",
            "level": 2,
            "parentId": 6,
            "valid": 0,
            "href": "index_split_009.html"
        },
        {
            "id": 10,
            "title": "用好景深，让你的照片更抓眼球",
            "number": 4,
            "fullNumber": "6.4",
            "content": "用好景深，让你的照片更抓眼球 很多人拍照片，希望能把背景拍模糊，而人物清晰，因为这样的效果会显得人物更突出。其实在相机里，这是通过光圈大小来实现的景深效果。通俗来讲，就是拍照的时候，镜头里场景清晰的范围。  图1.15　iPhone 8 Plus北京 照片中人物清晰，背后的场景模糊。虽然室内桌椅略显凌乱，但是人物依然很突出。 在相机中，景深是由光圈大小和焦距来控制的，但是手机的镜头是固定的，不同于相机可以手动调整。很多人会问：“手机能拍出来背景虚化的景深效果吗？”答案是肯定的。但是，因为手机镜头没办法变焦，所以景深效果不会有相机那么明显。  图1.16 如果你用的是单摄像头的手机，想把背景拍得模糊一些，可以让主体离背景远一点，或者你离主体近一点，保证相机和主体的距离小于主体和背景的距离。只有距离近的时候，才能拍出背景模糊的效果。  图1.17  图1.18 只要手机离蒲公英（花卉）的距离小于蒲公英（花卉）与背景的距离，就可以拍摄出背景虚化的效果。  扫码观看视频演示 具有双摄像头的手机会自带人像、大光圈的模式，可以直接拍出背景虚化的人像照片。这是通过手机的一种算法，自动识别人物的轮廓，然后把周围的背景加以模糊，模拟出一种背景虚化的效果。从对比图中背景的模糊程度可以看出，分别是单摄像头手机和双摄像头手机拍摄的。  图1.19 这个功能也有很多名字，苹果手机叫人像功能，安卓手机有的叫人像，有的叫大光圈，有的叫景深。名字很多，但只要是双摄像头的手机，都会带这个功能。  图1.20  图1.21 在同一时间、同一场景拍摄两张照片，图1.20为未使用人像功能，图1.21为使用了人像功能，能够看出明显的区别。人物都是清晰的，但是开启人像功能的照片，前后桌椅环境都变得迷糊了，画面更加的聚焦，人物在画面中显得尤为突出。",
            "level": 2,
            "parentId": 6,
            "valid": 0,
            "href": "index_split_010.html"
        },
        {
            "id": 11,
            "title": "打开HDR，逆光也清晰",
            "number": 5,
            "fullNumber": "6.5",
            "content": "打开HDR，逆光也清晰 逆光是很常见的一种场景，如果想拍照，经常会出现过曝或者曝光不足的情况，或者一半亮一半黑的效果。近几年出现的一种摄影处理功能叫HDR，现在的手机基本上都有这个功能，这个功能能够帮我们更好地还原这种逆光现场的场景。  图1.22 使用这个功能，按下快门会自动拍摄三张照片，一张过曝，一张欠曝，一张正常。然后把三张照片自动合成一张照片。这样合成后的照片中，光线不足的地方会自动增加曝光，曝光过度的地方会自动降低曝光，照片的效果会更清晰、准确，避免了画面中因为光线对比强而出现的阴影太暗或者高光部分太亮的情况。  图1.23  图1.24 图1.23为正常拍摄模式，图1.24为开启HDR拍摄效果。仔细观察照片中明暗对比强烈的地方——山的右侧背阴面，以及天空的云层。可以看出，开启HDR后拍摄的照片中，右侧的明暗反差相对较小，而且画面颜色更加鲜艳。 那我们如何选择合适的环境呢？多数是逆光的环境，或者画面中明暗对比很强烈的环境。开启HDR后，可以让天更蓝，草更绿，画面明暗对比更自然。否则，逆光的环境中经常会拍出曝光不合理的照片。但是，如果你想借助逆光拍摄剪影的话，就不要用这种功能了，因为它会把剪影部分的亮度提高。  图1.25  图1.26 HDR功能可以有效地优化大光比效果，让画面的明暗对比更自然，过渡更自然。图中两张分别为普通拍摄（图1.25）和HDR效果拍摄（图1.26）。看天空中云的下边缘，普通拍摄的效果明显过曝，明暗对比强烈，而使用了HDR效果的照片过渡自然。  扫码观看视频演示",
            "level": 2,
            "parentId": 6,
            "valid": 0,
            "href": "index_split_011.html"
        },
        {
            "id": 12,
            "title": "不用App，手机修图就够了",
            "number": 6,
            "fullNumber": "6.6",
            "content": "不用App，手机修图就够了 修图就像化妆一样，不同人有不同的喜好，有人喜欢素颜，有人喜欢轻描淡写，有人喜欢浓妆艳抹。修图其实是摄影中的一部分，合理看待就好，不要做过分改变事实的修图，也不要完全拒绝修图。 很多人以为，修图肯定要靠第三方App才能修出漂亮的大片。但有时候，有的人手机内存不够，没办法下载太多的App，这时想修图该怎么办？其实手机自带的修图功能就已经能够满足你最基本的修图需要了。无论什么手机，在相册中打开照片的时候，都会有一个“编辑”，这就是手机自带的修图功能。  图1.27  图1.28 在相册中打开照片，找到【编辑】，进入修图功能。 如果对于一张照片，只想简单地裁剪大小，调整角度，或者调整颜色饱和度，就可以直接使用自带的修图功能完成。我们以苹果手机为例，分别看一下这些功能能给照片带来什么效果。  图1.29 图1.29中，最左边的功能是裁剪和旋转。如果照片不正，或者想更改比例，可以在这里操作。第二个是滤镜功能，在这里有预设好的不同风格的滤镜，可以根据自己的喜好直接套用滤镜效果，比如复古、黑白等。第三个功能是调整光效色调，可针对照片里的明暗光效、冷暖色调进行后期调整，也可以调整成黑白风格。 安卓手机的功能跟苹果手机类似，并且功能会更丰富一些。  扫码观看视频演示  扫码观看视频演示",
            "level": 2,
            "parentId": 6,
            "valid": 0,
            "href": "index_split_012.html"
        },
        {
            "id": 13,
            "title": "第二章 6种实用构图技巧，学会经营画面",
            "number": 7,
            "fullNumber": "7",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_013.html"
        },
        {
            "id": 14,
            "title": "为什么要学习构图？",
            "number": 1,
            "fullNumber": "7.1",
            "content": "为什么要学习构图？ 你是否遇到过这种情况：照片拍完之后发现，歪歪扭扭，左右不对称，头重脚轻。这样的照片都缺少稳定性，画面的美感会下降。那为什么会出现这种情况？主要原因在于，我们对于画面的构思不够清晰，或者拍照的时候太匆忙，拿起手机就拍，并没有思考清楚画面的布局。 构图的目的就是把画面中的元素很好地利用起来，保证人、景、物出现在合适的位置，构成一个协调完整的画面。 比如，你要画一幅山水画，面对一张白纸，你在下笔之前要知道山画在哪里，水画在哪里，树林、动物画在哪里，人画在哪里。下笔绘画，只是把你的想法呈现出来的一个过程。摄影也是一样，按下快门，呈现你的想法。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_014.html"
        },
        {
            "id": 15,
            "title": "九宫格构图",
            "number": 2,
            "fullNumber": "7.2",
            "content": "九宫格构图  这是最常用、最保险的构图法。意思是把一张照片横向、纵向分为九等份，可以理解为在照片上写一个等比例的“井”字。横线和竖线在画面中形成了四个交叉点。在拍照的时候，结合实际情况，把画面的主体放到四个交叉点中的某一个上，而不是放到九个格子中的某一个里。 我们上学的时候学过的黄金分割定律被称为最完美的比例，那么九宫格就可以理解为简化的黄金分割线。画面中的四个交叉点，就位于这个最佳的比例附近。所以，九宫格也是被用得最多的构图方式。 至于把主体放到哪个交叉点上，要根据主体和周围环境的关系决定，构图的目的是交代完整的环境。我们通过四张照片，分别理解一下主体在不同焦点上的视觉效果。  图2.1 拍摄近距离人像时，人物的面部为画面的焦点，将头部位置放在九宫格左上角焦点上。因为光线是从右侧照射进来的，所以右边留出空间，和百叶窗作为环境；因为拍摄的时候左边是很杂乱的场景，所以避开。  图2.2 照片中人物为主体，放到九宫格右上角焦点上。因为拍摄沙滩要交代清楚环境，所以给沙滩留出空间，把人放到上面的焦点上。至于放到右侧，是因为左侧是大海，依然是为了交代环境。  图2.3 将人物放在下方，是为了更好地展示人物背后的层叠树林。九宫格的作用能够更好地记录人和环境的关系，而且人的脸是朝左的，所以人的正面、视线方向要留出空间。把人放到右下角焦点上，这样画面不至于太压抑。  图2.4 人物的运动趋势是向右前方的，所以将人物放到左侧，右边留出空间交代环境。老人有甩动鱼竿的动作，画面上方需要空间，所以把人物放到左下角的焦点上。这样，既能够记录完整的环境，也能清晰地记录人物的舒展的动作。 九宫格构图比较适合环境的拍摄，比如刚才看的照片，并不是一个单独的主体，而是结合周围的环境才决定主体在哪个焦点上。所以，我们使用九宫格构图的时候，要注意的就是主体和周围环境的融合以及关系。 九宫格是最基本的构图方式，所以它可以应用于几乎所有场合，无论是人像、风景，还是建筑、静物，都非常的适用。如果是新手，对于一般的照片采用九宫格构图，基本都不会出错。 在手机的设置里找到相机，选择网格，或者九宫格，打开即可。  扫码观看视频演示",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_015.html"
        },
        {
            "id": 16,
            "title": "中心构图",
            "number": 3,
            "fullNumber": "7.3",
            "content": "中心构图  从字面上，非常容易理解，就是把主体放在画面的中间。无论横构图还是竖构图，都可以使用。 中心构图的好处就是画面结构简单，容易被人接受。将主体放到中间非常容易被识别，而且能起到聚焦的作用。画面左右均衡，不会出现头重脚轻，或者左右摇摆的情况。 在拍摄的时候，把主体放在画面的正中间，能够特别有效地突出主体。特别是在拍摄人物、静物或者单独个体的场景的时候，会经常使用中心构图。  图2.5  图2.6 最简单的人物构图是，把人放到中心位置。无论周围环境是什么样的，都能够起到很好地突出人物的作用。  图2.7　iPhone 6s Plus 乌鲁木齐 获得2018年全球iPhone摄影大赛建筑类荣誉奖 单独的建筑，结合单独的背景，也是非常适合中心构图的，因为偏左、偏右都会使照片不均衡。 将主体放到画面的中间，是很多人拍摄时常用的构图方法，特别是新手。因为这是最安全、最保险的方式。这种方法虽然会中规中矩、略显平淡，但是，如果能够结合好光线、环境，也能拍摄出非常漂亮的作品。  图2.8  图2.9  图2.10 通过两道墙之间的缝隙，拍摄远处的海边教堂。使用中心构图，把视线聚焦在画面中间。前景的两道墙增加了画面的神秘感和空间感。  图2.11　iPhone 8 Plus 阿那亚",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_016.html"
        },
        {
            "id": 17,
            "title": "三角形构图",
            "number": 4,
            "fullNumber": "7.4",
            "content": "三角形构图  三角形构图又叫金字塔构图，是指图中的主体具备三角形轮廓，或者相关的主要元素可以形成一个三角形。我们上学的时候都学过，最稳定的图形是三角形。所以在照片中应用三角形，会显得照片的结构稳定，画面稳定，不会有头重脚轻或者左右摇摆的情况。三角形可以很好地填充画面，因为人地视觉会主动地寻找具有相关性的元素，形成一个平面。所以能够形成三角形，是最简单的构图。  图2.12　iPhone 8 Plus  图2.13　iPhone 8 Plus 阿那亚  图2.14　iPhone 8 Plus 万象  图2.15　iPhone 6s Plus 喀什 三角形构图历史久远，在没有摄影技术的时候就已经产生了。我们看到，很多名画都采用了这种构图方式，比如达·芬奇的《岩间圣母》（图2.16）。  图2.16 我们平时要多观察，多看好的作品，去学习那些摄影师的拍摄思路。 如果画面中的主体无法构成三角形的话，需要在画面中寻找有相关性的元素，构成三角形，而不是随便找出三个物体就可以的。而且，三个物体之间最好有大小、远近、主次之分，这样的照片才能够更加的聚焦。  图2.17 两朵花和一个相框的摆放位置形成一个三角形，花作为陪衬，相框作为主体。画面中三个物体自然地放在一起，并没有不和谐的元素出现。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_017.html"
        },
        {
            "id": 18,
            "title": "对称构图",
            "number": 5,
            "fullNumber": "7.5",
            "content": "对称构图  对称构图也是一种中规中矩的构图方式。对称包括三种方式：上下对称、左右对称、对角对称。我们看几张图就一目了然了。 对称构图的优势是显得画面均衡、稳定，不会出现左右倾斜的情况，给人一种严肃的宁静感。在拍摄大型建筑物、水面倒影，或者想表达画面稳定性的时候，经常会采用这种方式。  图2.18　iPhone 8 Plus 喀纳斯 但是在拍摄的时候一定要注意一点，就是手机一定要摆正。如果歪了，就出不来效果了，而且这个对称线要在画面的中间。所以，这个时候最好打开手机的九宫格辅助线，也有的手机会带水平线的功能，会帮助你对准地平线，保证画面不歪。  图2.19　iPhone 6s Plus 喀什  图2.20　iPhone 8 Plus 烟台 那么，对称构图就一定要两边完全一样吗？当然不是，很多时候我们无法找到完全对称的场景，但是我们要记住，对称构图的原理是使画面平衡，能够形成视觉上的相对统一。对称构图中，能够保证对称线两侧基本一致即可，因为我们不可能找到完全一致的场景。  图2.21　学员作品 莫莫/摄 小米6 这张照片是通过镜面形成的反射，两面并不一样，但因为是同一个人的镜面效应，人是同一个，动作是同一个，状态也是同一个，所以也可以成为左右对称构图。  扫码观看视频演示 看电影，是一种非常好的学习构图的方法，因为摄影和摄像是相关的，电影可以理解为无数张定格照片连在一起形成的动图。有一部经典的电影叫《布达佩斯大饭店》，导演在这部电影中，把对称构图用到了极致，整个画面的美感度非常高。  图2.22  图2.23  图2.24 图片来自《布达佩斯大饭店》剧照",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_018.html"
        },
        {
            "id": 19,
            "title": "框架式构图",
            "number": 6,
            "fullNumber": "7.6",
            "content": "框架式构图  有的时候，我们拍出来的照片会略显单调，感觉画面中的场景不够丰富，层次感也不强。那么，我们可以尝试利用框架式构图，它是利用物体的天然框架形状形成前景，然后把主体放到框架中，这样能够使主体更加突出，吸引观者的视线，聚焦在框架内的主体上。常用的框架有门、窗、镜子，等等，还有一些天然形成的框架，比如洞穴、树叶之间的缝隙，等等。  图2.25　iPhone 8 Plus 阿那亚 利用建筑的边框和光线自然的过渡，形成一个清晰的框架。利用框架和对面的光线，拍摄人物剪影效果，画面简洁清晰。  图2.26　iPhone 8 Plus 长城 在长城的烽火台上，通过瞭望口拍摄外面荒凉的场景。瞭望口形成天然的框架，仿佛一幅画的画框，不仅能够起到聚焦作用，也能获得很好的代入感，仿佛你正扶着窗口向外张望。 利用框架构图，能够凸显画面的立体感和层次感，从而使画面不至于太死板。这张照片利用了树枝形成的空隙，作为框架。  图2.27　iPhone 8 Plus 北京 利用树枝天然形成的框架，拍摄远处的建筑群。建筑与植物形成反差，它们在城市中互相争夺着空间，而且前后虚实的变化，增加了画面的空间立体感。  图2.28　iPhone 8 Plus 透过运动场的铁丝网拍摄正在打球的小女孩。如果直接拍摄这个场景，会显得平淡，但是把铁丝网作为前景，就起到了很好的聚焦效果，且具有代入感。 在选择框架的时候，一定要先在脑海中想一下，这样构完图是什么效果，然后再拍。好的摄影作品是体现摄影师的思想的，不要不经思考，拿起来就拍。  图2.29　iPhone 8 Plus 利用小镜子，或者其他任何有边框的物体，都可以自己创造一个框架来进行拍摄。  图2.30　学员作品 刘刘卷/摄　iPhone 6s 在地铁中，透过人群的缝隙拍摄，人群也可以形成天然的框架，既显示出环境中人群拥挤的状态，也能很好地突出人物在地铁中局促的坐姿和神态。",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_019.html"
        },
        {
            "id": 20,
            "title": "留白构图",
            "number": 7,
            "fullNumber": "7.7",
            "content": "留白构图  我很喜欢留白这个词，因为留白意味着，你会有空间制造惊喜，创造更多可能。 很多刚开始摄影的人会犯一个错误，就是希望一张照片尽量包含更多的元素。我们知道，摄影是减法，因为即使你的镜头角度再广，也没办法把你看到的所有内容拍进去。所以要抓重点。留白的方式能让照片更好地突出主体，然后通过大面积的留白给观者更多的想象空间。  图2.31　iPhone 6 西雅图  图2.32　iPhone 8 Plus 阿那亚  图2.33　iPhone 8 Plus  图2.34　iPhone 8 Plus 巴色 这张照片以蓝天为背景，一朵花在画面的一侧，整体很空旷，但是并不觉得画面单调，因为在这个花的朝向上留有空白，就有一种向上生长的趋势。如果画面中没有留白，有很多其他元素，就会显得画面拥挤。 使用留白的构图方法，在拍摄的时候要注意画面的简洁性，主体之外，尽量少地保留其他元素，而且主体所在的位置一般比较靠近画面的边缘，或者采用其他构图方式，比如九宫格构图、中心构图，等等。 其实，无论用什么样的构图方式，我们都要记住一点，就是让画面中的主体更突出，焦点更清晰，让别人一眼就能看出你拍的是什么，你想表达的是什么。不要被各种构图规则、条条框框限制住，要灵活运用。有时候一张照片中可以同时存在几种构图方式，并不是一张照片只有一种构图。摄影是一个艺术创作的过程，需要融入你的想法，表达你的观点。  图2.35　iPhone 8 Plus 洛阳",
            "level": 2,
            "parentId": 13,
            "valid": 0,
            "href": "index_split_020.html"
        },
        {
            "id": 21,
            "title": "第三章 常见的4种光线，利用光影拍出有氛围的照片",
            "number": 8,
            "fullNumber": "8",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_021.html"
        },
        {
            "id": 22,
            "title": "不能控制光，我们就要学会利用它",
            "number": 1,
            "fullNumber": "8.1",
            "content": "不能控制光，我们就要学会利用它 大家大都不是专业从事摄影的人，所以也没有专业的灯光设备和拍摄环境，多数时候要利用自然光或者环境光进行拍摄。我们没办法控制光线，既然光这么重要，我们要学会如何利用它。 先看示意图3.1。 常见的光线一般会有4个方向：顺光、逆光、侧光、顶光。 比如，图中手机代表你，你是拍摄者，太阳代表光源，树代表拍摄主体。 【顺光】是指光线在你的背后照射过来，拍摄主体的正面被照亮，影子在拍摄主体后边。 【逆光】则刚好相反，光源在你的对面，拍摄主体的背面被照亮，正面是黑的，影子在拍摄主体前边。 【侧光】是指光线从你和拍摄主体侧面照射过来，或左或右，拍摄主体在光源的一侧是亮的，影子在另一侧。 【顶光】是指光源在你和拍摄主体的上方，光线从头顶照射下来，影子在脚下。 其实，判断光源最简单的方法就是通过影子的位置来进行，因为不同的角度，给照片带来的效果是完全不同的。  图3.1  扫码观看视频演示",
            "level": 2,
            "parentId": 21,
            "valid": 0,
            "href": "index_split_022.html"
        },
        {
            "id": 23,
            "title": "不同的光能给照片带来什么效果？",
            "number": 2,
            "fullNumber": "8.2",
            "content": "不同的光能给照片带来什么效果？ 通过照片来直观地了解一下不同光影的效果及其优势和劣势。 最适合手机拍照的顺光  图3.2  图3.3　iPhone 8 Plus 北京 拍摄这张照片（图3.3）的时候，大概是上午10点多。夏天的阳光比较足，所以画面很亮、很清晰。刚才讲过了，可以通过影子的位置来判断光的方向，这张照片中，人的影子是看不到的，因为在人的后边。可以判断光源位于人物的正面，这就是顺光。 顺光拍摄是最常见的一种光线效果。对于新手来说，很多人会选择顺光拍摄，因为拍出来的主体会很清楚。顺光的优点就是光照面比较大，光线充足，显得非常的清晰，色泽鲜艳，能很好地表现主体，抓住读者的眼球。特别是手机拍摄的时候，光的亮度是保证画面清晰度的一个重要因素，所以用手机拍照片，采用顺光的角度拍，能保证清晰的画质。 不过顺光的缺点也很明显：它能把物体正面全部照亮，但是没有了明暗对比，就会缺少细节，缺乏立体感，感觉很平淡。所以，顺光也叫平面光。这张照片就是用顺光拍摄的场景，整个建筑显得比较平淡。  图3.4　iPhone 8 Plus 喀什 手机真的拍不好逆光吗？  图3.5 手机不同于相机，它对于强烈光比的场景，有时候会处理得不尽人意，特别是逆光场景。现在大家的生活都离不开旅行，比如我们去草原，去海边，去爬山，都会喜欢拍日出日落。这种环境都是逆光场景，如果拍不好，就会曝光不足或者曝光过度。 这种环境下，拍摄剪影是一个明智的选择。  图3.6　iPhone 6s Plus 布尔津 这张照片是在新疆的一个路边拍摄的，是一个普通的水塘，但是我却看到了最美的夕阳。照片中，背后是很漂亮的夕阳，地平线上有一道暖光，画面中冷暖两色对比，非常的有层次感。但是镜头前的人是全黑的剪影，我们无法看到人的表情和神态，只能看到人物的轮廓。这就是逆光的优势，它能够很好地刻画主体的轮廓，无论是人，还是其他的物体，比如树木、花卉、建筑，等等。  图3.7 当我们用手机拍摄逆光剪影的时候，一定要注意一点：对焦的时候要点击屏幕中人的位置，确保主体清晰。但是因为手机都是自动曝光，人的位置比较暗，所以它会自动增加画面的曝光度。这个时候，人就不是剪影效果了，那么就需要我们手动调整曝光，降低曝光度，来保证拍出来的是剪影的效果。而且，拍摄剪影一定要注意物体的轮廓、人物的姿态。轮廓要清晰，辨识度要高一些。  图3.8  图3.9 图3.8是夕阳中海边的两个女孩，但是因为人物姿态不够舒展，所以人物剪影的效果不够好，没有什么轮廓感。图3.9是拍摄于深圳机场，逆光环境拍摄人走过的一瞬间人物的肢体动作分离度比较清晰，容易刻画人物动作。  图3.10　iPhone 8 Plus 北京 这种逆光场景，人物离镜头很远的情况下，一定要做出一些可区分的肢体动作。比如这对情侣，女孩侧身，一条腿弯曲，伸出手牵住男孩的手。虽然男孩的姿势比较单一，但是两个人的动作放在一起，就能好地体现人物的轮廓和姿态。 曾经有位学员跟我说：“老师，为什么我拍的剪影显得特别乱？”我看了照片后告诉他，因为你的照片区分不出主次，所有的物体在逆光下都变成了剪影，重叠交叉之后，就使得画面整体都变成了黑色的剪影。  图3.11 混乱的环境、人物、树木，所有的剪影重叠，无法分辨出主体。 拍摄剪影最好选择背景干净的场景，比如天空、纯色的墙，等等。因为逆光环境下，镜头里所有物体都变成了剪影，前后重叠，就没办法区分主次，也看不出来要表达的是什么。  扫码观看视频演示 利用侧光增加画面的立体感  图3.12 我们前面讲过很多次“立体感”，因为照片是一个二维平面，所以我们需要用一些方法技巧，使画面呈现出立体感，突破二维平面空间。那么，侧光就是拍摄时用得最多的一种光线，特点是能够在主体上形成明显的明暗对比。跟顺光相比，它的立体感就会很强。如果你学过素描，应该很容易理解。看足球的两个素描。  图3.13 左图是一个平面的二维图像，你可以理解为这是顺光拍摄的效果，没有明暗对比，缺乏立体感。右侧这个是侧光拍摄的足球，光线从右上角照射过来，画面中有清晰的明暗对比、明暗分界线、阴影、反光。同样是一个足球，这张照片就显得非常的立体。  图3.14 我外出拍摄人像，一般都会安排在早上，因为日出日落前，光线比较柔和，角度也很低。这个照片就是在早上拍摄的，在人物的脸部会有明显的阴影，也有比较柔和的明暗过渡，显得人很立体，不死板。手机拍摄对焦的时候，点击屏幕上脸部比较亮的位置，适当调整曝光，以保证画面不要过曝。  图3.15  图3.16 如果室外光线太强，手机拍出来的效果会显得不自然，在脸上明暗过渡的地方会比较生硬。所以，也可以在室内寻找侧光的场景，比如，窗边就是一个理想的环境，光会相对柔和一些，而且依然能保持明暗对比的立体效果。  图3.17 在摄影中有一个原则叫【黄金一小时】，就是日出后一小时和日落前一小时。这两个时间段的光线偏暖色调，而且不是非常的刺眼，角度也很低，所以很适合拍照。无论是拍人，拍风光，拍建筑，都会显得非常的立体，明暗对比清晰。  图3.18　iPhone6s Plus 禾木村  图3.19　iPhone 8 Plus 北京  图3.20　iPhone 8 Plus 天津 顶光效果不好，还是你不会用？  图3.21 什么是顶光呢？就是中午的太阳光、屋里天花板上的灯光，这种从上方照射下来的光都是顶光。  图3.22 这张照片中，人物在光下，人的头发、眉骨、鼻子在脸上留下了很杂乱的阴影，显得画面不干净、很凌乱。而且，如果光很强的话，拍出来的效果就有点恐怖。  图3.23 如果在顶光环境下，人戴了帽子，那整张脸就都被笼罩在阴影中，没办法很好地展现人物的表情、神态。所以，不建议在这种光线条件下拍摄。 但头顶光真的就一无是处吗？我们不能改变环境，但是可以改变自己的思维。一定要挖掘它们的特点，为我们所用。比如顶光拍人像的时候，可以做一些抬头、遮挡阳光或者其他的动作。  图3.24  图3.25  图3.26 拍摄建筑、风光也是同样的道理。顶光环境下，物体基本上是看不到影子的，也看不到明显的明暗对比。要突出主体的立体感，明暗对比是很重要的因素。建筑像人那样可以做不同的动作，所以拍摄风光、建筑时，还是尽量避开这个种光线。如果出去旅游，尽量“起早，贪黑”，利用低角度的光线拍摄，而不要选择烈日当头的时间出去拍照。  图3.27　iPhone 8 Plus 天津  图3.28　iPhone 8 Plus 天津 左侧的这张建筑照片，光线在上方，所以镜头中的建筑正面没有明显的明暗对比，立体感就不足。而右侧这一张，光线角度比较低，从侧面照射过来，属于侧光，所以建筑有明显的明暗对比，立体感非常强烈。",
            "level": 2,
            "parentId": 21,
            "valid": 1,
            "href": "index_split_023.html"
        },
        {
            "id": 24,
            "title": "如何用手机捕捉有趣的光影？",
            "number": 3,
            "fullNumber": "8.3",
            "content": "如何用手机捕捉有趣的光影？ 大家来学手机摄影主要是为了培养兴趣，提升生活幸福度，绝大多数人并不是想成为摄影师。我们拍摄的场景也都是平常生活中的场景，素材也都来自于生活中。经常有学员问我：“老师，我不知道该拍些什么，怎么办？”我一般会回答：“任何一个你习以为常的场景都不要放过。”比如在我们生活、工作的环境中，大家可能很少会停下脚步去仔细观察，因为觉得这个太普通了，太平常了，这有什么可拍的呢？但往往好的照片，就来自这些看似平凡、不起眼的地方。 不放过有光影的地方 在生活中只要有光，就会有影，这种场景随处可见。我们要做的就是放慢脚步，留心观察，不放过任何一个有光影的地方。  图3.29 这是在一个很普通的小店吃午饭的时候拍摄的。阳光透过窗子照射到桌子上，画面左上角部分光线被墙挡住，阴影很明显。我想突出煎蛋，但是只有半边的阴影效果不好，于是我就用手遮挡了一下光线，创造出了右下角这个阴影效果，这样就能出现一道光的缝隙，主体是煎蛋，刚好在缝隙中，显得特别的突出。而且光线刚好形成了一个对角线构图。  图3.30  图3.31 用手机拍摄的一个好处就是——便利，在路上随时可以拿出来拍照片。这两张照片拍摄时间都是下午的五六点，光线角度比较低，所以人物能在地上形成很长的身影。  图3.32 拍摄场景是最普通的街头，我拿着手机在路边“守株待兔”。把镜头对准地面，长按屏幕锁定对焦，防止人走过去的时候焦点发生变化，耽误拍摄时机。等着人走过去，按住快门连拍。光影效果很适合黑白照片，所以手机的优势就是可以直接使用黑白滤镜进行拍摄。  扫码观看视频演示  图3.33　iPhone 8 Plus 北京 太阳落山前的一刻，时间转瞬即逝。在这里等人经过，人在地面上形成了长长的影子，与人和环境自然融合。暖色的环境，强调了画面的故事性。 错位光影增加趣味性 我经常会跟学员说一句话：“摄影不仅要把照片拍得好看，还要拍得好玩。”因为照片有趣味性，才能让人印象深刻。  图3.34　学员作品 蔡佳琨/摄 iPhone X 这是我的一个学员拍摄的作品，名字叫【光影恋人】。她利用光在地面投下的影子拍了一个虚拟恋人的场景。第一眼看这个照片时，感觉没什么，很普通，但仔细看，影子中两个人手拉手。而真实的男孩手里却是空的，并没有牵着另一个人。这就是通过错位技巧和光影拍的一个照片。现实和影子形成了一种戏剧性的反差对比，画面的故事性才会更强。  图3.35　学员作品 邓红英/摄 iPhone 6 Plus 一个普通的街拍作品。男孩的影子，仿佛是一个同行的伙伴，一前一后，相伴而行。通过合理的角度，使人和影子互不干扰，画面非常的和谐自然。  图3.36　学员作品 樱花仔/摄 iPhone 6 利用逆光拍摄三个跳舞的人，每个人在不同的位置，互不干扰。虽然是剪影，但是通过大小的对比，能够感受到明显的层次。舒展的肢体动作，让剪影人物的轮廓清晰可见。",
            "level": 2,
            "parentId": 21,
            "valid": 1,
            "href": "index_split_024.html"
        },
        {
            "id": 25,
            "title": "你真的会用手机闪光灯吗？",
            "number": 4,
            "fullNumber": "8.4",
            "content": "你真的会用手机闪光灯吗？ 说到光影，可能很多人会问：手机的闪光灯算什么光？其实，闪光灯因为和镜头是同一个方向，所以算作顺光。但是不知道大家是否发现，借助手机的闪光灯拍出来的照片，其实效果并不好，感觉很生硬，不柔和，而且，如果拍人的话，很容易出现“红眼”。所以很多时候，我们都不大使用手机自带的闪光灯进行补光。 那么，如果拍摄环境光线效果比较差，只能用闪光灯来补光的话，要如何用，才能发挥出它的效果呢？这里分享一个最简单的方法。  图3.37 图3.37通过闪光灯正面补光，拍出来的效果明暗对比特别强烈，反光的地方过渡不自然，很生硬，照片的效果不是很理想。因为手机的闪光灯功能比较单一，没办法调整角度和亮度。那么，我们可以通过调整手机的距离来调整光线的强弱。  图3.38 图3.38拍摄的时候，手机离主体的距离是刚才的2倍。拍摄的时候，放大画面，这个时候再使用闪光灯。因为离得远，所有光线就会显得柔和很多，画面明暗对比没有那么强烈，物体上的反光点也不会特别明显。  扫码观看视频演示",
            "level": 2,
            "parentId": 21,
            "valid": 0,
            "href": "index_split_025.html"
        },
        {
            "id": 26,
            "title": "第四章 改变拍摄视角，让你看到全新的一面",
            "number": 9,
            "fullNumber": "9",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_026.html"
        },
        {
            "id": 27,
            "title": "最自然的角度——水平视角",
            "number": 1,
            "fullNumber": "9.1",
            "content": "最自然的角度——水平视角  水平视角可以理解为成人视角，拍摄者和拍摄主体保持水平角度。这种角度拍摄的优点是：画面显得比较端庄、庄重，比较正面、严肃，多数会采用对称构图或者中心构图。这样的照片会显得比较真实，因为跟人的视线保持同一水平线，会有比较强的代入感，符合人们正常观察的角度。不过用水平视角拍摄，会显得有点中规中矩，画面的多样性差，显得有些直白。  图4.3  图4.4 人像摄影，很多会采用水平视角拍摄，比如半身照、形象照、证件照，能够很好地展示人的正面形象，表情、神态会传递得更加清晰，仿佛这个人就在你面前一样。它更强调人物本身的特点。 有很多人学习摄影的目的是给孩子拍照，但是大部分人手机里的孩子照片都被拍成了“大头娃娃”。父母给孩子拍照的时候，都比较懒，拿出手机就拍。因为身高的差距，基本都是从上往下的俯拍。这种角度拍出来的孩子，要不就是只能拍到头顶，拍不到表情，要不就是孩子永远是仰头张望的呆萌表情。而且，因为透视原理，会显得头大身子短，所以成了大头娃娃。 因此，拍孩子的时候，最简单的一个办法就是蹲下来。我们要把孩子当作成人来对待，或者把自己当成孩子，用跟孩子同样的视角拍摄，这样才能拍出孩子更多的表情、神态和动作，你才能看到他们的世界，画面才会更有吸引力。  图4.5  图4.6 前面提到了，水平视角可以理解为成人视角。如果是拍孩子的话，就把它理解为孩子视角，目的都是拍摄更丰富的信息。 除了拍人，拍摄风光、建筑这些大场景时使用水平视角，配合对称构图，能够很好地展现大环境的特点，包含的场景元素比较丰富。  图4.7  图4.8 这张照片是一个教堂的正门，因为门比较高，站在门前拍摄的时候，人没办法保持水平拍摄，拍出来的门就会因为透视原理，有一定的倾斜角度。这就是图4.7的效果，没办法很好地展现端庄严肃的效果。但是图4.8中，整个建筑非常的正，不会有透视倾斜，效果看起来更端庄。 至于这个场景，我们就可以离远点，或者找一个高点的地方，保持水平角度拍摄，这样拍出来的效果会比较端正，符合这个场景中要传达的画面特点。如果实在找不到合适的拍摄机位，可以通过后期修图来实现。这在后面的章节会讲到。  图4.9　iPhone 6s Plus 北京 这张照片的拍摄点是望京SOHO对面15层高的楼道里，拍摄角度几乎是水平的，所以能够很好地展现整个楼群的外观。  图4.10 这张照片是在禾木村旁边的观景台拍摄的，因为要拍摄的是日出时，晨光照亮山谷的场景，需要记录的元素有村庄、山脉、树林和天空的云层，场景比较大，所以在这个位置采用水平角度拍摄。这样，能够比较完整地记录整个场景。",
            "level": 2,
            "parentId": 26,
            "valid": 1,
            "href": "index_split_027.html"
        },
        {
            "id": 28,
            "title": "拍出高大感——低角度“蚂蚁”视角",
            "number": 2,
            "fullNumber": "9.2",
            "content": "拍出高大感——低角度“蚂蚁”视角 我们经常会看到，很多女孩吐槽男朋友不会拍照，把1.6米的自己拍成了1.2米的小矬子，把修长的腿拍成了短粗的腿。其实，这并不能怪男朋友不会拍，只能怪男朋友太懒。跟前面提到的拍孩子同样的道理，都是因为身高的差距，造成这种俯拍视角。 很多女孩吐槽，男友给自己拍的照片都是头大腿短。一般来说，男女身高有差距。如果拿出手机就拍，拍摄者自己比较舒服，但是拍出来的效果就会不理想。这种角度也被称为“男朋友视角”。虽然这是一个玩笑，但却是非常普遍的现象。 想拍出身材高挑的女友，应该用什么角度呢？水平视角是一种方法，但是以这种角度，1.5米拍出来就是1.5米，没办法在视觉上产生身材高挑的效果。摄影是视觉艺术，虽然照片不能把你真实的身高、体重改变，但是从视觉效果上是可以实现的，这个时候就要用到低角度仰拍了。  图4.11  图4.12 方法很简单，拍成人的时候，其实不管男女，都可以蹲下来拍，将手机放在人的腰部，或者膝盖的高度仰拍，效果立竿见影。利用的依然是透视原理。从这个角度拍摄，腿部会离镜头比较近，会显得比较长，头部和躯干离镜头比较远，会显得比较小，这样就能轻松拍出大长腿了。通过一组对比图就可以一目了然。 东方人的身材比例不像欧美人，我们的身材多数是上下肢五五分的比例，或者腿更短一点，所以用这种角度仰拍会比较合适。 用手机拍摄还有一个优势：手机镜头不像相机那样可以变焦，手机镜头是固定焦距的定焦镜头，而定焦镜头的边缘会有天然的“拉伸畸变”。就是说，手机拍出来的照片边缘，其实是有点被拉伸效果的。那么，我们利用这个特点拍人的时候，让人的脚踩在画面的下边缘处，利用拉伸畸变，也会让腿显得更修长一点。  图4.13  图4.14  扫码观看视频演示 如果要拍摄自然场景或者建筑，想突出气势雄伟的效果，也可以使用仰拍，比如面对有特点的建筑、雕塑，或者气势磅礴的大树、山峰等素材时。 采用仰望的视角，通过高低大小的对比，能够突出拍摄主体的高大感、压迫感。在高楼林立的都市，比较适合采用这种仰拍的角度。  图4.15  图4.16 这两张照片分别拍自北京的国贸CBD（图4.15）和日本东京的银座（图4.16）。站在楼的缝隙中，以仰视低角度拍摄建筑的压迫感，上边露出一线天，不仅能拍出城市生活的压力，也能很好地展现在城市打拼的人们的一种状态，即希望与压力共存。一张照片不仅仅是一个场景的记录，好的摄影作品还能展现照片背后的一种情绪——可以是摄影师的情绪，也可以是拍摄对象的情绪。  图4.17  图4.18　iPhone 8 Plus 北京 这张照片拍摄于北京颐和园。这种古建筑会有很多有特点的细节，拍摄的时候刚好玉兰花开，配合造型精美的飞檐，使用低角度仰拍来记录这个场景。花作为前景点缀，不仅增加了画面的空间感，遮挡了单调的天空，也交代了拍摄时间。屋顶是画面的主体，低角度拍摄能很好地突出建筑的时代特点。  图4.19  图4.20 名胜古迹，永远不缺的就是游客，所以用仰拍，能够很好地避开游客，让照片显得更干净。这张拍摄于宏村，左侧（图4.19）游客塞满了街道，拍不出任何的美感和建筑特色。但只需要把镜头抬高（图4.20），拍摄建筑的上半部分，使用仰拍的角度，就可以避开人群，也可以很好地展现建筑的特点。 低角度还有很多适合的应用场景，低角度拍出来的照片会非常有视觉冲击力，因为低角度不同于我们正常的视角，所以画面会很新颖，这样拍出来的照片会与众不同。 比如，想要拍摄地面上比较小的物体，可以把手机放到地面上拍。但是有一点想要强调，就是手机要反过来用，让镜头尽量离地面近一点。  图4.21　iPhone 8 Plus 北京 这个地面上的落叶，想要拍摄它的时候，如果从上往下拍摄，只能拍到叶子和地面，会比较单调，也没有空间感。那么，用低角度拍摄，不仅仅能拍出叶子的立体感，还能记录周围的场景，整体画面的空间氛围会比较好。之前提到了照片是二维平面图像，如果想突出空间立体感，就需要调整一下角度，通过一些对比来实现。  图4.22  图4.23 沙滩拍摄的贝壳，因为体积比较小，如果想拍摄贝壳所在的场景，想把海浪沙滩都拍进来的话，只能采用低角度的拍摄方法，所以镜头贴近地面，对焦点在贝壳上，就能够拍摄出完整的场景了。拍摄蚂蚁这种小的生物也可以使用低角度。  扫码观看视频演示",
            "level": 2,
            "parentId": 26,
            "valid": 1,
            "href": "index_split_028.html"
        },
        {
            "id": 29,
            "title": "俯瞰全局——高角度“上帝”视角",
            "number": 3,
            "fullNumber": "9.3",
            "content": "俯瞰全局——高角度“上帝”视角 高角度俯拍与低角度仰拍刚好相反，这个也是刚才提到的“男友视角”。虽然以这种角度拍摄人物，会显得人很矮，但是不代表这个角度就拍不出好照片，因为不同的角度要对应不同的场景。  比如自拍的时候，用得最多的就是从斜上方45度进行俯拍，这也被称为“万金油角度”。想拍瘦，想脸小，想拍出尖下巴，基本都是采用俯视自拍。利用的依然为透视原理。当把手机举过头顶拍摄的时候，眼睛会向上看，而且离镜头比较近，下巴离镜头比较远，产生的效果就会是，眼睛比较大，下巴比较小，脸也比较小。这种自拍，基本上镜头里只能包含头部和肩部，所以不涉及身材高矮的问题，用俯拍是没问题的。  图4.24  图4.25 而且俯拍的时候，不管是自拍还是给别人拍，要记住是斜上方而不是正上方。因为斜上方拍摄，能拍到半张脸或者四分之三张脸，这样会显得脸比较小。如果是正上方拍摄的话，容易拍出抬头纹，姿态不好看。在拍摄的时候，可以通过一些前景作衬托，比如树叶，增加场景的层次感，使画面不至于太单调。 在拍摄风光照的时候，高角度俯拍能够拍出更广的场景，记录地面更多的信息。如果场景中有人，那么场景大，人物小，通过大小的对比，即可营造一种人很渺小的感觉。  图4.26　iPhone 6s Plus 香港  图4.27　iPhone 8 Plus 万象 有很多人喜欢拍美食，其实俯拍也是拍美食最常用的角度。用得比较多的是45度和90度俯拍。 这种角度能够记录桌面上的更多信息。拍美食，多数时候并不会拍摄单一的食物，那样会略显单调，所以采用45度俯拍，能够更好地展示拍摄场景，而且食物有主次之分，有立体感，能够增加画面的丰富度。如果食材本身的立体感不是很强的话，也可以用90度垂直俯拍，因为这个角度能展示画面的丰富度，但是展示不出立体感。所以，要根据食材来决定拍摄角度。  图4.28　学员作品 焦嫒迪/摄 vivo Xplay 6 用90度垂直角度拍摄，可以记录桌面上更丰富的信息。  图4.29  图4.30　学员作品 一口锅/摄 vivo Xplay 6  图4.31　学员作品 金涯杰/摄 华为荣耀V8 以斜上45度俯拍，不仅可以记录丰富的桌面信息，也可以拍出食物的立体感。",
            "level": 2,
            "parentId": 26,
            "valid": 0,
            "href": "index_split_029.html"
        },
        {
            "id": 30,
            "title": "打破现实规律的“旋转角度”",
            "number": 4,
            "fullNumber": "9.4",
            "content": "打破现实规律的“旋转角度” 在摄影中，有的时候不仅仅是考验技术，还需要考验创意。旋转角度，就是一种有趣的拍摄方法。只需要把拍完的照片旋转90度或者180度，就可以带来意想不到的神奇效果。  图4.32  图4.33 这两张照片，第一眼给人的感觉就是一种不可思议的效果，因为它突破常规思维，真实的场景并不能达到这样的效果。但是，如果你仔细观察，就能发现其中的奥秘。你只要尝试把照片旋转一个角度再观看，就知道是如何拍摄的了。 我们来揭开答案。  图4.34  图4.35  图4.36 从左至右依次为：拍摄场地vs实际拍摄效果vs最终效果 这张照片给人的感觉是人在悬崖上，低头看看悬崖下的深渊，让人看了心情紧张，为他捏一把汗。但是看另一张照片就是真实的拍摄场景。只要找一个简单点的环境，然后需要有一个台阶，这个时候就考验拍摄对象的表演力了。要做出站在悬崖上非常紧张的动作和神情。在拍摄的时候，尽量只拍地面，不要把周围的环境拍进去，以防穿帮。拍完之后，把照片旋转90度就可以了。  图4.37  图4.38  图4.39 从左至右依次为：拍摄场地vs实际拍摄效果vs最终效果 这张照片依然是给人一种即将掉下悬崖的紧张氛围，拍摄方法依然是找一个有台阶的地方，单手抓住，另一只手张开，或者做一个伸手抓够的动作，然后双脚也要向后翘起来，再配合上夸张的表情，这张照片就成功了。但是，依然要注意周围的场景不要拍进来，比如植物、路人、建筑、车辆，等等，尽量保证画面的逼真度。拍完之后，把照片旋转180度即可。  扫码观看视频演示  图4.40  图4.41 从左至右依次为：最终效果vs实际拍摄效果 图4.40的感觉是在悬崖上向上攀登，但实际这是一个平的地面（图4.41）。重要的是，要做出用力攀登的动作，而且拍摄的时候，不要把周围容易穿帮的元素拍进来。  图4.42  图4.43  图4.44 从左至右依次为：拍摄场地vs实际拍摄效果vs最终效果 在一个地下通道的入口，躺在楼梯上，拍摄一个超人飞行的动作，然后将照片旋转180度，周围做出径向模糊的效果，模拟飞行。  图4.45　学员作品 亚亚/摄 红米 Note 4  图4.46　学员作品 谭祥菊/摄 iPhone 7 Plus 学员实践作品，左图为最终效果，右图为拍摄场景。 拍摄旋转角度的照片需要的技巧并不多，它更加依赖于摄影师前期的创意和构思。一个摄影师在拍照之前，脑子里需要有一个成型的照片的样子，拍摄只是实现你想法的一个过程，而不是在拍摄的过程中，边想边拍。 可能很多人说，我刚开始学习摄影并没有什么想法，经常是看到什么拍什么。这个没关系，学习任何东西都需要一个过程。刚开始学习摄影，没有想法很正常。我们可以多看别人的好作品，看自己喜欢的作品。看得多了，才会有更多的想法。而且前期可以从模仿开始，模仿自己喜欢的作品的拍摄方法、拍摄思路。就像学绘画一样，很多都是从临摹开始的。当你有了一定的积累之后，就会慢慢形成自己的想法和拍摄风格。",
            "level": 2,
            "parentId": 26,
            "valid": 1,
            "href": "index_split_030.html"
        },
        {
            "id": 31,
            "title": "第五章 4种普通场景，换个思路就能拍出大片",
            "number": 10,
            "fullNumber": "10",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_031.html"
        },
        {
            "id": 32,
            "title": "雨天，一个发现惊喜的时刻",
            "number": 1,
            "fullNumber": "10.1",
            "content": "雨天，一个发现惊喜的时刻 大部分人对下雨的第一反应就是往屋里跑，但是摄影师的第一反应是往外面跑。因为别人忽视的；正是摄影师所关注的。 倒影 我们学习过对称构图。雨天的时候有一个场景，非常适合拍摄对称构图，那就是有积水的地方。而且使用手机拍摄，要比相机方便多。找到一个周围开阔，或者有特殊建筑、特别景致的地方。如果地面有积水，就把手机翻过来，让镜头尽可能地贴近水面，然后采用对称构图进行拍摄。  图5.1  图5.2  图5.3 这张照片是在雨后路边一个小水坑拍摄的。这是把手机倒放在水面上拍摄的效果，因为倒放能让镜头最大限度地接近水面，拍出来的对称效果才会更好，这也是手机摄影的一个优势。积水面积不用太大，只要比手机镜头覆盖范围大一点就可以了。  扫码观看视频演示  图5.4  图5.5  图5.6 雨滴 雨滴往往能营造出一些朦胧、唯美的画面，而且，如果利用一些道具，就能够通过虚实的对比，增加画面的层次感及空间感。  图5.7  图5.8  图5.9 一把透明雨伞是雨天拍照的必备良品。不被雨淋的同时，能够通过雨伞拍出朦胧的画面质感。而且单手打伞，单手操作手机，非常的便利。不像单反那样，很难单手操作。  图5.10  图5.11  图5.12 雨中晶莹剔透的雨滴悬挂在树叶上的时候，抓拍下来，就是一个唯美的场景。手机可以近距离拍摄特写，双镜头手机可以尝试使用人像，或者用大光圈模式来创造景深效果，让画面更加聚焦。对焦后，适当地降低曝光度，保证雨滴的位置不会因为反光而过曝。也可以使用辅助的微距镜头来进行更多细节的拍摄。  扫码观看视频演示 虚幻 通过水面拍摄倒影，会有一种虚实朦胧的梦幻效果。如果选择合适的角度，可以拍出穿越时空的错觉。操作方法很简单，只拍摄水面倒影，或者拍出现实物体的一部分，主体通过水面倒影展示出来。拍完后，可以进行180度旋转。  图5.13  图5.14 用手机对准水面，可以随时调整角度，保证画面中内容的丰富度，包括人、建筑和天空的云。  扫码观看视频演示 这种场景最好选择天空作为背景，因为如果倒影中素材太杂乱，会造成主体不够明确。很多时候，倒影类似于剪影，所以动作可以适当地舒展一些，以便区分人的轮廓。  图5.15　iPhone 8 Plus 北京  图5.16　iPhone 8 Plus 北京  图5.17  图5.18 一张非常普通的街边随手拍，利用水面倒影的特性，通过后期裁剪、旋转、调色，变成了一张艺术感很强的照片。",
            "level": 2,
            "parentId": 31,
            "valid": 1,
            "href": "index_split_032.html"
        },
        {
            "id": 33,
            "title": "镜面反射，拍出奇妙空间",
            "number": 2,
            "fullNumber": "10.2",
            "content": "镜面反射，拍出奇妙空间 现代化的城市里，最不缺的就是玻璃。生活中到处都能看到玻璃制品，大到高楼大厦的玻璃幕墙，小到手机的玻璃屏幕。其实，利用玻璃的反射原理，也可以拍出有趣的照片；利用的方法和水面是一样的。  图5.19  图5.20 在夕阳西下的时候，利用路边的玻璃隔断进行拍摄。为了保证画面左右完全对称，一定要把手机镜头贴近玻璃，否则效果会打折。  扫码观看视频演示  图5.21　iPhone 8 Plus 北京 将手机贴近玻璃，拍摄人们下地铁的场景。依然利用对称构图拍摄，可以在有限的空间内拍出更大的场景。  图5.22　学员作品 莫莫/摄 通过路边的一块玻璃拍摄了一个老人走过的瞬间。这幅作品的名字叫《或喜或悲》。左侧为玻璃中的映像，老人捂着脸，仿佛在哭泣；右侧为真实的现场，这个角度能够拍到更多的表情，老人仿佛在害羞地笑。所以，通过镜子的特点，可以拍出更有故事性、更有想象空间的照片。  图5.23　iPhone 6 北京 如果你有两个手机，或者使用身边人的手机，依然可以通过屏幕的反射效果来拍摄具有同样效果的照片。  扫码观看视频演示  图5.24  图5.25 出门随时带一个女士用的化妆小镜子，利用镜子的框架，拍摄框架式构图的照片，让画面更加聚焦，既能突出主体，也能增加画面的趣味性。 摄影不要被各种条条框框局限制思维。我们学习的是原理，是思路。至于如何实现你的想法，手机摄影更强调随时随地、自由方便。所以要学会就地取材，发挥创意。",
            "level": 2,
            "parentId": 31,
            "valid": 0,
            "href": "index_split_033.html"
        },
        {
            "id": 34,
            "title": "条件有限，手机如何拍夜景",
            "number": 3,
            "fullNumber": "10.3",
            "content": "条件有限，手机如何拍夜景 前面提到过，能否拍出好照片，不是取决于手机的分辨率有多高，而是由手机内部的感光元件的大小决定的。手机由于体积和功能的限制，感光元件的大小无法和相机相比，所以它对于光的敏感程度就没有那么高。我们经常会遇到的一个问题就是，手机拍的夜景照片多数都会模糊或者光效很差。 随着技术的提升，部分手机的夜景功能已经提升、优化了，但是大部分手机的夜景功能还是不尽如人意。 那么，想用手机拍夜景该怎么办？我们只要了解了手机的特点，就可以充分发挥其性能。夜景也可以拍出好照片。 选择合适的拍摄时间  图5.26 夜景的拍摄时间一般有两个时段：第一个是傍晚，太阳落山后一个小时；这个时候，天空的颜色变化很多，会从蓝色变成深蓝色，再变成紫色，最后变成黑色。第二个是夜晚，天空完全黑了之后；这个时间更多拍摄的是建筑物的光效以及路上的车水马龙。 如果是选择太阳刚落山的时候拍摄，天空还是比较亮的，而且天空的颜色会呈现冷暖的层次感，对于手机来说，这个时间段比较适合拍摄。而且在这个时间段，建筑的灯光还没有亮，也刚好是下班的高峰期，所以比较适合拍摄车水马龙的街景。  图5.27　iPhone 8 Plus 北京 太阳刚刚落山时，天空还泛着夕阳的暖黄色。下班高峰时，路上的车非常多。固定好手机，使用慢门拍摄一幅车水马龙的街景。  图5.28 相对于车流静止的画面，第一张照片的画面中增加了动感效果。动静结合也使画面更有视觉冲击力，不至于太过平淡。  图5.29　iPhone 6s Plus 北京 这种慢门效果，如果是使用苹果手机，需要升级最新的系统。打开【实况】功能拍摄，然后在相册里选择【长曝光】模式，或者应用专业的慢门软件比，如【慢快门相机（Slow Shutter Cam）】进行拍摄。安卓手机可以使用【专业模式】或者【慢门】。部分手机会自带【流光快门】，就是专门用来拍摄这种效果的。  图5.30  图5.31  图5.32 下面这张照片拍摄的时间大概是晚上7点。太阳落山后，天空还是蓝色的，建筑物都已经开灯，光线比较明亮，地面的路灯也已经打开。因为路灯属于暖色光，天空的蓝色属于冷色，所以画面中冷暖对比明显，使画面内容更加丰富，也可以增加画面的层次感。  图5.33　iPhone 8 Plus 北京 如果选择深夜进行拍摄，此时天空已经全黑，由于手机的局限性，最好选择光线比较好的场景拍照。昏暗的灯光环境不利于手机拍摄。 不管是傍晚还是夜晚，用手机拍摄最好使用三脚架，或者找一个能把手机固定好的地方拍摄，尽量减少因手持手机产生的抖动。晚上光线不足，拍照的时候快门速度会降低，一旦手抖，画面就会模糊。  图5.34 这张照片拍摄于晚上9点多，天空已全黑，但是建筑物的灯光效果很好，亮度足够，所以使用手机也能拍出比较清晰的画面。  图5.35 如果环境中的光线条件不好，拍出来的效果就会明暗对比强烈，有灯的地方特别亮，没灯的地方特别暗；也无法看清建筑物的轮廓和场景的内容。 追焦，把弱点变成优势 在弱光环境下，手机拍照容易虚。那么，我们就利用它的这一“弱点”进行拍摄。追焦是摄影里的一种常见拍摄方法，特别是在拍摄运动题材，比如跑动的人、运动的车的时候。 追焦的拍摄方法比较简单，但是成功率比较低，要多拍。拍摄的时候，两只手拿稳手机，双臂夹紧躯干，然后与移动的物体保持水平同速移动，在移动的过程中按下快门。这样就能拍出主体清晰、背景模糊的追焦效果了。  图5.36  图5.37  图5.38 在选择场景的时候，背景中灯光的颜色最好能丰富一点。这样，画面的色彩会更具多样性，因为夜晚的所有效果都需要靠光线来衬托。  图5.39  扫码观看视频演示 谁说手机不能拍星空？ 手机在弱光环境中很难拍出清晰的照片，但现在手机技术越来越发达，很多安卓手机自带超级夜景功能或星轨模式。苹果手机也可以下载一些手动软件来拍摄星空。  图5.40 努比亚自带慢门和星轨功能。  图5.41 手动模式，参数调整，增加快门时间和ISO（感光度），可对焦到无限远。 用手机拍摄星空需要注意以下4个方面： 1.必须固定手机，可使用三脚架或者找到固定的位置； 2.在月初或者月末拍摄，否则月光会形成很大的光线干扰； 3.最好选择野外场景，以减少光污染； 4.使用长曝光，根据情况拍摄30秒钟甚至更长的时间。  图5.42　努比亚 暹粒  图5.43  扫码观看视频演示",
            "level": 2,
            "parentId": 31,
            "valid": 1,
            "href": "index_split_034.html"
        },
        {
            "id": 35,
            "title": "自己动手，创造美妙的光影",
            "number": 4,
            "fullNumber": "10.4",
            "content": "自己动手，创造美妙的光影 摄影是光影的艺术，只要有光的地方都不要放过。我们虽然没有摄影棚里的专业设备，但是我们可以利用身边的物品去创造一些不同的效果来进行拍摄，让我们在生活中也能拍出大片。自己创造的场景才能让我们的照片与众不同。 打造追光效果 我们都知道光线有聚焦的作用，比如话剧舞台上的主角都会在追光灯下表演，这让一个巨大的剧场中，所有人的视线都聚焦在追光灯下。我们在拍照的时候，依然可以利用这些生活中的原理。 摄影是一个做减法的过程。很多人会有一个误区，就是希望把所有看到的内容都拍下来，但是镜头承载的内容是有限的，镜头无法与人眼的覆盖范围相比。而且，如果画面中包含很多内容的话，会显得杂乱，主体不够明显。因此我们要学会做减法，去掉不必要的信息，只留下与你想表达的主题相关的元素即可。  图5.44  图5.45  图5.46  图5.47 我给一本书拍过一张照片，当时想利用追光灯的效果，但是家里没有这种场景。刚好中午的阳光不错，但是家里的环境太杂乱，于是我就自己动手创造了一个光线场景。我希望阳光像一道追光灯一样照射在书名上，于是用两本书挡住阳光，中间留出一道缝隙，阳光刚好通过缝隙照射在书名上。拍摄完毕，我又通过后期调整明暗对比度，只留下要表达的书名，其他的内容都不要，让画面更加干净、聚焦。 利用纸板拍出百叶窗的效果 在拍人像的时候，很多人会用到百叶窗这个场景。这种线条感能够增加画面的层次和质感，让光线有更多的可能性和变化，不会显得单调。 那么如果没有百叶窗，如何拍出这种效果呢？我们可以自己动手做一个遮光板。 找一个大一点的纸板，比如快递箱，裁剪成百叶窗的效果（图5.49），然后挡在光源的方向，通过条纹的光影效果拍摄人像，可以营造出一种别样的质感。  图5.48　iPhone 6s Plus 天津  图5.49  图5.50 世界是彩色的，很多人拍照时也都希望把照片拍得颜色丰富一些。但是常见的光线基本都是白色的。如果想改变光线的颜色，我们可以利用一些道具来过滤光线。  图5.51  图5.52  图5.53 如果你喜欢吃糖，可以收集一些彩色的透明糖纸，或者利用家里彩色的塑料袋，把它们挡在手机的闪光灯上进行拍摄，通过人工干预来改变光线的颜色，可以营造出时尚的彩色光影效果。也可以下载几张纯色的图片，在手机上打开，打造时尚的色彩光影。 如果光线太强，有的时候手机对于光线过渡的处理会不自然，明暗分界线会比较生硬。如果不想拍摄特别明显的明暗对比，可以利用补光来提高阴影部分的亮度。专业摄影师都会使用反光板，但对于我们来说，没有专业反光板，可以利用反光的物质来制作反光板。 使用白纸、锡纸、泡沫板，或者一些白色的物体，甚至白色的衣服都可以，因为白色的反光效果最好。那么，我们在拍摄人物或者静物的时候，把光源置于物体的一侧，将自制反光板放到另一侧，这样拍摄的物体能够保证两面都被照亮，也能在物体上生形成柔和的光影效果，从而增加立体感。  图5.54  图5.55  图5.56 利用一张白纸作为反光板。图5.54中，左侧为灯光，拍出来的效果，阴影非常明显。如果想提高阴影的亮度，使画面的明暗对比自然一点，可以在右侧放一张白纸反射光线（图5.55）。图5.56为最终效果，阴影弱化，画面看起来更加自然。",
            "level": 2,
            "parentId": 31,
            "valid": 1,
            "href": "index_split_035.html"
        },
        {
            "id": 36,
            "title": "第六章 如何拍出有质感的黑白照片",
            "number": 11,
            "fullNumber": "11",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_036.html"
        },
        {
            "id": 37,
            "title": "黑白照片永恒的魅力",
            "number": 1,
            "fullNumber": "11.1",
            "content": "黑白照片永恒的魅力 我坚持过100天，每天用手机拍一张黑白照片。这是由繁至简的一个过程。黑白摄影的魅力就在于此。我们的世界是彩色的，所以我们能看到的东西都是彩色的，没有人能看到黑白世界，我们只能通过照片看到黑白世界是什么样的。正是因为有黑白摄影，让我们有机会看到另一个世界的样子。  图6.1　iPhone 6s Plus 库木塔格沙漠 获得2018年全球iPhone摄影大赛风光类荣誉奖 手机的好处在于，有很多现成的黑白滤镜。也可以通过手动调整参数，把照片变成黑白色。  图6.2  图6.3 夕阳下普通场景的肖像照，通过手机后期处理成黑白照片，更好地刻画了人物的五官轮廓。 黑白照片看起来比较深沉，因为颜色的单纯能让你更好地去观察这个照片。排除了各种杂乱颜色的干扰，照片会更加吸引人。",
            "level": 2,
            "parentId": 36,
            "valid": 0,
            "href": "index_split_037.html"
        },
        {
            "id": 38,
            "title": "用黑白效果提升视觉冲击力",
            "number": 2,
            "fullNumber": "11.2",
            "content": "用黑白效果提升视觉冲击力 摄影是光影的艺术，因此在书中反复强调光的作用。好的作品一定是很好地利用了光线，特别是黑白照片，对于光线的要求会更高，无论是自然光还是人造光。有的时候，可能是非常普通的场景，只要有光线的明暗对比，就能立刻提升照片的表现力。  图6.4  图6.5 这张照片拍摄的时候是阴天，光线不是很亮，场景中以土黄色为主，所以照片显得很平淡。通过手机后期的调整，去掉背景中的人，增加明暗对比度，然后把照片调成黑白色。这样一来，照片的视觉冲击力马上就显得很突出，而且黑白灰三种颜色过渡自然，用光营造了一种氛围，让画面中的人非常的聚焦而且突出。人物的处理应用的是前文提到的剪影效果。 因为手机的局限性，没办法像相机一样把光影效果处理得那么好、那么自然，所以，我们就要寻找更适合手机拍摄的光影环境。在黑白摄影中，没有色彩来强调细节，只能靠光线来突出主题。  图6.6  图6.7  图6.8 这张照片是在一个老旧的写字楼里拍摄的，阳光透过天窗照射进来，刚好形成一个三角形区域，但是瓷砖反光，显得画面不是很干净，环境也有点脏。这个时候，把用手机打开黑白滤镜，直接拍摄，就屏蔽掉不干净的环境，后期加强明暗对比，强调了阴影的效果。于是，照片最后的效果就非常有视觉冲击力，也显得高级很多。",
            "level": 2,
            "parentId": 36,
            "valid": 0,
            "href": "index_split_038.html"
        },
        {
            "id": 39,
            "title": "这些场合最适合拍黑白照",
            "number": 3,
            "fullNumber": "11.3",
            "content": "这些场合最适合拍黑白照 我经常会听到一个问题：“老师，我不知道该拍些什么，怎么办呢？”我一般会回答：“任何一个你习以为常的场景都不要放过。”比如在生活、工作的环境中，大家可能很少会停下脚步去仔细观察，因为觉得这个太普通了，太平常了，这有什么可拍的呢？但往往好的照片，就来自这些看似平凡、不起眼的地方。 有影子的地方 前面刚讲了，要学会抓住光影。那么，在我们生活中有哪些地方会有光影？其实有很多，无论什么场景，只要有光线，只要有遮挡物，就会有影子。可以仔细地观察是否有可以拍摄的条件。有些平淡无奇的地方，加入阴影之后，会使主体融入一个有意境的环境中，画面立刻生动起来。而且，影子能够起到简化画面的作用，让照片更聚焦。  图6.9　iPhone 8 Plus 北京 一个纯白色的背景，如果单独拍摄的话，会显得过于单调，无法突出环境的氛围。但是，如果有影子的加入，就增加了画面的丰富度和氛围感。将手机调成黑白模式，直接拍摄，普通场景也可以拍出时尚感。  图6.10　iPhone 8 Plus 下午的一道光线刚好在墙上留下了一个三角区域。人坐在光影的角落里，面向阳光。光影通过引导的作用把视线聚焦在人的身上，让主体非常的突出。简单的墙面因为有了光影，变得很有层次。  图6.11 一双拖鞋，可以拍出什么效果？透过窗棂的阳光，把影子洒落在地上，突出了环境的氛围，也凸显了拖鞋的落寞感，给没有生命的物体赋予了人的情绪。 寻找有趣的图案 我们习惯拍可以看到的景物，但是有形的景物不会随着时间而发生变化，比如一栋建筑，无论什么时间拍摄，它的样子都是那样的。但影子会随着光线的强弱、角度的不同而发生变化，不同物体的影子又都不同，特别是一些不规则物体的影子。多观察，会得到很多意外的收获。  图6.12 在太阳光下，人如何能产生两个影子呢？这是因为，他利用了周围的环境带来的特殊效果，站在写字楼玻璃外墙旁边，通过太阳的照射，在地上留下一个影子；阳光通过玻璃的反射，又照到他身上，形成了另外一个角度的影子。这样，手机的好处就凸显出来了：可以随时发现有趣的场景，随时拿出来进行记录。  图6.13 一枚戒指，一本书，一个台灯，一部手机。利用书的自然变形，把戒指的影子拉成心形。只是非常简单的拍摄技巧和拍摄场景。不需要高超的摄影技巧，只需要足够的创意。  图6.14　学员作品 张营/摄 小米 Note 2 迎面走来两个人，身边跟着一条可爱的小狗。因为是逆光，所以拍不清楚人的表情神态，但是夕阳拉长了人的影子，却很有趣。影子一长一短。利用对角线构图，更加凸显了影子的长，也能侧面反映拍摄时间。而且人只留下了膝盖以下的部分，而小狗却全身出境，也增加了画面的趣味性。因为离得很近，手机偷拍不容易被发现，也就不容易出现尴尬的场面。这也是在街拍的时候，手机的优势。  扫码观看视频演示 有强光的地方 有强光的地方就会有浓重的阴影。因为是黑白摄影，所以更加强调明暗的对比，来突出画面的结构和环境的氛围。当遇到早晚光线角度低，没有太多的散射光线时，就能产生强烈的阴影，或者通过建筑物、自然环境中不透光的物体遮挡，也能产生强烈的阴影。这些都是很适合拍摄黑白照片的场景。  图6.15　iPhone 8 Plus 北京 太阳落山前，通过两栋大楼中间的缝隙，在地面上留下了一道明显的光线。两边因为建筑的遮挡，影调非常的暗。拿出手机长按屏幕，把焦点锁定在光亮的地方，然后静静地等着行人经过。在人进入光带之前就按住快门开始连拍，以免错过最好的时机。  图6.16　学员作品 孙慧/摄 iPhone 6 Plus 在图书馆的大厅，透过天窗照射进来一道光。一个男人坐在光下看书，人物的姿态轮廓显得非常清晰。而且，因为黑白的效果，四周变暗，降低了大空间的空旷感。这道光线起到了很好的引导作用，把人的视线从画面的左上角引导至人的身上，使画面聚焦而且主体清晰。  图6.17　iPhone 8 Plus 阿那亚 拍摄建筑时，如果想突出它的立体感，那么光线的角度和强弱对于效果会有很大的影响。比如，这座海边教堂是全白色的建筑，如果光线很弱，就很难突出立体感。但是在强光下，因为棱角分明的设计，就能够在不同的面上产生不同程度的影子。而且硬朗的建筑，配合强光下硬朗的线条，能够更好地突出建筑的特点。 有人的地方 我们在看照片的时候，为什么会有这样一个现象：无论什么样的场景，只要有人的出现，就会比较吸引人的注意？因为人与我们是有相关性的，会产生一种代入感，而且那些经久流传的照片，也大都是以人为主题的。所以，不要错过有人的地方。而且最好是远距离拍摄人物和人物的影子，通过小人和大景的对比增加画面的空间感，很好地表现人与环境的关系。  图6.18　iPhone 6s Plus 天津 天津的西开教堂，一扇大铁门打开，在地面上留下了很有秩序的投影，显得画面很有张力。但是，如果缺少了这个人，画面会显得缺少了焦点。人的存在不仅拉近了照片和观者的距离，也增加了场景的故事性。  图6.19　iPhone 6s Plus 库车 有峡谷的地方，从来都不缺少光影。在新疆的天山大峡谷，阳光透过不规则的山体，在峡谷中留下一道崎岖的光影。因为光线很强，单独拍下这样的峡谷，会显得有点乏味。让一个人站在画面中间，做出享受阳光、沐浴阳光的动作，给峡谷增加了很多生机。  图6.20　iPhone 8 Plus 北京 逆光场景经常拍不出好照片。利用黑白效果，可以减少逆光带来的干扰。抓拍人物时，拍到阳光下的瞬间，在地面拉长了影子，人与影子形成了很好的互动。 有线条的地方 有规律性的线条能够帮助我们去构图，因为规律性构图也是一种常用的拍摄方法。在自然界中，线条无处不在，比如建筑与黑白是一个很好的组合。很多建筑的照片都是黑白色调的，因为建筑的美包括几何图形、线条。如果这些场景想用黑白效果来表现，最好选择秩序性比较好的建筑，这样会显得层次感清晰，线条更自然，也能够排除杂乱颜色的干扰，让建筑的线条感更加突出。  图6.21　iPhone 8 Plus 北京  图6.22　iPhone 8 Plus 北京 有时候建筑很大，我们无法拍摄出它的全貌，但是很多建筑的外观并没有鲜明的特点，所以，我们可以寻找细节的秩序感。如图6.22所示，建筑外墙上呈现出笔直有序的线条，清晨的阳光从右侧照射过来，黑白灰三色清晰分明，让墙面看起来非常的立体。  图6.23　iPhone 8 Plus 北京 大型建筑，有很强的秩序感，通过黑白色调，能强化建筑的特性。画面中建筑与人的对比，形成反差，突出了建筑的宏伟。  图6.24　iPhone 8 Plus 北京 线条有有形的，也有无形的，需要我们在生活中多观察。比如车流这张照片。站在天桥上拍摄车流驶过的瞬间，让车流变成了虚化的线条。使用手机的慢门，或者长曝光功能，就可以拍摄出来。画面中有动有静，对比强烈，也增加了画面的视觉表现力和动态效果。  扫码观看视频演示",
            "level": 2,
            "parentId": 36,
            "valid": 1,
            "href": "index_split_039.html"
        },
        {
            "id": 40,
            "title": "如何利用手机的独特性拍摄黑白照",
            "number": 4,
            "fullNumber": "11.4",
            "content": "如何利用手机的独特性拍摄黑白照 手机有自己的独特优势，自然也有不足之处，比如无法像相机那样有很好的明暗过渡分界线，无法优化处理更多的画面信息，也无法保证夜晚拍照的画质。不过，这些不足都可通过黑白照片进行适当的弥补。前文提到了很多拍摄的场景，以及如何选取素材。那么，我们在实际拍摄中，可以应用哪些技巧来发挥手机的特性呢？ 光影的对比 如果没有光影，黑白照片就会显得非常的平淡，因为黑白照片中只有黑白灰三种颜色，黑白是主要颜色，灰色为过渡颜色。那么，照片如果没有黑白光影的明显对比，整个画面都是灰色的，会显得比较平淡，画面的立体感、空间感就不会很明显。所以我们在拍照的时候，一定要在画面中增加光影的对比，选择强光影环境。拍摄的时候可以降低曝光度，这样光影都会更明显，也可以通过后期来实现光影对比的效果。  图6.25　iPhone 8 Plus 北京 人站在影子下，一半在阴影中，一半在阳光下，结合黑白色调，增加了画面的神秘感，也让照片的层次感更加丰富。以普通的墙面为背景，也能拍出有质感的人像照片。  图6.26 地下通道的栏杆在逆光下形成了很有秩序的光影线条，显得画面特别的有秩序。妈妈牵着孩子走过，清晰的人物剪影，也让这个空间多了一些与观者互动的元素。  图6.27　iPhone 8 Plus 北京 低角度仰拍，拍出人物的高大感。跑动的动作让一个静态的场景变得更加有活力，光影对比会线条分明。后期通过黑白效果，加强了光影的层次感。 选择极简环境 手机的拍照功能毕竟无法和相机对比，因为它的感光元件非常小，能记录画面的信息是有限的，对于画面的细节处理也有限。一张小小的照片，如果不聚焦，主体不突出，是很难吸引人的。如果黑白照片中的元素过多，就会产生很杂乱的效果。因为没有颜色的烘托，所以主体会更加不突出，很容易被环境所覆盖。我们要尽量尝试去寻找极简的场景，在保证画面聚焦的同时，也让照片更加的干净、简单，让人把注意力更多地放到画面主体上。  图6.28　iPhone 8 Plus 烟台 在烟台的清晨，海边的渔船静静地停泊在港湾里，利用逆光效果拍出清晰的轮廓剪影。一个中年男人，在海水中寻找着什么。这个场景很好地记录了海边的人的一种生活状态，而且黑白效果把画面变成海天一色，画面简洁干净。即使人的比例很小，也能够起到很好的聚焦作用。  图6.29 灰白的天空中，一群鸟飞过。鸟的体积比较小，但是飞翔的动作很舒展。简单的画面，让鸟群更加突出，黑白色调更能凸显氛围。 关注纹理细节 看过一些优秀的黑白摄影作品的人都应该有一个感受：黑白照片特别容易表现纹理质感，比如苍老褶皱的皮肤，比如岩石树木的纹理，以及花瓣树叶的脉络。也是因为我们屏蔽了颜色的干扰，才会更加突出纹理细节。  图6.30　iPhone 8 Plus 北京 老人66岁，风吹日晒，在路边修了25年自行车。满脸的皱纹见证了岁月的洗礼。黑白效果能够更好地表现皮肤的纹理和质感，符合这个年龄的生命状态。  图6.31　iPhone 8 Plus 北京 绽放的花朵，从花瓣到花蕊，都充满了生机。但是彩色的过于普通，利用黑白突出质感的特点，把花瓣上的纹理表现得非常清晰，而且非常的有张力，仿佛要冲出画面一样。  图6.32　iPhone 8 Plus 北京 一片树叶的微距摄影，去掉了原本颜色的干扰，让我们在看到照片的时候，会更纯粹地关注叶子本身的细节。",
            "level": 2,
            "parentId": 36,
            "valid": 1,
            "href": "index_split_040.html"
        },
        {
            "id": 41,
            "title": "第七章 利用对比，增强照片的层次感",
            "number": 12,
            "fullNumber": "12",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_041.html"
        },
        {
            "id": 42,
            "title": "最简单实用的大小对比",
            "number": 1,
            "fullNumber": "12.1",
            "content": "最简单实用的大小对比 我们上学的时候都学过参照物。因为有了参照物，才能判断物体的大小。如果一张照片中只有一个人，而没有周围环境和物体的衬托，你就无法判断这个人的身高。再比如，拍摄一个沙漠的场景，镜头里只有沙漠，没有任何其他的物体，你也很难感受到沙漠的辽阔。  图7.2 人物在照片中占了很大的比例，这样的构图能够很好地突出人物的特点，但是无法很好地展示人和环境的关系，也无法记录更多场景信息。这样的照片，拍摄方法没有问题，但是会略显单调，照片过于直白，没有想象空间。  图7.3 近距离拍摄沙漠的纹理。如果拍摄的目的是突出细节，可以选择这样的视角；如果想突出沙漠的辽阔，这样拍摄就无法达到效果了，因为画面中没有对比物，令人无法判断其大小。 在摄影中应用大小对比，就是在画面中选择能够互相衬托的元素，产生以大衬小，或者以小衬大的效果。而且，这些元素必须是我们熟知的。  图7.4　iPhone 6s Plus 库木塔格沙漠 在人和沙漠的场景中，如何突出沙漠的辽阔呢？对于人的身高，我们是有认知的，在画面中人越小，越能反衬沙漠的辽阔。如果你的照片想突出的效果就是沙漠的辽阔和荒芜，那么可以尝试在画面中增加一个人，通过大小对比来突出沙漠的辽阔感。 在应用大小对比的时候，应该注意到照片中的环境是否简洁。元素多了之后，会产生很多不同的对比，使画面凌乱，反而无法起到突出主体的作用。  图7.5　iPhone 8 Plus 北京 一只小鸟在广阔的天空中自由飞翔。虽然小鸟所占的比例很小，但是因为画面的背景是相对纯色的天空，所以鸟的剪影在画面中比较清晰，并不会被忽略。通过这种大小的对比，可以很好地传递“天高任鸟飞”的感觉。  图7.6　iPhone 6s Plus 帕米尔高原 人在面对大自然的时候，永远是渺小的，对大自然应该有一颗敬畏之心。在这种绵绵雪山的场景拍摄，让人远离镜头，只记录一个轮廓。以整个大场景来烘托氛围，人在画面中成为点睛之笔。这样不仅能够很好地展示拍照的氛围和环境，也能期待有很好的聚焦作用，让照片有一种磅礴的气势。  图7.7　iPhone 6s Plus 北京 商场后门外，一个餐厅服务员蹲在墙边抽烟休息。我坐在对面的咖啡厅，拿起手机拍下这个场景。我特意留了很大面积的墙，其实想突出的是在大城市打拼的基层人员艰辛的一面。他们可能是这个城市最渺小的一个群体，但也是人们最离不开的群体。用大比例背景、小比例人物形成鲜明对比和反差。",
            "level": 2,
            "parentId": 41,
            "valid": 1,
            "href": "index_split_042.html"
        },
        {
            "id": 43,
            "title": "最有视觉冲击力的动静对比",
            "number": 2,
            "fullNumber": "12.2",
            "content": "最有视觉冲击力的动静对比 照片是静态的，所以很难像视频一样，展现丰富的细节和动态效果。这也是我们喜欢看动图和视频的原因。那么，如何在平面、静态的照片中增加更多的动感呢？其实，这可以通过对比的方式来实现。在拍照的时候，通过捕捉画面中的动态元素，来增强照片的视觉冲击力。 在平时的生活中，哪些场景中可以拍出这样的照片呢？比如马路上，有静态的建筑和动态的车流；在人群中，有走动的人和静止的人；在运动中，有静态的环境和动态的人。  图7.8　iPhone 8 Plus 北京  图7.9  图7.10  图7.11 这几张是晚上用追焦的方式拍摄的。追焦就是手持手机锁定拍摄对象后，水平移动，保持和拍摄对象运动速度一样，在过程中按快门，就能拍出背景虚化的动态效果。追焦不仅可以拍夜景，白天也可以拍。这种方式特别适合拍快速运动的物体，比如汽车、火车和跑动的人。  图7.12 这个普通的街景照片，展示了一辆公交车经过、惊起鸽子的场景。笔者抓拍了飞起来的鸽子。鸽子是动态的，其他元素都是静止的。画面显得很生动。如果整个画面里的元素都是静止的，就会略显乏味。 现在，旅行已经成为我们生活的一部分了。每当我们到一个风景优美的地方，都希望能留下几张漂亮的照片。有很多地方风景特别漂亮，随便一个人，只要站在那里按下快门，就能拍出所谓的“大片”。不过千人一面，所有人拍出来的照片可能都是一个风格效果，没有什么区分度。那么，如何能让你的照片看起来有点不同呢？  图7.13  扫码观看视频演示 旅游季节，景区的人都很多。拍出来的照片，永远都有一群人作背景。面对这种场景，可以尝试用慢门功能，把走动的人虚化，让拍摄主体在画面中保持不动，就能够形成这种动静对比的效果。  图7.14  图7.15 苹果手机可以使用【实况】功能实现。在拍摄的时候，保证人站稳、不要动，手机也要固定好、不要晃动。拍摄之后，在相册中打开照片，上滑选择长曝光（iPhone 6s以后机型、系统iOS 11以后机型可用）模式，就可以实现这种效果。  图7.16 安卓手机可以使用手动功能或者慢门功能，降低快门速度，实现运动元素虚化的效果。  图7.17　iPhone 8 Plus 宏村 这种功能也能够帮助我们把走动的游客虚化，从而让画面更加的干净，避免那种所有旅行照片里都离不开人群的现象。拍这座桥的时候，桥上挤满了人。利用慢门拍摄，最后的效果就是，走动的人流全部虚化了，从一定程度上降低了人群对画面的干扰。  图7.18　iPhone 8 Plus 洛阳 遇到有流水、瀑布的场景时，依然可以用这种功能来进行拍摄，达到的效果就是，动态的水流和周围静态的环境形成对比。但是要注意，因为慢门拍摄的快门时间比较慢，所以想拍出潺潺流水的效果，一定要固定好手机。在天气好、光线好的情况下，手持手机拍摄问题不大，但是如果光线不好，手持拍摄时，基本上整张画面都会模糊。因此，最好找一个地方把手机固定好，或者使用三脚架拍摄。  图7.19 iPhone 6s Plus 禾木村  扫码观看视频演示",
            "level": 2,
            "parentId": 41,
            "valid": 1,
            "href": "index_split_043.html"
        },
        {
            "id": 44,
            "title": "最容易突出主体的虚实对比",
            "number": 3,
            "fullNumber": "12.3",
            "content": "最容易突出主体的虚实对比 现在的手机都有双摄像头，甚至三摄像头，在拍照功能中增加了人像或者大光圈功能。它能够拍出模拟单反的背景模糊效果，从而使人物或者静物在画面中更加突出和聚焦。手机摄影的弊端就是无法像相机一样有一个可以变焦的镜头，不过可以通过算法实现背景虚化的效果。  图7.20  图7.21 虚化的背景让人物在杂乱的环境中显得更加立体，看照片的人不会被周围杂乱的环境分散注意力。图7.20为手机直接拍摄，图7.21为使用人像模式拍摄。将二者相比较，人物在画面中并没有产生变化，但是看背景的清晰程度，能够看出来，人像模式的背景模糊，显得人物更加的立体和聚焦。  图7.22　iPhone 8 Plus 北京 如果你的手机自带这种效果，可以选择直接拍摄。不过要注意的是，人像功能更适合拍人。有的人会用这个功能来拍一些静物，比如花卉，但并不是所有手机对主体的轮廓识别功能都很强。如果画面过于零散复杂，它的识别功能就会降低，导致照片该模糊的地方不模糊，该清晰的地方不清晰。  图7.23 在足球网这样的场景中，在人物前后都有球网，所以用手机打开人像模式会发现，虽然能识别出来人物的轮廓，但是无法很好地判断前后景里的球网，画面上半部分的球网，就出现了虚实不自然的情况。  扫码观看视频演示",
            "level": 2,
            "parentId": 41,
            "valid": 0,
            "href": "index_split_044.html"
        },
        {
            "id": 45,
            "title": "最有空间感的远近对比",
            "number": 4,
            "fullNumber": "12.4",
            "content": "最有空间感的远近对比 我们学习过近大远小的透视原理：离镜头越近的物体显得越大，离镜头越远的物体显得越小。这种空间原理在生活中随处都有所体现。前文讲过，照片是二维平面的，如果想突出画面的立体感和空间感，可以通过增强画面中元素的远近对比来实现。  图7.24　iPhone 8 Plus 宏村 这是一座有200多年历史的古宅，层层递进的门形成了很好的纵深效果，由近及远，由大到小，增强了画面的空间感，而且向远处走去的人，也产生了很好的代入感。 在使用远近对比的过程中，要注意不同元素间的位置关系。在构图一章中，讲过构图的目的是使画面中的各种元素达到一种平衡的视觉效果，不致出现头重脚轻、左右摇摆的情况。所以在应用这种对比手法的时候，要注意到构图的效果。  图7.25　iPhone 8 Plus 洛阳 在缆车上，利用天然的距离，让车厢形成近大远小的纵深效果。三条钢缆，由上至下，由近及远，形成了一个很清晰的引导线构图，引导观者的视线看向远方。  图7.26　iPhone 6 库布齐沙漠 穿越沙漠的徒步队伍，通过远近处人的大小对比，很好地体现了队伍的延伸感，同时也利用了大小对比，衬托出沙漠的辽阔。 在应用远近对比的时候，往往是为了体现拍摄环境的空间感或者距离感。在拍摄的时候，需要寻找画面中的前景和背景，让人能够感受到画面中不同元素的位置关系，利用前后景的远近对比，来产生强烈的代入感。比如在拍摄建筑的时候，在镜头前寻找一个前景，通过与前景的对比，来产生一种近在眼前的效果。  图7.27 利用弧形天桥作为前景，衬托远处的建筑群。这样的构图通过远近的对比，形成了很明显的空间感。前景的利用，起到了很好的衬托作用，让建筑群在照片中更加的立体。  图7.28 不同的人有不同的生活轨迹，三个人擦肩而过，离得那么近，但又毫无交集。这就是生活在大城市中的人的生活状态。",
            "level": 2,
            "parentId": 41,
            "valid": 0,
            "href": "index_split_045.html"
        },
        {
            "id": 46,
            "title": "最有温度的冷暖对比",
            "number": 5,
            "fullNumber": "12.5",
            "content": "最有温度的冷暖对比 在彩色照片兴起之后，冷暖对比就成为摄影中的重要手法。用好了冷暖对比，画面就会更具有视觉冲击力。很多时候，我们拍照片为了增强画面的视觉效果，我们会为照片制造一种矛盾的关系。这就是我们在本章讲的“对比法”。而冷与暖的对比是摄影中运用得比较多的一种色彩表达方式。  图7.29　iPhone 6s Plus 布尔津 夕阳染红天边，天空还没有完成变暗，蓝色由浅及深，自然过渡，画面冷暖颜色对比明显而又自然和谐。  图7.30　iPhone 6s Plus 上丁  图7.31　iPhone 6s Plus 库车 冷色和暖色是最常见的两种颜色，所以利用冷暖对比来拍照片比较简单，对于入门者来说也容易掌握，比如暖色的夕阳和冷色的天空，比如暖色的车灯和冷色的城市灯光，又比如暖色的鲜花和冷色的天空。只要多观察，生活中处处都有值得拍摄的素材。  图7.32　iPhone 8 Plus 洛阳 老君山的日出。暖色的太阳刚刚跳出来，慢慢染红周围的天空和云层。蓝色的天空、深蓝色的山脉，这个时候都成了太阳的陪衬。画面的焦点在日出的地方，冷暖两色的对比强调了画面的层次感以及氛围。 大自然是最好的调色板，很多颜色都能够和谐地存在。除了自然界中的冷暖对比，在很多人造的环境中也能找到适合拍照的场景。  图7.33　iPhone 8 Plus 北京 在北京的老胡同里，以青砖作为背景来拍摄，颜色简单并有些沉重。为了突出母女两人的青春活力，让她们穿上红色的衣服，和背景形成鲜明的对比。青色对比红色，也属于冷暖对比。  图7.34  图7.35 在建筑中也经常可以发现冷暖对比的环境，比如灯光、建筑本身的颜色、环境的颜色。对于这些颜色，都可以加以利用，来增加建筑摄影的温度感。",
            "level": 2,
            "parentId": 41,
            "valid": 0,
            "href": "index_split_046.html"
        },
        {
            "id": 47,
            "title": "第八章 照片不仅要好看，还要拍得好玩",
            "number": 13,
            "fullNumber": "13",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_047.html"
        },
        {
            "id": 48,
            "title": "考验创意的错位摄影",
            "number": 1,
            "fullNumber": "13.1",
            "content": "考验创意的错位摄影 书中讲到了“大小对比”的拍摄手法。大小对比是由于距离的不同，产生了不符合实际的视觉误差。我们可以利用这个特点，来实现一些有趣的错位摄影。错位摄影中，重要的是产生突破常规的视觉冲突，通过巧妙的角度，造成违反常理的以假乱真的效果。  图8.1  图8.2　学员作品 欣然/摄 小米6  扫码观看视频演示 错位摄影是旅行、亲子、情侣摄影中常用的小技巧，随时随地都可以通过手机拍摄，不受器材限制。  图8.3　学员作品 茜茜妈/摄 iPhone 7  图8.4  图8.5  图8.6 将人物传记封面上的头像和真人进行衔接，制造一种滑稽的效果。  图8.7　学员作品 Ting/摄 iPhone 7  图8.8　学员作品 大大/摄 华为荣耀V10  图8.9　学员作品 王蓓/摄 iPhone 6  图8.10　iPhone 8 Plus 利用手机、电脑等电子设备拍摄透明效果。先用手机拍一张照片，放大之后，跟实物对比衔接，创造一种手机透明屏幕的效果，然后用另一部手机拍摄。 用手机拍摄错位摄影，首先要注意的就是：离镜头近的场景，要控制好距离，最好不要自己拿着手机拍自己，因为手机镜头为广角定焦镜头，离得太近会造成景深虚化效果。所以，最好给别人拍，保证画面的清晰度，以求效果逼真。第二个要注意的就是衔接问题，如果要以假乱真，衔接做不好就很容易穿帮。  图8.11　学员作品 白开水/摄 iPhone 6 在户外公路的场景拍摄是一个聪明的选择，因为周围环境简单，不容易产生分散注意力的元素。两张照片都用类似的动作和姿态拍摄，两人之间错位衔接的效果都很自然，没有穿帮的情况。  图8.12　学员作品 蔡佳琨/摄 iPhone X 通过时间差来形成错位反差效果。手中是春天拍摄的照片。秋天的时候，在同样的位置再拍摄一张，形成春秋时间差。",
            "level": 2,
            "parentId": 47,
            "valid": 0,
            "href": "index_split_048.html"
        },
        {
            "id": 49,
            "title": "小镜头大世界的微距摄影",
            "number": 2,
            "fullNumber": "13.2",
            "content": "小镜头大世界的微距摄影 手机摄影的优势就是随时随地可以自由拍摄，但是手机毕竟有局限性，无法应对所有场景，比如想拍摄一朵花的花蕊，或者近距离拍摄一个水滴，抑或想拍摄特别细致的纹理，都会无能为力，因为手机无法特别近距离地对焦。  图8.13 距离大概2厘米，拍出来的就是模糊的效果，无法对焦。如果想近距离拍摄清晰的细节，可能就需要使用微距功能。苹果手机需要借助软件或者微距镜头来拍摄。  图8.14 借助软件Camera+的【微距】功能拍摄，虽然能够拍出一些细节，但是这个功能其实是通过光学变焦，放大了画面。在画质清晰度上会有一定的损失。  图8.15  图8.16 这是努比亚手机自带的微距功能，拍摄的清晰度相对高一点，画质得到一定保证。 如果想拍摄更细节的场景，就需要借助外接微距镜头了。加上镜头后，实现了物理变焦，保证了画面的清晰度，而且使用微距镜头的时候，对于距离非常近的场景，也可以精准对焦。  图8.17  扫码观看视频演示  图8.18  图8.19  图8.20  图8.21 使用微距镜头，可以改变镜头的焦距，在近距离拍摄时，能够精准地对焦，在保证画面的清晰度的同时，能够拍摄出更多微观的细节，可以展现出肉眼很难观察到的细节。",
            "level": 2,
            "parentId": 47,
            "valid": 0,
            "href": "index_split_049.html"
        },
        {
            "id": 50,
            "title": "利用光斑，拍出朦胧夜色",
            "number": 3,
            "fullNumber": "13.3",
            "content": "利用光斑，拍出朦胧夜色 对于刚开始学习摄影的朋友，我一直都在强调如何把照片拍清晰，保证主体的清晰度，这是摄影的基础。当我们需要进行一些有创意的拍摄的时候，也可以反其道而行之，就是有意地把照片拍模糊，但是要有选择地进行拍摄。  图8.22  图8.23 雨后的夜晚，在玻璃上会留下密集的水滴。这个时候拍摄玻璃，对焦的时候，要对焦到远处，而不是对焦在玻璃上。水滴反射户外的灯光，就能够拍出朦胧光斑的效果、模糊的效果，也能很好地衬托出雨夜的感觉，增强照片的氛围和代入感。  图8.24  图8.25 在城市的夜晚有很多的灯光，如果把星星点点的光源拍成光斑，可以增加画面的神秘感，使得夜景照片产生一种神秘的魅力。  图8.26  图8.27 因为手机会自动对焦，所以拍摄光斑的时候需要人工干预。使用手动对焦，先把焦点固定住。用手机近距离对准任何一个物体，然后长按3秒钟屏幕，就会出现锁定对焦的提示。这个时候，再移动手机，就不会自动变焦了。此时拍摄远距离场景，因为超出了焦距的范围，画面就变得很模糊了。对着光源的地方，降低曝光度，就可以拍出星星点点的光斑效果了。  扫码观看视频演示",
            "level": 2,
            "parentId": 47,
            "valid": 0,
            "href": "index_split_050.html"
        },
        {
            "id": 51,
            "title": "全景模式的多种玩法",
            "number": 4,
            "fullNumber": "13.4",
            "content": "全景模式的多种玩法 手机的全景模式可以帮助我们记录更大的场景，比如风光照，或者多人的合影。  图8.28　iPhone 6s Plus 库木塔格沙漠 新疆的库木塔格沙漠，使用全景拍摄，凸显沙漠的辽阔与荒芜。人物在画面中显得渺小而无力。全景的特点就是尽可能多地展现全貌，让你不错过任何的精彩。  图8.29　iPhone 6s Plus 天津 很有特点的天津滨海图书馆，内部设计现代、时尚，有序的线条感非常适合摄影。但是，仅拍摄局部总是无法展现这个建筑的大气和设计感，所以使用全景功能，以便完整地记录整个室内的所有信息。 常规全景模式 全景照片一般是默认从左到右移动拍摄，画面一次记录镜头中出现的场景。所以当我们拍摄的时候，需要双手拿住手机，双臂加紧躯干，以腰为轴，尽量保持双手平稳缓慢地横向移动，这样才能拍到最多的画面信息，防止因为手抖而动出现画面不完整的情况。而且，要尽量拍摄固定的场景，画面中如果有移动的人、车等物体，就会造成画面被分解的结果。  图8.30　iPhone 6s Plus 库尔勒  图8.31  图8.32 移动拍摄的时候，如果手持手机不稳，画面两边会出现信息不完整的情况，黑色的地方没有画面信息。 系统默认从左向右移动，是基于人们的使用习惯。但如果你想以相反的方向进行拍摄，也是可以实现的。苹果手机打开全景功能，点一下屏幕上取景的部分，即可自动调整方向。安卓因型号不同，方法也不同。比如努比亚手机的全景功能，起始位置在中间，它会根据你的移动方向判断拍摄方向。  图8.33　苹果手机示意图  图8.34　安卓手机示意图 全景分身法  图8.35　iPhone 8 Plus 芜湖 知道了全景成像的过程，我们就可以利用它的特性来创作了，比如最常见的“全景分身法”。  图8.36 在拍摄的时候想好人物的动作和位置，拍摄者手持手机站好位置，模特站在A的位置。手机屏幕向右移动，到达A的位置，停止移动。模特从A点跑到B点，站好。拍摄者移动手机到达B点时停止。然后模特向右跑到C点，拍摄者继续移动手机即可。  扫码观看视频演示 利用全景拍摄的原理，拍一个捉迷藏的效果。模特先在左边做出偷看的动作，拍摄者将手机移动到柱子的位置停下；模特再跑到柱子另一侧，做一个躲藏的动作，拍摄者继续移动手机，完成拍摄。  图8.37 竖拍全景 创意摄影就是为了打破惯性思维，把手里的手机拍照功能尽情发挥，拍出意想不到的效果。比如全景，除了横着拍，还可以竖着拍。使用方法和横向拍摄是一样的，只不过方向是从下到上。这种方法适合与高大建筑物合影，或者要拍摄比较高的场景，而手机镜头没办法囊括整个场景的时候。  图8.38 打开全景，横握手机，从下向上稳定移动手机拍摄，并且要持续移动，过程中尽量不要停顿。  图8.39　iPhone 8 Plus 北京 拍摄于三里屯，因为站的位置是一层，下面有一个下沉广场，相当于负二层，所以和周围高大的建筑相比，高度相差很大。如果想把广场的地面和建筑的全貌同时拍下，镜头无法容纳，只能使用全景竖拍模式进行拍摄。  扫码观看视频演示  图8.40　iPhone 8 Plus 芜湖 可以利用拍摄全景分身法的时间差，拍一个竖版的自己与自己的合影。打开手机全景模式，横着向上拍。手机移动到头顶后，模特跑到摄影师背后，手机继续向后移动。",
            "level": 2,
            "parentId": 47,
            "valid": 1,
            "href": "index_split_051.html"
        },
        {
            "id": 52,
            "title": "利用组图来讲故事",
            "number": 5,
            "fullNumber": "13.5",
            "content": "利用组图来讲故事 如果你经常去书店、图书馆，去翻看一些摄影的书籍，会发现，很多摄影师的书籍都是摄影作品集。他们往往用一本书，上百张照片来展示某个主题。所以，能否拍出有感染力的组照，才是检验摄影师的实力和投入程度的标准。 现在大部分人并不是想成为摄影师，他们拍照的目的都是为了发社交媒体（朋友圈、微博等），希望能得到更多人的关注。很多时候，笔者会选择发很多图片，因为一张照片可能没有办法展现笔者的所有想法。既然社交媒体设置成了九宫格，就说明，9张图片能够完整地展现一个场景，或者多角度地诠释某个主题。  图8.41  图8.42 当我们发九宫格的时候，往往是没有什么规划的，随便选择，或者东拼西凑。这样的做法其实起不到利用组图强化主题的作用，只是将单独的照片堆砌在了一起。 拍摄组图或者发布组图要注意统一性，包括主题统一、色调统一、尺寸统一、构图统一，等等。这样做的目的是保证“视觉友好”。可以设想一下，在信息爆炸的时代，刷着杂乱的朋友圈，突然一套视觉统一、风格统一的九宫格照片出现在你的眼前，是否会促使你停下来多看几眼？其实这样一来，发朋友圈的目的就达到了。  图8.43 色调统一，黑白系列。  图8.44 构图统一，全为正方形构图。  图8.45 主题统一，从不同角度展示人物特点。  图8.46 同一主题的不同风格。 组照可以很好地展现故事性，一张好的照片能够经久流传，往往是因为照片背后的故事打动人心。用一张照片讲一个好故事，非常的难。那么用组图来讲述，就是一种很好的方式。  图8.47 这组图拍自新疆库车的一个大巴扎，整个巴扎里全部是当地的维吾尔族人。如果想要记录他们的日常生活状态，用一张照片是很难做到的。现场的环境中，有男人，有女人，有老人，有孩子，每个人都有不同的状态。这种情况用组图的方式，既能拍到更多的画面，也能围绕着一个场景，展示更全面的信息。这组图片详细地描述了一个有浓厚地方特色的场景中，人们的日常状态。",
            "level": 2,
            "parentId": 47,
            "valid": 0,
            "href": "index_split_052.html"
        },
        {
            "id": 53,
            "title": "会飞的樱桃",
            "number": 6,
            "fullNumber": "13.6",
            "content": "会飞的樱桃 当我们学了构图、角度、光线等各种技巧后，有一些人会在摄影的时候，只用其中的一种，或者几种技巧，生搬硬套。这样一来，照片会拍得很死板、模式化。能否把这些技巧结合起来，有效地发挥各种技巧的特点，才是拉开大家摄影差距的重要原因。 确定了拍摄主题之后，要先在脑子里想好最终的效果，然后再想通过什么方法能够实现。拍摄只是实现想法的一个过程，摄影的重点不在于按快门的那一刻，而是按快门前你脑子里的想法。  图8.48　iPhone 8 Plus 这张照片，我起名叫“会飞的樱桃”，其实是食物摄影中常见的一种效果。对于专业摄影师来说，很简单。但是对于普通的摄影爱好者来说，可能很难想象这种效果是如何拍出来的。有人说是高空扔下来抓拍的，有人说是用很细的线吊起来拍的，还有人说是后期合成的。其实，通过这些方法都能实现，但是还有更简单的方法。 有的时候，摄影就是通过画面制造一种假象，比如这个樱桃后边的黑色，并不是空间，而是一个黑色的衣服。虽然我们看到，盘子是水平放置的，但是拍摄的时候其实是垂直于地面的。正是因为我们创造了一个周围没有参照物的虚拟空间，所以拍出来的照片才会以假乱真。  图8.49  图8.50  图8.51 拍摄步骤 1.用黑色衣服或者黑色的材料，布置一个90度（90）垂直的L形场景。 2.把盘子垂直于地面放置。 3.把樱桃摆放在黑色背景上，做成自由散落的状态。 4.手机从上至下，90度垂直拍摄。 5.通过后期降低背景的亮度，变成纯黑。 通过控制角度和错位，加上后期，就完成了这张“会飞的樱桃”。  扫码观看视频演示",
            "level": 2,
            "parentId": 47,
            "valid": 0,
            "href": "index_split_053.html"
        },
        {
            "id": 54,
            "title": "第九章 手机后期，让你的照片“变废为宝”",
            "number": 14,
            "fullNumber": "14",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_054.html"
        },
        {
            "id": 55,
            "title": "关注修图思路，而不只是结果",
            "number": 1,
            "fullNumber": "14.1",
            "content": "关注修图思路，而不只是结果 拍完一张照片后，不要马上去修图，而是要先想一下。就像拍照之前，在脑海里要有一个预想，然后根据你的预想去拍照。修图也是一样，你脑海里要有一个预期的效果，才能有针对性地修图。有的人拿过来照片就开始修，试试这种风格，试试那种风格，也不知道自己要什么风格，最后看哪个顺眼就用哪个。 修图前需要分析照片的特点，有哪些优缺点，什么地方需要保留，什么地方需要调整，确定思路后再动手修图。而且，手机自带的修图功能基本能满足日常修图的需求，不一定要依赖于App。",
            "level": 2,
            "parentId": 54,
            "valid": 0,
            "href": "index_split_055.html"
        },
        {
            "id": 56,
            "title": "二次构图让照片更聚焦",
            "number": 2,
            "fullNumber": "14.2",
            "content": "二次构图让照片更聚焦 我们在拍摄的时候已经运用了一些构图技巧，但可能因为拍摄条件的影响，拍得不理想；或者是抓拍、偷拍，拍的时候根本没办法想到构图。修图的第一步是对照片进行“二次构图”，包括“裁剪”和“旋转”。  图9.6  图9.7  图9.8 这张照片拍摄的时候，画面中有很多的羊，非常的密集，而且羊头布满画面，显得过于分散。通过二次构图，裁剪之后，只剩下中间的几头羊，成为三角构图。这样，画面的焦点就明确了，也不会出现多余的干扰元素。  图9.9  图9.10  图9.11 在火车站抓拍了一张旅客的照片。因为场景里人比较少，环境相对空旷，想突出旅人的孤独感，但是抓拍的时候没有时间想构图。原图是竖版的，而且周围有一些多余的人，但是这种有纵深感的场景，比较适合横向的构图，所以后期裁剪的时候，把正方形改成长方形，通过建筑的引导线，让照片更加的聚焦。  图9.12  图9.13  图9.14 遇到水面的时候，我都会尝试拍一些照片，因为水面倒影会带来一些意想不到的视觉效果。这张照片因为是在马路上拍摄的，周围环境杂乱，我想只记录这一个人，就通过旋转和裁剪，保留了人的脚和水中倒影，去掉周围杂乱的环境，来提升画面的趣味性。 合理的剪裁会让画面中的拍摄主体更加突出，视线更加聚焦。摄影是减法，不要不舍得裁剪。如果主体不突出，是没办法吸引人的。  扫码观看视频演示",
            "level": 2,
            "parentId": 54,
            "valid": 0,
            "href": "index_split_056.html"
        },
        {
            "id": 57,
            "title": "简单调整几个参数，照片就能不一样",
            "number": 3,
            "fullNumber": "14.3",
            "content": "简单调整几个参数，照片就能不一样 修图的每一个步骤都是为结果服务的。二次构图之后，需要对画面的细节进行调整，包括光效、明暗对比、色彩、氛围等参数。在“玩转对比”一章，我们学习了通过明暗对比强调主题的重要性。  图9.15  图9.16  图9.17 看这张图。我在拍摄的时候，这个植物在一棵树下面，阳光通过树枝的缝隙透过来一些零散的影子，我就想利用这个光影拍一个近距离的植物。左边的就是拍完的效果，光线对比不是那么明显，显得有点灰。所以后期的时候，降低曝光度，然后增加对比度，让画面明暗对比增强。因为光刚好照在叶子上，这样的话，修出来的拍摄主体——叶子部分就比较亮，背景环境比较暗。  图9.18  图9.19  图9.20 本来是一张平淡的照片，通过增加对比度，让照片中云彩的层次感更强，更有视觉冲击力。而且降低亮度后，鸟变成了剪影效果，更好地刻画了鸟的轮廓和姿态。因为原图光线不好，不能清晰地看到鸟本身的细节，索性调成剪影，显得更有神秘感。",
            "level": 2,
            "parentId": 54,
            "valid": 0,
            "href": "index_split_057.html"
        },
        {
            "id": 58,
            "title": "改变色温，让照片更有层次感",
            "number": 4,
            "fullNumber": "14.4",
            "content": "改变色温，让照片更有层次感 好看的照片是有温度的。我们学过通过冷暖对比，增加画面的层次感。当照片经过几步简单的调整之后，我们需要确定照片的氛围，比如，是想传递温暖阳光的感觉，还是冷酷严肃的感觉？通过手机自带的修图功能，即可调整色温。  图9.21  图9.22  图9.23 因为夕阳的环境更适合暖色调风格，所以提高照片的色温（色偏），使照片偏黄。  图9.24  图9.25  图9.26 降低色温（色偏），增加饱和度，使天空更蓝，让画面中的色彩对比更强烈。",
            "level": 2,
            "parentId": 54,
            "valid": 0,
            "href": "index_split_058.html"
        },
        {
            "id": 59,
            "title": "根据题材确定风格",
            "number": 5,
            "fullNumber": "14.5",
            "content": "根据题材确定风格 最后就是确定照片的风格，比如黑白风格、复古胶片风格、青春靓丽风格、低饱和度日系风格，等等。根据你的照片的主题来选择最能体现主题风格的滤镜。  图9.27  图9.28 这张照片是在一个咖啡厅拍的，当时是阴天。坐在窗边，光线相对亮一些。但是屋里的环境比较杂乱，所以显得人不是特别的突出。拍完之后进行了后期调整。最后我选择了黑白色调，这样，画面中窗外的光就直接能把人脸照亮了，周围杂乱的地方，因为黑白而变得相对统一，人会显得更突出。  图9.29  图9.30 在东京街头的停车场里，看到一辆年龄非常大的复古汽车。因为当时阳光很足，所以拍的照片饱和度比较高。但是这个复古汽车的题材更适合有岁月感的风格，于是后期确定风格的时候，就选用了复古胶片风格，让这个汽车更有年代感，能够令人感受到历史在它身上留下的痕迹。",
            "level": 2,
            "parentId": 54,
            "valid": 0,
            "href": "index_split_059.html"
        },
        {
            "id": 60,
            "title": "几款软件就可以满足你的修图需求",
            "number": 6,
            "fullNumber": "14.6",
            "content": "几款软件就可以满足你的修图需求  图9.31　Snapseed 这款软件被称为手机中的Photoshop，是手机修图中的神器，几乎所有的摄影师手机里都会安装的软件。苹果、安卓都可以免费下载。它的功能强大之处，不仅仅是能实现不同的后期效果，更重要的是它可以针对照片的局部进行调整。大部分软件在修图的时候，每个步骤都是针对整张照片进行调整的，如果我们有一些细节或者局部的地方需要单独调整，就没办法实现。Snapseed的优势正在于此。  图9.32  图9.33  扫码观看视频演示  图9.34　VSCO 人们都有怀旧情结，现在很多照片都走复古怀旧风格，所以大家喜欢下载一些滤镜功能强大的App。这款App的特点就是拥有强大的滤镜功能，有上百款各种风格的滤镜可供选择，而且滤镜都是偏向于复古风格。VSCO的人气颇高，我们看到全球iPhone摄影大赛的众多参赛作品中，大部分都会应用这款软件进行后期。但它也并非只有滤镜强大，依然拥有很丰富的细节参数可供调整。  图9.35  图9.36  扫码观看视频演示  图9.37　黄油相机 为了让照片能够传递某些特定的情绪，并留下时间，很多人喜欢在照片上添加各种文字。加上边框，加上文字，一张照片瞬间变成漂亮的卡片。在各种节日、节气的时候，拍摄特定题材的照片，也可以配上符合情境的文字来烘托气氛。黄油相机的特点就是拥有非常多的文字模板和素材，基本能够满足日常的需求，而且文字模板可以根据自己的需求和喜好自由修改和组合，避免出现太多风格雷同的照片。  图9.38  图9.39  扫码观看视频演示  图9.40　慢快门相机（Slow Shutter Cam） 在前面的章节中，我们讲到可以通过动静、虚实的对比增加画面的动感和层次感。一般拍摄的方法是使用慢门。如果手机自带慢门效果，可以直接拍摄；如果没有这些功能，就需要借助软件来实现了。慢快门相机（Slow Shutter Cam，之前版本为 Slow Shutter）可以通过手动调整快门时间来延长拍摄时间，从而拍出流水雾化、车水马龙，甚至星空星轨的效果。  图9.41  图9.42  扫码观看视频演示",
            "level": 2,
            "parentId": 54,
            "valid": 0,
            "href": "index_split_060.html"
        },
        {
            "id": 61,
            "title": "手机修图神器Snapseed实操技巧",
            "number": 7,
            "fullNumber": "14.7",
            "content": "手机修图神器Snapseed实操技巧 接下来的篇幅，我们重点介绍一下Snapseed这个软件的部分功能。当我们熟练使用一款软件的时候，才知道不同功能会给照片带来什么样的效果，才能提高修图的效率。 突出细节  图9.43  图9.44 在这个功能里有两个参数:“结构”和“锐化”。 能否拍出一张好照片，由很多因素决定，比如拍摄时间、光线条件、拍摄角度，等等。而大部分人遇到的问题就是照片拍出来显得平淡，灰蒙蒙的，质感不强，跟我们看到的真实场景有很大的差距。所以，后期的目的就是把照片还原得更加真实。 结构的数值范围是-100~100，提高结构数值能对照片不同的区域进行综合的调整，让照片颗粒感更强，对比更突出。但如果数值过大，也会给照片带来比较“脏”的感觉，所以要根据照片调整为适合的数值，力求自然。 降低数值，能够减少细节的对比，使照片显得更加平滑。比如你想突出海面的静谧感，可以降低结构数值，来提升平滑的效果。  图9.45  图9.46 图9.45为结构数值最高的效果，天空的云层次感很明显，明暗对比强烈，地面的植物细节也很突出。不过，数值过大造成的结果就是天空显得有些“脏”。图9.46为结构数值最低的效果，天空的云显得很柔和，没有细节，也没有层次感，反而令人感觉有点不真实。  图9.47  图9.48 图9.47为原图，海面比较平静，但是依然会有一些波纹。图9.48为结构数值最低的效果，整个海面和天空融为一体，显得非常平滑、统一，而人和船的剪影在照片中就显得更加突出，照片风格也更加简洁。 锐化的数值范围是0~100。提高锐化数值，可以加强照片中每个像素点的边缘区分度（一张数码照片是由无数个像素点构成的）。这个效果也能增强照片的颗粒感和细节的细致程度。锐化的效果要比结构弱一些，不过，任何参数调整的时候都不要过度。  图9.49  图9.50 图9.49为原图，图9.50为锐化最大值效果，对比效果并不是很明显，但仔细看地面的植物和路面，能够看出颗粒感更强一点。 透视  图9.51 由于拍摄角度、距离等原因，我们拍的一些建筑类的照片会基于透视原理而产生变形，从而降低照片的视觉效果。一个仰拍的建筑和一个平时拍摄的建筑相比，后者的视觉效果会更优。透视的功能可以帮助我们对照片的角度进行校正。  图9.52  图9.53  图9.54 图9.52为原图，由于透视原因，建筑都不正。通过透视里的【斜切】功能，上下调整角度，可以把建筑修正。图9.54为最终效果。  图9.55  图9.56  图9.57 图9.55的门因为近距离拍摄，产生了倾斜的畸变。通过【斜切】向下滑动，调整畸变，把门调整成平视角度。图9.57为最终效果。 画笔  图9.58 前面讲过，Snapseed可以对照片进行局部调整，画笔就是一个非常实用的功能。它可以通过用手指涂抹照片的局部，对照片的明暗、曝光、色温、饱和度进行调整。 下方根据数值不同，可以调整修图的强度。右边的“眼睛”标志可以显示你的操作区域，点开后，操作区域为红色。  图9.59 画笔有四种效果：加光减光、曝光度、色温、饱和度。  图9.60 加光会让照片变亮，减光则相反。照片中间的圆球部分为减光效果，变得更黑了。  图9.61 曝光和加光减光效果类似，只是强度更大。画面中左边为降低曝光效果，右边为增加曝光效果。  图9.62 色温可以调整局部的颜色。右边为增加色温，颜色变暖；左侧为降低色温，颜色变冷。饱和度会使颜色变得更浓或更淡。 修复  图9.63 有时候我们拍了一张照片，无奈的是，总有路人甲经过。或者自拍照中，脸上有恼人的小痘痘。我们多数时候会用美颜功能修图，但是美颜功能的效果比较假，所以不建议经常使用。修复功能可以帮我们去除画面中一些多余的元素，比如修掉一个多余的人、多余的杂物，或者修掉皮肤上的痘痘、皱纹等。  图9.64  图9.65  图9.66 用手指直接涂抹想修复的位置即可，红色区域（图9.65）代表修图区域。如果要修复的位置比较小，一定要把照片放大修图，因为手指太粗，手机屏幕太小，容易干扰到其他部位。 蒙版 这个功能并没有在工具栏里单独拿出来，因为它是对所有功能都适用的一个辅助功能。蒙版的作用是对你的操作进行二次微调，实现对局部效果的调整。这个功能是这款软件的强大之处。如果你学过数码摄影后期，应该知道蒙版功能的重要之处，多数手机修图软件是无法实现的。Snapseed可以利用蒙版功能实现更多的效果。 以双重曝光效果为例。  图9.67  图9.68 打开一张照片，选择双重曝光。点击左下角“加号”，添加另一张照片。调整位置，点击对勾确定。  图9.69  图9.70  图9.71 下面进入蒙版功能，把鲸鱼周围的白色背景去除。 点击右上角【剪头】按钮，选择【查看修改内容】，点击双重曝光中间的【画笔】按钮。  图9.72  图9.73 用手涂抹鲸鱼周围的部分，进行擦除。如果不慎把鲸鱼擦掉，可以选择下方的曝光值，调整到100，被涂抹的鲸鱼部分即可恢复。图9.73为最终效果。 蒙版功能可以应用到很多效果中，大家快去摸索摸索吧。  扫码观看视频演示",
            "level": 2,
            "parentId": 54,
            "valid": 1,
            "href": "index_split_061.html"
        },
        {
            "id": 62,
            "title": "第十章 短视频时代，如何用手机记录生活点滴",
            "number": 15,
            "fullNumber": "15",
            "content": "",
            "level": 1,
            "parentId": null,
            "valid": 0,
            "href": "index_split_062.html"
        },
        {
            "id": 63,
            "title": "拍视频之前，这些概念要了解",
            "number": 1,
            "fullNumber": "15.1",
            "content": "拍视频之前，这些概念要了解 分辨率  图10.1  图10.2  图10.3 左侧为低像素，右侧为高像素。 分辨率就是屏幕的清晰程度。图像是由很多像素构成的，如果你把一张照片一直放大，你会看到照片由很多不同颜色的小方块组成。 比如iPhone 8 Plus这个手机的分辨率是1920×1080，是指屏幕垂直排列的像素为1920个，横向排列的为1080个，两者相乘等于2073600，这个屏幕由200多万个像素点构成。分辨率越高，说明组成画面的像素点越多，画面越细腻、清晰。  图10.4 手机像素 刚才讲了，分辨率是像素的数量，那手机的摄像头像素是什么意思呢？举例来说，1200万像素的摄像头，是指它能拍出来的照片由1200万个像素组成。刚才说iPhone 8 Plus屏幕分辨率是200万，那么这1200万的像素不是浪费了吗？其实不是这样的。我们拍一个照片，或者视频，不是只在手机上看的。如果你上传到电脑上观看的话，比如15寸的苹果电脑的分辨率2880×1880，像素有540多万。手机摄像头的像素是指能拍出多大的照片。当然，并不是说像素越大，照片画质越好。 帧数 在拍视频的时候，还有一个比较重要的参数叫帧数（fps）。因为照片是静态图像，你按一次快门就是一张照片，但是视频是动态的。视频是由很多连续的照片组成的，那么帧数就代表1秒钟能播放的静止画面的数量。 只要1秒钟连续播放超过10张静止画面，人类的眼睛就能看到连续的画面。所以，最早期的电影帧数都是12帧。后来，为了提升人眼的舒适感和影像的逼真程度，电影帧数改为24帧，这也是目前电影的标准帧数。 但这是电影，如果我们用手机、电脑观看视频，24帧可能会出现卡顿，因为显示器播放过于复杂的画面，或者高负荷工作，它的功率会下降。所以，为了保证流畅度，显示器都保持在50~60帧的分辨率。 手机里还有个慢动作的设置，那为什么慢动作的帧数这么多呢？刚才讲了，24帧是电影的标准帧数，而慢动作的播放比正常速度慢10倍，相当于1秒钟的内容用10秒钟来播放，那10秒钟看24帧图像是一定会卡顿的。所以，使用240帧就是保证1秒钟至少有24帧的输出。  图10.5  图10.6 最低是720p，30帧，这种效果能保证最基本的高清。1080p的，能够提升画面的细腻程度，也能提升录音的质量，因为视频要考虑到音频的效果。后边的60帧，就会使画面更加的细腻，比如放到电脑上看，也能保证清晰度。4k就是分辨率4096×2160的视频，总像素超过800万，比1080p更清晰。至于选择什么效果，则要看你的观看终端。如果就在手机上看看，1080p就可以了，毕竟分辨率越大，占用内存越多。",
            "level": 2,
            "parentId": 62,
            "valid": 1,
            "href": "index_split_063.html"
        },
        {
            "id": 64,
            "title": "如何保证视频的清晰度",
            "number": 2,
            "fullNumber": "15.2",
            "content": "如何保证视频的清晰度 说到清晰度，相信是很多人心中的痛。在我的摄影课程里，很多学员一上来就问我：“老师，为什么我的照片拍得总是很模糊？是因为我的手机太便宜了吗？”视频也是一样的，我将视频发到抖音上，很多粉丝留言说：“为什么你的视频这么清晰，我上传的就很模糊？”手机分辨率越来越高，像素越来越高，有的人用着最新款的手机，却拍着最模糊的照片。 我们讲过分辨率、帧数、像素这些概念，其实很多人并不会调，或者根本不知道这些可以调整。所以，他们使用的都是默认的设置，或者为了不占用空间，都调成最小的参数，那样拍出来的照片视频肯定会比较模糊的。 除了手机里的设置，我们还可以通过哪些方式来保证清晰度呢？其实可以借助辅助设备来协助拍摄。 比如拍摄一个1分钟的视频，可能你感觉时间很短，但是让你举着手机1分钟，你会非常累的，而且你也无法保证手一直不动。所以，视频拍出来经常会晃。经常晃来晃去的，肯定就会影响画面的清晰度。 三脚架 拍视频最常用的一个工具就是三脚架，因为它能够保证画面的稳定，拍多久都可以保证画面的稳定性。我们后边讲到延时摄影、慢动作的时候，都需要用到三脚架。如果只用手机拍摄，可以购买一个便携的手机三脚架，小巧、方便，但是因为短小，也会带来一些不便，比如太矮了。这个就要根据自己的需求来采购了。手机拍照片还是以便利为主，所以，配件也不要太复杂了，那样会成为累赘。  图10.7  图10.8 手持稳定器  图10.9  图10.10  图10.11 稳定器自带拍摄软件界面 这是近两年出来的一种拍摄工具。因为拍摄运动的场景时，手持和三脚架都解决不了抖动的问题，所以现在推出的稳定器是一种很实用的工具，它可以通过算法保证手机的平衡和稳定。即使晃动、抖动、旋转角度，手机也会保持在一个水平的状态，而且可以设置不同的拍摄模式和效果，可以拍出电影版的质感效果。  扫码观看视频演示 它自带的软件，功能很丰富，包括延时摄影、慢镜头，还可以自动进行人脸追踪，保证画面清晰度。此外，还可以直接快速剪辑视频。对于视频拍摄频率高的人，建议配备。  图10.12 稳定器搭配三脚架使用。 寻找依靠点  图10.13 如果你不想每天都带着这些设备，或者在外面突然看到了某个场景，特别想拍下来，该怎么办？我们知道，使用辅助设备是为了让手机固定不动，那我们就找一个安全的位置把手机固定好，让手机保持稳定。  图10.14 用一个纸杯也可以自制一个稳定座，保证手机不动。至于用什么，就要看大家的观察力和脑洞了。  扫码观看视频演示  图10.15  图10.16 图10.15为苹果手机锁定对焦后的效果；图10.16为安卓手机锁定对焦后的效果，出现了一把锁。 这个功能可能很多人都不知道，算是一个隐藏功能，那就是锁定对焦。智能手机会自动对焦，它会自动判断画面，来确定焦点的位置。如果画面中有移动的物体经过，或者光线明暗发生变化，你会发现，画面的焦点在一直变化。因为手机需要重新对焦，所以就会经历一个模糊→清晰→模糊→清晰的反复确认的过程，这时拍的视频就会抖动，造成模糊的情况。 在拍摄的时候，如果想保证画面持续固定焦点，就长按屏幕，会出现锁定对焦曝光的提示。这个时候，屏幕的焦点是固定的，不会因为画面中有移动的物体，或者有光线变化而影响对焦效果。",
            "level": 2,
            "parentId": 62,
            "valid": 1,
            "href": "index_split_064.html"
        },
        {
            "id": 65,
            "title": "大片必用的延时摄影",
            "number": 3,
            "fullNumber": "15.3",
            "content": "大片必用的延时摄影 延时摄影是一种常用的视频拍摄手法，可以理解为“快动作”。比如拍摄10分钟的视频，会被压缩成10秒钟，整体呈现为快动作效果。现在的手机都会自带延时摄影的功能。使用这种功能适合拍摄移动物体，或者自然风光，比如天空飘动的云层、路上的车流、日出日落。能凸显宏大、气势磅礴的感觉。记录时间流逝、快节奏的活动，或者自然环境变化，都可以使用延时摄影，把很长的时间压缩呈现。  图10.17  图10.18  扫码观看视频演示 拍摄延时摄影要注意的5点 1.使用三脚架或者寻找一个固定的位置进行拍摄，不要手持拍摄。因为延时摄影至少需要10分钟，用手持不仅自己累，画面也会晃动，影响画质。 2.拍摄时请打开【飞行模式】，避免拍摄过程中电话、信息等打断拍摄。 3.如果需要长时间拍摄，比如超过30分钟，或者在比较热、比较冷的环境中拍摄，注意携带充电宝，并在拍摄前链接手机。拍摄视频比较耗电。 4.使用【锁定对焦】，保证长时间的画面流动不会影响画面对焦，保证清晰度。 5.为了减少画面的抖动，可以使用蓝牙遥控器或者耳机线作为快门。耳机线插入耳机孔后，音量键可作为快门使用。",
            "level": 2,
            "parentId": 62,
            "valid": 0,
            "href": "index_split_065.html"
        },
        {
            "id": 66,
            "title": "带动情绪的慢动作",
            "number": 4,
            "fullNumber": "15.4",
            "content": "带动情绪的慢动作 慢动作比较容易理解，前文也提到了慢动作拍摄的一些原理。慢动作比较适合拍摄一些微观或者凸显细节的场景，比如人的表情、动作、水滴、火焰、食物制作过程，等等。它的目的是突出细节和质感，营造氛围，比如电影中催人泪下的场景，充满恐惧、死亡的场面，炫酷的动作，都会使用慢镜头，这样能产生很好的氛围和代入感。 使用手机拍摄慢动作之后，可以根据自己的需求，在手机上选择慢动作的时间段。  图10.19  图10.20  扫码观看视频演示 拍摄慢动作要注意的5点 1.使用三脚架、稳定器或者寻找一个固定的位置进行拍摄。无论是什么形式的视频，想要保证画面的稳定性，三脚架都是一个重要的伙伴。很多时候，慢镜头都是近距离拍特写，所以对画质的稳定性要求会更高。 2.拍摄时请打开【飞行模式】，避免拍摄过程中电话、信息等打断拍摄。 3.如果需要长时间拍摄，或者在比较热、比较冷的环境中拍摄，注意携带充电宝，并在拍摄前链接手机。拍摄视频比较耗电。 4.使用【锁定对焦】，保证长时间的画面流动不会影响画面对焦，保证清晰度。 5.为了尽量减少画面的抖动，可以使用蓝牙遥控器或者耳机线作为快门。耳机线插入耳机孔后，音量键可作为快门使用。",
            "level": 2,
            "parentId": 62,
            "valid": 0,
            "href": "index_split_066.html"
        },
        {
            "id": 67,
            "title": "有足够的素材，才能剪出丰富的视频",
            "number": 5,
            "fullNumber": "15.5",
            "content": "有足够的素材，才能剪出丰富的视频 一个2小时的电影，也许要拍100小时的素材，最后才能剪辑成电影。短视频也是一样的道理，我发在抖音上的短视频，一般是30秒钟左右，但是拍摄的素材至少是3分钟。剪视频就是在有限的时间里，尽可能地展示精华部分。  图10.21 一个倒水的镜头，可以从上面、侧面、近距离特写等不同的角度拍摄。 如果要拍摄一个视频，一定要注意素材的积累，只可多，不可少。比如拍摄一个人物，可以从正面、侧面、背面等不同的角度拍摄；拍摄一个风光，也可以通过不同时间段进行拍摄。平时也要有记录素材的习惯，经常拍摄一些有趣的场景，或者“空镜头”（通用的场景，可以用在多种视频中，比如蓝天白云、花卉、街景等，即没有明显的主题或者指向性的镜头）。  图10.22 图10.22为一个景区拍摄，3天的素材，有300多个视频。  扫码观看视频演示",
            "level": 2,
            "parentId": 62,
            "valid": 0,
            "href": "index_split_067.html"
        },
        {
            "id": 68,
            "title": "用手机剪出电影质感的大片",
            "number": 6,
            "fullNumber": "15.6",
            "content": "用手机剪出电影质感的大片 手机自带的功能中，对于照片的后期修图功能都比较丰富，但是对于视频的后期加工就有些勉强了。所以，一般剪辑视频都会使用一些软件，用手机就可以快速地进行操作。剪辑视频一般会有几种需求，如剪切、拼接素材，调整速度，插入图片、文字等。  图10.23　巧影 巧影是一款功能比较丰富而且容易上手操作的软件，通过手机就可以满足最基本的视频剪辑需求。 视频裁剪、拼接  图10.24 当我们需要截取视频中的某一部分，或者需要把两个视频连接在一起的时候，点击界面中的素材，选择要截取的位置，点击右上角操作区的【裁剪/拆分】，即可实现从“指针处断开”“删除指针左侧内容”“删除指针右侧内容”等效果。  图10.25 如果需要添加其他视频，点击右上角操作区的【媒体】，即可选择添加手机相册中的视频或者照片。 调整视频速度  图10.26 点击需要调整视频速度的素材，在右上角操作区的【速度控制】中，可以提高或降低视频的播放速度。 旋转素材角度  图10.27 有时拍摄的素材角度不同，有横版，有竖版。所以后期剪辑的时候，需要把方向统一。操作方法依然是在右上角操作区，选择【旋转/镜像】即可调整素材的角度。 添加音频或旁白  图10.28 把指针放到开始出现音乐的位置，点击右上角操作区的【音频】，即可添加素材库里自带的音乐或者自己手机中的音效素材。如果想配音、加旁白，点击【语音】即可开始录制。 添加图片文字  图10.29 如果想在视频上添加一些卡通图标、文字，或者图片，可以点击右上角操作区的【分层】。可以添加很多的素材，包括视频、图片、文字、视频特效等。 如何保存分享  图10.30  图10.31 视频编辑结束后，点击右上角的箭头，然后根据需求选择分辨率和帧频，选择导出。最后选择文件标签右边的导出箭头，储存视频即可。  扫码观看视频演示  扫描二维码即刻了解更多好书Table of ContentsTable of Contents 内容提要 插图 推荐序1 推荐序2 前言 第一章 解锁手机拍照的隐藏技能，轻松拍好照片 第二章 6种实用构图技巧，学会经营画面 第三章 常见的4种光线，利用光影拍出有氛围的照片 第四章 改变拍摄视角，让你看到全新的一面 第五章 4种普通场景，换个思路就能拍出大片 第六章 如何拍出有质感的黑白照片 第七章 利用对比，增强照片的层次感 第八章 照片不仅要好看，还要拍得好玩 第九章 手机后期，让你的照片“变废为宝” 第十章 短视频时代，如何用手机记录生活点滴",
            "level": 2,
            "parentId": 62,
            "valid": 1,
            "href": "index_split_068.html"
        }
    ],
    "lang": "zh-cn"
}